$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.5.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'buffer_compat.h' => 1,
                         'bufferevent.h' => 1,
                         'bufferevent_compat.h' => 1,
                         'bufferevent_struct.h' => 1,
                         'dns.h' => 1,
                         'dns_compat.h' => 1,
                         'dns_struct.h' => 1,
                         'event.h' => 1,
                         'event_compat.h' => 1,
                         'event_struct.h' => 1,
                         'http.h' => 1,
                         'http_compat.h' => 1,
                         'http_struct.h' => 1,
                         'keyvalq_struct.h' => 1,
                         'listener.h' => 1,
                         'rpc.h' => 1,
                         'rpc_struct.h' => 1,
                         'tag.h' => 1,
                         'thread.h' => 1,
                         'util.h' => 1,
                         'watch.h' => 1,
                         'ws.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libevent-2.2.so.1.0.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1

                                                      'evutil_secure_rng_set_urandom_device_file' => 1,
                                                      'evutil_set_evdns_getaddrinfo_cancel_fn_' => 1,
                                                      'evutil_set_evdns_getaddrinfo_fn_' => 1,
                                                      'evutil_snprintf' => 1,
                                                      'evutil_sockaddr_cmp' => 1,
                                                      'evutil_sockaddr_is_loopback_' => 1,
                                                      'evutil_socket_' => 1,
                                                      'evutil_socket_connect_' => 1,
                                                      'evutil_socket_finished_connecting_' => 1,
                                                      'evutil_socketpair' => 1,
                                                      'evutil_strtoll' => 1,
                                                      'evutil_tv_to_msec_' => 1,
                                                      'evutil_usleep_' => 1,
                                                      'evutil_v4addr_is_local_' => 1,
                                                      'evutil_v6addr_is_local_' => 1,
                                                      'evutil_vsnprintf' => 1,
                                                      'evutil_weakrand_' => 1,
                                                      'evutil_weakrand_range_' => 1,
                                                      'evutil_weakrand_seed_' => 1,
                                                      'evwatch_base' => 1,
                                                      'evwatch_check_new' => 1,
                                                      'evwatch_free' => 1,
                                                      'evwatch_prepare_get_timeout' => 1,
                                                      'evwatch_prepare_new' => 1,
                                                      'evws_close' => 1,
                                                      'evws_connection_free' => 1,
                                                      'evws_connection_get_bufferevent' => 1,
                                                      'evws_connection_set_closecb' => 1,
                                                      'evws_new_session' => 1,
                                                      'evws_send' => 1,
                                                      'libevent_global_shutdown' => 1,
                                                      'nil_eventop' => -64,
                                                      'pollops' => -64,
                                                      'selectops' => -64,
                                                      'sigfd_init_' => 1
                                                    }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '108' => {
                                     'BaseType' => '57',
                                     'Header' => 'types.h',
                                     'Line' => '39',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '108839' => {
                                        'BaseType' => '64',
                                        'Header' => 'types.h',
                                        'Line' => '197',
                                        'Name' => '__socklen_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '109656' => {
                                        'BaseType' => '108839',
                                        'Header' => 'unistd.h',
                                        'Line' => '277',
                                        'Name' => 'socklen_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '110847' => {
                                        'Header' => 'netdb.h',
                                        'Line' => '565',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ai_flags',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'ai_family',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'ai_socktype',
                                                             'offset' => '8',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'ai_protocol',
                                                             'offset' => '12',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'ai_addrlen',
                                                             'offset' => '16',
                                                             'type' => '109656'
                                                           },
                                                    '5' => {
                                                             'name' => 'ai_addr',
                                                             'offset' => '24',
                                                             'type' => '754'
                                                           },
                                                    '6' => {
                                                             'name' => 'ai_canonname',
                                                             'offset' => '32',
                                                             'type' => '370'
                                                           },
                                                    '7' => {
                                                             'name' => 'ai_next',
                                                             'offset' => '40',
                                                             'type' => '110970'
                                                           }
                                                  },
                                        'Name' => 'struct addrinfo',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '110965' => {
                                        'BaseType' => '110847',
                                        'Name' => 'struct addrinfo const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '110970' => {
                                        'BaseType' => '110847',
                                        'Name' => 'struct addrinfo*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110976' => {
                                        'BaseType' => '110965',
                                        'Name' => 'struct addrinfo const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112710' => {
                                        'BaseType' => '112716',
                                        'Name' => 'struct evdns_base*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112716' => {
                                        'Line' => '360',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'req_heads',
                                                             'offset' => '0',
                                                             'type' => '296463'
                                                           },
                                                    '1' => {
                                                             'name' => 'req_waiting_head',
                                                             'offset' => '8',
                                                             'type' => '295183'
                                                           },
                                                    '10' => {
                                                              'name' => 'global_max_reissues',
                                                              'offset' => '72',
                                                              'type' => '119'
                                                            },
                                                    '11' => {
                                                              'name' => 'global_max_retransmits',
                                                              'offset' => '76',
                                                              'type' => '119'
                                                            },
                                                    '12' => {
                                                              'name' => 'global_max_nameserver_timeout',
                                                              'offset' => '80',
                                                              'type' => '119'
                                                            },
                                                    '13' => {
                                                              'name' => 'global_randomize_case',
                                                              'offset' => '84',
                                                              'type' => '119'
                                                            },
                                                    '14' => {
                                                              'name' => 'global_max_udp_size',
                                                              'offset' => '88',
                                                              'type' => '3678'
                                                            },
                                                    '15' => {
                                                              'name' => 'global_nameserver_probe_initial_timeout',
                                                              'offset' => '96',
                                                              'type' => '501'
                                                            },
                                                    '16' => {
                                                              'name' => 'global_tcp_flags',
                                                              'offset' => '112',
                                                              'type' => '3678'
                                                            },
                                                    '17' => {
                                                              'name' => 'global_tcp_idle_timeout',
                                                              'offset' => '120',
                                                              'type' => '501'
                                                            },
                                                    '18' => {
                                                              'name' => 'global_outgoing_address',
                                                              'offset' => '136',
                                                              'type' => '232432'
                                                            },
                                                    '19' => {
                                                              'name' => 'global_outgoing_addrlen',
                                                              'offset' => '264',
                                                              'type' => '109656'
                                                            },
                                                    '2' => {
                                                             'name' => 'server_head',
                                                             'offset' => '16',
                                                             'type' => '295524'
                                                           },
                                                    '20' => {
                                                              'name' => 'global_getaddrinfo_allow_skew',
                                                              'offset' => '272',
                                                              'type' => '501'
                                                            },
                                                    '21' => {
                                                              'name' => 'so_rcvbuf',
                                                              'offset' => '288',
                                                              'type' => '119'
                                                            },
                                                    '22' => {
                                                              'name' => 'so_sndbuf',
                                                              'offset' => '292',
                                                              'type' => '119'
                                                            },
                                                    '23' => {
                                                              'name' => 'getaddrinfo_ipv4_timeouts',
                                                              'offset' => '296',
                                                              'type' => '119'
                                                            },
                                                    '24' => {
                                                              'name' => 'getaddrinfo_ipv6_timeouts',
                                                              'offset' => '300',
                                                              'type' => '119'
                                                            },
                                                    '25' => {
                                                              'name' => 'getaddrinfo_ipv4_answered',
                                                              'offset' => '304',
                                                              'type' => '119'
                                                            },
                                                    '26' => {
                                                              'name' => 'getaddrinfo_ipv6_answered',
                                                              'offset' => '308',
                                                              'type' => '119'
                                                            },
                                                    '27' => {
                                                              'name' => 'global_search_state',
                                                              'offset' => '312',
                                                              'type' => '295265'
                                                            },
                                                    '28' => {
                                                              'name' => 'hostsdb',
                                                              'offset' => '320',
                                                              'type' => '296345'
                                                            },
                                                    '29' => {
                                                              'name' => 'lock',
                                                              'offset' => '336',
                                                              'type' => '319'
                                                            },
                                                    '3' => {
                                                             'name' => 'n_req_heads',
                                                             'offset' => '24',
                                                             'type' => '119'
                                                           },
                                                    '30' => {
                                                              'name' => 'disable_when_inactive',
                                                              'offset' => '344',
                                                              'type' => '119'
                                                            },
                                                    '31' => {
                                                              'name' => 'ns_max_probe_timeout',
                                                              'offset' => '348',
                                                              'type' => '119'
                                                            },
                                                    '32' => {
                                                              'name' => 'ns_timeout_backoff_factor',
                                                              'offset' => '352',
                                                              'type' => '119'
                                                            },
                                                    '4' => {
                                                             'name' => 'event_base',
                                                             'offset' => '32',
                                                             'type' => '6587'
                                                           },
                                                    '5' => {
                                                             'name' => 'global_good_nameservers',
                                                             'offset' => '40',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'global_requests_inflight',
                                                             'offset' => '44',
                                                             'type' => '119'
                                                           },
                                                    '7' => {
                                                             'name' => 'global_requests_waiting',
                                                             'offset' => '48',
                                                             'type' => '119'
                                                           },
                                                    '8' => {
                                                             'name' => 'global_max_requests_inflight',
                                                             'offset' => '52',
                                                             'type' => '119'
                                                           },
                                                    '9' => {
                                                             'name' => 'global_timeout',
                                                             'offset' => '56',
                                                             'type' => '501'
                                                           }
                                                  },
                                        'Name' => 'struct evdns_base',
                                        'PrivateABI' => 1,
                                        'Size' => '360',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '1144' => {
                                      'BaseType' => '727',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '119' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '122714' => {
                                        'BaseType' => '1534',
                                        'Header' => 'FILE.h',
                                        'Line' => '7',
                                        'Name' => 'FILE',
                                        'PrivateABI' => 1,
                                        'Size' => '216',
                                        'Type' => 'Typedef'
                                      },
                          '124383' => {
                                        'BaseType' => '4174',
                                        'Header' => 'event.h',
                                        'Line' => '1046',
                                        'Name' => 'event_callback_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '124422' => {
                                        'BaseType' => '4201',
                                        'Header' => 'event.h',
                                        'Line' => '1178',
                                        'Name' => 'event_finalize_callback_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '124571' => {
                                        'BaseType' => '4229',
                                        'Name' => 'struct event const',
                                        'Size' => '120',
                                        'Type' => 'Const'
                                      },
                          '124576' => {
                                        'BaseType' => '124588',
                                        'Header' => 'event.h',
                                        'Line' => '1622',
                                        'Name' => 'event_base_foreach_event_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '124588' => {
                                        'Name' => 'int(*)(struct event_base const*, struct event const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '124619'
                                                            },
                                                     '1' => {
                                                              'type' => '125282'
                                                            },
                                                     '2' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '124619' => {
                                        'BaseType' => '125277',
                                        'Name' => 'struct event_base const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '125277' => {
                                        'BaseType' => '4338',
                                        'Name' => 'struct event_base const',
                                        'Size' => '1208',
                                        'Type' => 'Const'
                                      },
                          '125282' => {
                                        'BaseType' => '124571',
                                        'Name' => 'struct event const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126' => {
                                     'BaseType' => '119',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '127160' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '401',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '127236'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '127242'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-event-internal.h-401',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '127196' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '400',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '127160'
                                                           },
                                                    '1' => {
                                                             'name' => 'avoid_method',
                                                             'offset' => '16',
                                                             'type' => '2162'
                                                           }
                                                  },
                                        'Name' => 'struct event_config_entry',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '127236' => {
                                        'BaseType' => '127196',
                                        'Name' => 'struct event_config_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '127242' => {
                                        'BaseType' => '127236',
                                        'Name' => 'struct event_config_entry**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '127248' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '409',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '127236'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '127242'
                                                           }
                                                  },
                                        'Name' => 'struct event_configq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '127288' => {
                                        'Header' => 'event.h',
                                        'Line' => '408',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entries',
                                                             'offset' => '0',
                                                             'type' => '127248'
                                                           },
                                                    '1' => {
                                                             'name' => 'n_cpus_hint',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_dispatch_interval',
                                                             'offset' => '24',
                                                             'type' => '501'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_dispatch_callbacks',
                                                             'offset' => '40',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'limit_callbacks_after_prio',
                                                             'offset' => '44',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'require_features',
                                                             'offset' => '48',
                                                             'type' => '4047'
                                                           },
                                                    '6' => {
                                                             'name' => 'flags',
                                                             'offset' => '52',
                                                             'type' => '4090'
                                                           }
                                                  },
                                        'Name' => 'struct event_config',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '127393' => {
                                        'BaseType' => '127288',
                                        'Name' => 'struct event_config const',
                                        'Size' => '56',
                                        'Type' => 'Const'
                                      },
                          '128242' => {
                                        'Name' => 'void*(*)(size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '421'
                                                            }
                                                   },
                                        'Return' => '319',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '128290' => {
                                        'Name' => 'void*(*)(void*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            },
                                                     '1' => {
                                                              'type' => '421'
                                                            }
                                                   },
                                        'Return' => '319',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1287' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '131' => {
                                     'BaseType' => '64',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '132391' => {
                                        'BaseType' => '122714',
                                        'Name' => 'FILE*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '43',
                                     'Name' => '__int64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '14300' => {
                                       'BaseType' => '1954',
                                       'Name' => 'struct __va_list_tag*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14503' => {
                                       'BaseType' => '5023',
                                       'Name' => 'struct evbuffer_ptr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '146042' => {
                                        'BaseType' => '6587',
                                        'Name' => 'struct event_base**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '146054' => {
                                        'BaseType' => '124383',
                                        'Name' => 'event_callback_fn*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '14952' => {
                                       'BaseType' => '5060',
                                       'Name' => 'struct evbuffer_ptr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '14958' => {
                                       'BaseType' => '52',
                                       'Name' => 'unsigned char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '153' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1534' => {
                                      'Header' => 'libio.h',
                                      'Line' => '245',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '370'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '370'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '370'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '2071'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '2077'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '119'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '119'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '237'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '57'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '83'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '2083'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '370'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '2099'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '248'
                                                          },
                                                  '22' => {
                                                            'name' => '__pad1',
                                                            'offset' => '152',
                                                            'type' => '319'
                                                          },
                                                  '23' => {
                                                            'name' => '__pad2',
                                                            'offset' => '160',
                                                            'type' => '319'
                                                          },
                                                  '24' => {
                                                            'name' => '__pad3',
                                                            'offset' => '168',
                                                            'type' => '319'
                                                          },
                                                  '25' => {
                                                            'name' => '__pad4',
                                                            'offset' => '176',
                                                            'type' => '319'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '421'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '119'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '2105'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '370'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '370'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '370'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '370'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '370'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '370'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '370'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '15445' => {
                                       'BaseType' => '5758',
                                       'Name' => 'struct evbuffer const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '157837' => {
                                        'BaseType' => '127288',
                                        'Name' => 'struct event_config*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '158585' => {
                                        'BaseType' => '2162',
                                        'Name' => 'char const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '160' => {
                                     'BaseType' => '76',
                                     'Header' => 'types.h',
                                     'Line' => '44',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '162513' => {
                                        'BaseType' => '127393',
                                        'Name' => 'struct event_config const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182' => {
                                     'BaseType' => '64',
                                     'Header' => 'types.h',
                                     'Line' => '134',
                                     'Name' => '__uid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '185499' => {
                                        'BaseType' => '6807',
                                        'Name' => 'struct evthread_lock_callbacks const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '185667' => {
                                        'BaseType' => '6961',
                                        'Name' => 'struct evthread_condition_callbacks const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '191693' => {
                                        'BaseType' => '185667',
                                        'Name' => 'struct evthread_condition_callbacks const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '192009' => {
                                        'BaseType' => '185499',
                                        'Name' => 'struct evthread_lock_callbacks const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '194646' => {
                                        'BaseType' => '3729',
                                        'Name' => 'struct in_addr const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '1954' => {
                                      'Header' => '<built-in>',
                                      'Line' => '0',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'gp_offset',
                                                           'offset' => '0',
                                                           'type' => '64'
                                                         },
                                                  '1' => {
                                                           'name' => 'fp_offset',
                                                           'offset' => '4',
                                                           'type' => '64'
                                                         },
                                                  '2' => {
                                                           'name' => 'overflow_arg_area',
                                                           'offset' => '8',
                                                           'type' => '319'
                                                         },
                                                  '3' => {
                                                           'name' => 'reg_save_area',
                                                           'offset' => '16',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'struct __va_list_tag',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '195686' => {
                                        'Name' => 'void(*)(int, struct addrinfo*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '119'
                                                            },
                                                     '1' => {
                                                              'type' => '110970'
                                                            },
                                                     '2' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '2015' => {
                                      'BaseType' => '1',
                                      'Header' => 'libio.h',
                                      'Line' => '154',
                                      'Name' => '_IO_lock_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '2022' => {
                                      'Header' => 'libio.h',
                                      'Line' => '160',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_next',
                                                           'offset' => '0',
                                                           'type' => '2071'
                                                         },
                                                  '1' => {
                                                           'name' => '_sbuf',
                                                           'offset' => '8',
                                                           'type' => '2077'
                                                         },
                                                  '2' => {
                                                           'name' => '_pos',
                                                           'offset' => '16',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'struct _IO_marker',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '202528' => {
                                        'BaseType' => '3729',
                                        'Name' => 'struct in_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '202534' => {
                                        'BaseType' => '3855',
                                        'Name' => 'struct in6_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '202979' => {
                                        'BaseType' => '64',
                                        'Name' => 'unsigned int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '203576' => {
                                        'BaseType' => '194646',
                                        'Name' => 'struct in_addr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '203582' => {
                                        'BaseType' => '3880',
                                        'Name' => 'struct in6_addr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '205308' => {
                                        'BaseType' => '110970',
                                        'Name' => 'struct addrinfo**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2071' => {
                                      'BaseType' => '2022',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2077' => {
                                      'BaseType' => '1534',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2083' => {
                                      'BaseType' => '376',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '2099' => {
                                      'BaseType' => '2015',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2105' => {
                                      'BaseType' => '376',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '2162' => {
                                      'BaseType' => '383',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2168' => {
                                      'BaseType' => '2162',
                                      'Name' => 'char const*const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '222071' => {
                                        'Header' => 'struct_tm.h',
                                        'Line' => '7',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tm_sec',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_min',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '10' => {
                                                              'name' => 'tm_zone',
                                                              'offset' => '48',
                                                              'type' => '2162'
                                                            },
                                                    '2' => {
                                                             'name' => 'tm_hour',
                                                             'offset' => '8',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_mday',
                                                             'offset' => '12',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_mon',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_year',
                                                             'offset' => '20',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_wday',
                                                             'offset' => '24',
                                                             'type' => '119'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_yday',
                                                             'offset' => '28',
                                                             'type' => '119'
                                                           },
                                                    '8' => {
                                                             'name' => 'tm_isdst',
                                                             'offset' => '32',
                                                             'type' => '119'
                                                           },
                                                    '9' => {
                                                             'name' => 'tm_gmtoff',
                                                             'offset' => '40',
                                                             'type' => '153'
                                                           }
                                                  },
                                        'Name' => 'struct tm',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '222215' => {
                                        'BaseType' => '222071',
                                        'Name' => 'struct tm const',
                                        'Size' => '56',
                                        'Type' => 'Const'
                                      },
                          '224069' => {
                                        'BaseType' => '7125',
                                        'Name' => 'struct evutil_monotonic_timer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '224991' => {
                                        'BaseType' => '222215',
                                        'Name' => 'struct tm const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2277' => {
                                      'BaseType' => '2288',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2288' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '2301' => {
                                      'BaseType' => '370',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '232432' => {
                                        'Header' => 'socket.h',
                                        'Line' => '188',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ss_family',
                                                             'offset' => '0',
                                                             'type' => '679'
                                                           },
                                                    '1' => {
                                                             'name' => '__ss_padding',
                                                             'offset' => '2',
                                                             'type' => '232481'
                                                           },
                                                    '2' => {
                                                             'name' => '__ss_align',
                                                             'offset' => '120',
                                                             'type' => '76'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_storage',
                                        'PrivateABI' => 1,
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '232481' => {
                                        'BaseType' => '376',
                                        'Name' => 'char[118]',
                                        'Size' => '118',
                                        'Type' => 'Array'
                                      },
                          '234295' => {
                                        'BaseType' => '234306',
                                        'Header' => 'listener.h',
                                        'Line' => '51',
                                        'Name' => 'evconnlistener_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '234306' => {
                                        'Name' => 'void(*)(struct evconnlistener*, int, struct sockaddr*, int, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '234343'
                                                            },
                                                     '1' => {
                                                              'type' => '119'
                                                            },
                                                     '2' => {
                                                              'type' => '754'
                                                            },
                                                     '3' => {
                                                              'type' => '119'
                                                            },
                                                     '4' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '234343' => {
                                        'BaseType' => '234349',
                                        'Name' => 'struct evconnlistener*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '234349' => {
                                        'Line' => '79',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ops',
                                                             'offset' => '0',
                                                             'type' => '235489'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock',
                                                             'offset' => '8',
                                                             'type' => '319'
                                                           },
                                                    '2' => {
                                                             'name' => 'cb',
                                                             'offset' => '16',
                                                             'type' => '234295'
                                                           },
                                                    '3' => {
                                                             'name' => 'errorcb',
                                                             'offset' => '24',
                                                             'type' => '234472'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_data',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           },
                                                    '5' => {
                                                             'name' => 'flags',
                                                             'offset' => '40',
                                                             'type' => '64'
                                                           },
                                                    '6' => {
                                                             'name' => 'refcnt',
                                                             'offset' => '44',
                                                             'type' => '101'
                                                           },
                                                    '7' => {
                                                             'name' => 'accept4_flags',
                                                             'offset' => '48',
                                                             'type' => '119'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '1',
                                                             'name' => 'enabled',
                                                             'offset' => '52',
                                                             'type' => '64'
                                                           }
                                                  },
                                        'Name' => 'struct evconnlistener',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Source' => 'listener.c',
                                        'Type' => 'Struct'
                                      },
                          '234472' => {
                                        'BaseType' => '234483',
                                        'Header' => 'listener.h',
                                        'Line' => '59',
                                        'Name' => 'evconnlistener_errorcb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '234483' => {
                                        'Name' => 'void(*)(struct evconnlistener*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '234343'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '235340' => {
                                        'Line' => '70',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'enable',
                                                             'offset' => '0',
                                                             'type' => '235445'
                                                           },
                                                    '1' => {
                                                             'name' => 'disable',
                                                             'offset' => '8',
                                                             'type' => '235445'
                                                           },
                                                    '2' => {
                                                             'name' => 'destroy',
                                                             'offset' => '16',
                                                             'type' => '235462'
                                                           },
                                                    '3' => {
                                                             'name' => 'shutdown',
                                                             'offset' => '24',
                                                             'type' => '235462'
                                                           },
                                                    '4' => {
                                                             'name' => 'getfd',
                                                             'offset' => '32',
                                                             'type' => '235445'
                                                           },
                                                    '5' => {
                                                             'name' => 'getbase',
                                                             'offset' => '40',
                                                             'type' => '235483'
                                                           }
                                                  },
                                        'Name' => 'struct evconnlistener_ops',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Source' => 'listener.c',
                                        'Type' => 'Struct'
                                      },
                          '235425' => {
                                        'BaseType' => '235340',
                                        'Name' => 'struct evconnlistener_ops const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '235445' => {
                                        'Name' => 'int(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '234343'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '235462' => {
                                        'Name' => 'void(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '234343'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '235483' => {
                                        'Name' => 'struct event_base*(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '234343'
                                                            }
                                                   },
                                        'Return' => '6587',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '235489' => {
                                        'BaseType' => '235425',
                                        'Name' => 'struct evconnlistener_ops const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '237' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '140',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '240944' => {
                                        'BaseType' => '240956',
                                        'Header' => 'event.h',
                                        'Line' => '752',
                                        'Name' => 'event_log_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '240956' => {
                                        'Name' => 'void(*)(int, char const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '119'
                                                            },
                                                     '1' => {
                                                              'type' => '2162'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '240978' => {
                                        'BaseType' => '4157',
                                        'Header' => 'event.h',
                                        'Line' => '771',
                                        'Name' => 'event_fatal_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '248' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '141',
                                     'Name' => '__off64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '24943' => {
                                       'BaseType' => '421',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '259' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '142',
                                     'Name' => '__pid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '270' => {
                                     'BaseType' => '119',
                                     'Name' => 'int[2]',
                                     'Size' => '8',
                                     'Type' => 'Array'
                                   },
                          '286' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '144',
                                     'Name' => '__clock_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '292627' => {
                                        'BaseType' => '292638',
                                        'Header' => 'dns.h',
                                        'Line' => '249',
                                        'Name' => 'evdns_callback_type',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '292638' => {
                                        'Name' => 'void(*)(int, char, int, int, void*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '119'
                                                            },
                                                     '1' => {
                                                              'type' => '376'
                                                            },
                                                     '2' => {
                                                              'type' => '119'
                                                            },
                                                     '3' => {
                                                              'type' => '119'
                                                            },
                                                     '4' => {
                                                              'type' => '319'
                                                            },
                                                     '5' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '292680' => {
                                        'BaseType' => '240956',
                                        'Header' => 'dns.h',
                                        'Line' => '614',
                                        'Name' => 'evdns_debug_log_fn_type',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '292714' => {
                                        'BaseType' => '292726',
                                        'Header' => 'dns.h',
                                        'Line' => '645',
                                        'Name' => 'evdns_request_callback_fn_type',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '292726' => {
                                        'Name' => 'void(*)(struct evdns_server_request*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '292748'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '292748' => {
                                        'BaseType' => '292754',
                                        'Name' => 'struct evdns_server_request*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '292754' => {
                                        'Header' => 'dns_struct.h',
                                        'Line' => '56',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'flags',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'nquestions',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'questions',
                                                             'offset' => '8',
                                                             'type' => '292922'
                                                           }
                                                  },
                                        'Name' => 'struct evdns_server_request',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '292803' => {
                                        'Header' => 'dns.h',
                                        'Line' => '709',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVDNS_SOPT_TCP_MAX_CLIENTS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVDNS_SOPT_TCP_IDLE_TIMEOUT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum evdns_server_option',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '292834' => {
                                        'BaseType' => '195686',
                                        'Header' => 'dns.h',
                                        'Line' => '772',
                                        'Name' => 'evdns_getaddrinfo_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '292873' => {
                                        'Header' => 'dns_struct.h',
                                        'Line' => '61',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'class',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'name',
                                                             'offset' => '8',
                                                             'type' => '2083'
                                                           }
                                                  },
                                        'Name' => 'struct evdns_server_question',
                                        'Size' => '12',
                                        'Type' => 'Struct'
                                      },
                          '292922' => {
                                        'BaseType' => '292928',
                                        'Name' => 'struct evdns_server_question**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '292928' => {
                                        'BaseType' => '292873',
                                        'Name' => 'struct evdns_server_question*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '294614' => {
                                        'Line' => '177',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'a',
                                                             'offset' => '0',
                                                             'type' => '294665'
                                                           },
                                                    '1' => {
                                                             'name' => 'aaaa',
                                                             'offset' => '0',
                                                             'type' => '202534'
                                                           },
                                                    '2' => {
                                                             'name' => 'ptr_name',
                                                             'offset' => '0',
                                                             'type' => '370'
                                                           },
                                                    '3' => {
                                                             'name' => 'raw',
                                                             'offset' => '0',
                                                             'type' => '319'
                                                           }
                                                  },
                                        'Name' => 'anon-union-evdns.c-177',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Union'
                                      },
                          '294665' => {
                                        'BaseType' => '3689',
                                        'Name' => 'uint32_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '294677' => {
                                        'Line' => '173',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '64'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '1',
                                                             'name' => 'have_answer',
                                                             'offset' => '4',
                                                             'type' => '64'
                                                           },
                                                    '2' => {
                                                             'name' => 'rr_count',
                                                             'offset' => '8',
                                                             'type' => '3689'
                                                           },
                                                    '3' => {
                                                             'name' => 'data',
                                                             'offset' => '16',
                                                             'type' => '294614'
                                                           },
                                                    '4' => {
                                                             'name' => 'cname',
                                                             'offset' => '24',
                                                             'type' => '370'
                                                           }
                                                  },
                                        'Name' => 'struct reply',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '294753' => {
                                        'Line' => '191',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'current_req',
                                                             'offset' => '0',
                                                             'type' => '295183'
                                                           },
                                                    '1' => {
                                                             'name' => 'base',
                                                             'offset' => '8',
                                                             'type' => '112710'
                                                           },
                                                    '10' => {
                                                              'name' => 'reply',
                                                              'offset' => '96',
                                                              'type' => '294677'
                                                            },
                                                    '11' => {
                                                              'name' => 'search_index',
                                                              'offset' => '128',
                                                              'type' => '119'
                                                            },
                                                    '12' => {
                                                              'name' => 'search_state',
                                                              'offset' => '136',
                                                              'type' => '295265'
                                                            },
                                                    '13' => {
                                                              'name' => 'search_origname',
                                                              'offset' => '144',
                                                              'type' => '370'
                                                            },
                                                    '14' => {
                                                              'name' => 'search_flags',
                                                              'offset' => '152',
                                                              'type' => '119'
                                                            },
                                                    '15' => {
                                                              'name' => 'tcp_flags',
                                                              'offset' => '156',
                                                              'type' => '3678'
                                                            },
                                                    '2' => {
                                                             'name' => 'pending_cb',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'deferred',
                                                             'offset' => '24',
                                                             'type' => '6164'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_callback',
                                                             'offset' => '64',
                                                             'type' => '292627'
                                                           },
                                                    '5' => {
                                                             'name' => 'user_pointer',
                                                             'offset' => '72',
                                                             'type' => '319'
                                                           },
                                                    '6' => {
                                                             'name' => 'request_type',
                                                             'offset' => '80',
                                                             'type' => '3667'
                                                           },
                                                    '7' => {
                                                             'name' => 'have_reply',
                                                             'offset' => '81',
                                                             'type' => '3667'
                                                           },
                                                    '8' => {
                                                             'name' => 'ttl',
                                                             'offset' => '84',
                                                             'type' => '3689'
                                                           },
                                                    '9' => {
                                                             'name' => 'err',
                                                             'offset' => '88',
                                                             'type' => '3689'
                                                           }
                                                  },
                                        'Name' => 'struct evdns_request',
                                        'PrivateABI' => 1,
                                        'Size' => '160',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '294958' => {
                                        'Line' => '216',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'request',
                                                             'offset' => '0',
                                                             'type' => '295276'
                                                           },
                                                    '1' => {
                                                             'name' => 'request_size',
                                                             'offset' => '8',
                                                             'type' => '3678'
                                                           },
                                                    '10' => {
                                                              'name' => 'trans_id',
                                                              'offset' => '168',
                                                              'type' => '3678'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '1',
                                                              'name' => 'request_appended',
                                                              'offset' => '168',
                                                              'type' => '64'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '1',
                                                              'name' => 'transmit_me',
                                                              'offset' => '168',
                                                              'type' => '64'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'need_cname',
                                                              'offset' => '168',
                                                              'type' => '64'
                                                            },
                                                    '14' => {
                                                              'name' => 'put_cname_in_ptr',
                                                              'offset' => '176',
                                                              'type' => '2301'
                                                            },
                                                    '15' => {
                                                              'name' => 'base',
                                                              'offset' => '184',
                                                              'type' => '112710'
                                                            },
                                                    '16' => {
                                                              'name' => 'handle',
                                                              'offset' => '192',
                                                              'type' => '295535'
                                                            },
                                                    '2' => {
                                                             'name' => 'request_type',
                                                             'offset' => '10',
                                                             'type' => '3667'
                                                           },
                                                    '3' => {
                                                             'name' => 'request_len',
                                                             'offset' => '12',
                                                             'type' => '64'
                                                           },
                                                    '4' => {
                                                             'name' => 'reissue_count',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'tx_count',
                                                             'offset' => '20',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'ns',
                                                             'offset' => '24',
                                                             'type' => '295524'
                                                           },
                                                    '7' => {
                                                             'name' => 'next',
                                                             'offset' => '32',
                                                             'type' => '295183'
                                                           },
                                                    '8' => {
                                                             'name' => 'prev',
                                                             'offset' => '40',
                                                             'type' => '295183'
                                                           },
                                                    '9' => {
                                                             'name' => 'timeout_event',
                                                             'offset' => '48',
                                                             'type' => '4229'
                                                           }
                                                  },
                                        'Name' => 'struct request',
                                        'PrivateABI' => 1,
                                        'Size' => '200',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295183' => {
                                        'BaseType' => '294958',
                                        'Name' => 'struct request*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295194' => {
                                        'Line' => '3852',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'refcount',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'ndots',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'num_domains',
                                                             'offset' => '8',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'head',
                                                             'offset' => '16',
                                                             'type' => '296734'
                                                           }
                                                  },
                                        'Name' => 'struct search_state',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295265' => {
                                        'BaseType' => '295194',
                                        'Name' => 'struct search_state*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295276' => {
                                        'BaseType' => '3667',
                                        'Name' => 'uint8_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295287' => {
                                        'Line' => '264',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'socket',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'connection',
                                                             'offset' => '8',
                                                             'type' => '295947'
                                                           },
                                                    '10' => {
                                                              'name' => 'probe_request',
                                                              'offset' => '416',
                                                              'type' => '295535'
                                                            },
                                                    '11' => {
                                                              'name' => 'state',
                                                              'offset' => '424',
                                                              'type' => '376'
                                                            },
                                                    '12' => {
                                                              'name' => 'choked',
                                                              'offset' => '425',
                                                              'type' => '376'
                                                            },
                                                    '13' => {
                                                              'name' => 'write_waiting',
                                                              'offset' => '426',
                                                              'type' => '376'
                                                            },
                                                    '14' => {
                                                              'name' => 'base',
                                                              'offset' => '432',
                                                              'type' => '112710'
                                                            },
                                                    '15' => {
                                                              'name' => 'requests_inflight',
                                                              'offset' => '440',
                                                              'type' => '119'
                                                            },
                                                    '2' => {
                                                             'name' => 'address',
                                                             'offset' => '16',
                                                             'type' => '232432'
                                                           },
                                                    '3' => {
                                                             'name' => 'addrlen',
                                                             'offset' => '144',
                                                             'type' => '109656'
                                                           },
                                                    '4' => {
                                                             'name' => 'failed_times',
                                                             'offset' => '148',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'timedout',
                                                             'offset' => '152',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'event',
                                                             'offset' => '160',
                                                             'type' => '4229'
                                                           },
                                                    '7' => {
                                                             'name' => 'next',
                                                             'offset' => '280',
                                                             'type' => '295524'
                                                           },
                                                    '8' => {
                                                             'name' => 'prev',
                                                             'offset' => '288',
                                                             'type' => '295524'
                                                           },
                                                    '9' => {
                                                             'name' => 'timeout_event',
                                                             'offset' => '296',
                                                             'type' => '4229'
                                                           }
                                                  },
                                        'Name' => 'struct nameserver',
                                        'PrivateABI' => 1,
                                        'Size' => '448',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295524' => {
                                        'BaseType' => '295287',
                                        'Name' => 'struct nameserver*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295535' => {
                                        'BaseType' => '294753',
                                        'Name' => 'struct evdns_request*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295546' => {
                                        'Line' => '244',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'TS_DISCONNECTED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'TS_CONNECTING',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'TS_CONNECTED',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum tcp_state',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Enum'
                                      },
                          '295582' => {
                                        'Line' => '250',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bev',
                                                             'offset' => '0',
                                                             'type' => '5845'
                                                           },
                                                    '1' => {
                                                             'name' => 'state',
                                                             'offset' => '8',
                                                             'type' => '295546'
                                                           },
                                                    '2' => {
                                                             'name' => 'awaiting_packet_size',
                                                             'offset' => '12',
                                                             'type' => '3678'
                                                           }
                                                  },
                                        'Name' => 'struct tcp_connection',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295631' => {
                                        'Line' => '259',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'le_next',
                                                             'offset' => '0',
                                                             'type' => '295720'
                                                           },
                                                    '1' => {
                                                             'name' => 'le_prev',
                                                             'offset' => '8',
                                                             'type' => '295726'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-evdns.c-259',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295667' => {
                                        'Line' => '258',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '295631'
                                                           },
                                                    '1' => {
                                                             'name' => 'connection',
                                                             'offset' => '16',
                                                             'type' => '295582'
                                                           },
                                                    '2' => {
                                                             'name' => 'port',
                                                             'offset' => '32',
                                                             'type' => '295941'
                                                           }
                                                  },
                                        'Name' => 'struct client_tcp_connection',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295720' => {
                                        'BaseType' => '295667',
                                        'Name' => 'struct client_tcp_connection*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295726' => {
                                        'BaseType' => '295720',
                                        'Name' => 'struct client_tcp_connection**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295732' => {
                                        'Line' => '291',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'socket',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'refcnt',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '10' => {
                                                              'name' => 'client_connections',
                                                              'offset' => '176',
                                                              'type' => '295953'
                                                            },
                                                    '11' => {
                                                              'name' => 'client_connections_count',
                                                              'offset' => '184',
                                                              'type' => '64'
                                                            },
                                                    '12' => {
                                                              'name' => 'max_client_connections',
                                                              'offset' => '188',
                                                              'type' => '64'
                                                            },
                                                    '13' => {
                                                              'name' => 'tcp_idle_timeout',
                                                              'offset' => '192',
                                                              'type' => '501'
                                                            },
                                                    '14' => {
                                                              'name' => 'lock',
                                                              'offset' => '208',
                                                              'type' => '319'
                                                            },
                                                    '2' => {
                                                             'name' => 'choked',
                                                             'offset' => '8',
                                                             'type' => '376'
                                                           },
                                                    '3' => {
                                                             'name' => 'closing',
                                                             'offset' => '9',
                                                             'type' => '376'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_callback',
                                                             'offset' => '16',
                                                             'type' => '292714'
                                                           },
                                                    '5' => {
                                                             'name' => 'user_data',
                                                             'offset' => '24',
                                                             'type' => '319'
                                                           },
                                                    '6' => {
                                                             'name' => 'event',
                                                             'offset' => '32',
                                                             'type' => '4229'
                                                           },
                                                    '7' => {
                                                             'name' => 'pending_replies',
                                                             'offset' => '152',
                                                             'type' => '296215'
                                                           },
                                                    '8' => {
                                                             'name' => 'event_base',
                                                             'offset' => '160',
                                                             'type' => '6587'
                                                           },
                                                    '9' => {
                                                             'name' => 'listener',
                                                             'offset' => '168',
                                                             'type' => '234343'
                                                           }
                                                  },
                                        'Name' => 'struct evdns_server_port',
                                        'PrivateABI' => 1,
                                        'Size' => '216',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295941' => {
                                        'BaseType' => '295732',
                                        'Name' => 'struct evdns_server_port*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295947' => {
                                        'BaseType' => '295582',
                                        'Name' => 'struct tcp_connection*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '295953' => {
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'lh_first',
                                                             'offset' => '0',
                                                             'type' => '295720'
                                                           }
                                                  },
                                        'Name' => 'struct client_list',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '295980' => {
                                        'Line' => '329',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next_pending',
                                                             'offset' => '0',
                                                             'type' => '296215'
                                                           },
                                                    '1' => {
                                                             'name' => 'prev_pending',
                                                             'offset' => '8',
                                                             'type' => '296215'
                                                           },
                                                    '10' => {
                                                              'name' => 'n_additional',
                                                              'offset' => '184',
                                                              'type' => '119'
                                                            },
                                                    '11' => {
                                                              'name' => 'answer',
                                                              'offset' => '192',
                                                              'type' => '296339'
                                                            },
                                                    '12' => {
                                                              'name' => 'authority',
                                                              'offset' => '200',
                                                              'type' => '296339'
                                                            },
                                                    '13' => {
                                                              'name' => 'additional',
                                                              'offset' => '208',
                                                              'type' => '296339'
                                                            },
                                                    '14' => {
                                                              'name' => 'response',
                                                              'offset' => '216',
                                                              'type' => '370'
                                                            },
                                                    '15' => {
                                                              'name' => 'response_len',
                                                              'offset' => '224',
                                                              'type' => '421'
                                                            },
                                                    '16' => {
                                                              'name' => 'base',
                                                              'offset' => '232',
                                                              'type' => '292754'
                                                            },
                                                    '2' => {
                                                             'name' => 'trans_id',
                                                             'offset' => '16',
                                                             'type' => '3678'
                                                           },
                                                    '3' => {
                                                             'name' => 'port',
                                                             'offset' => '24',
                                                             'type' => '295941'
                                                           },
                                                    '4' => {
                                                             'name' => 'client',
                                                             'offset' => '32',
                                                             'type' => '295720'
                                                           },
                                                    '5' => {
                                                             'name' => 'addr',
                                                             'offset' => '40',
                                                             'type' => '232432'
                                                           },
                                                    '6' => {
                                                             'name' => 'addrlen',
                                                             'offset' => '168',
                                                             'type' => '109656'
                                                           },
                                                    '7' => {
                                                             'name' => 'max_udp_reply_size',
                                                             'offset' => '172',
                                                             'type' => '3678'
                                                           },
                                                    '8' => {
                                                             'name' => 'n_answer',
                                                             'offset' => '176',
                                                             'type' => '119'
                                                           },
                                                    '9' => {
                                                             'name' => 'n_authority',
                                                             'offset' => '180',
                                                             'type' => '119'
                                                           }
                                                  },
                                        'Name' => 'struct server_request',
                                        'PrivateABI' => 1,
                                        'Size' => '248',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296215' => {
                                        'BaseType' => '295980',
                                        'Name' => 'struct server_request*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296221' => {
                                        'Line' => '316',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '296339'
                                                           },
                                                    '1' => {
                                                             'name' => 'name',
                                                             'offset' => '8',
                                                             'type' => '370'
                                                           },
                                                    '2' => {
                                                             'name' => 'type',
                                                             'offset' => '16',
                                                             'type' => '3678'
                                                           },
                                                    '3' => {
                                                             'name' => 'class',
                                                             'offset' => '18',
                                                             'type' => '3678'
                                                           },
                                                    '4' => {
                                                             'name' => 'ttl',
                                                             'offset' => '20',
                                                             'type' => '3689'
                                                           },
                                                    '5' => {
                                                             'name' => 'is_name',
                                                             'offset' => '24',
                                                             'type' => '376'
                                                           },
                                                    '6' => {
                                                             'name' => 'datalen',
                                                             'offset' => '26',
                                                             'type' => '3678'
                                                           },
                                                    '7' => {
                                                             'name' => 'data',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           }
                                                  },
                                        'Name' => 'struct server_reply_item',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296339' => {
                                        'BaseType' => '296221',
                                        'Name' => 'struct server_reply_item*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296345' => {
                                        'Line' => '423',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '296451'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '296457'
                                                           }
                                                  },
                                        'Name' => 'struct hosts_list',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296385' => {
                                        'Line' => '439',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '296469'
                                                           },
                                                    '1' => {
                                                             'name' => 'addr',
                                                             'offset' => '16',
                                                             'type' => '296505'
                                                           },
                                                    '2' => {
                                                             'name' => 'addrlen',
                                                             'offset' => '44',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'hostname',
                                                             'offset' => '48',
                                                             'type' => '2083'
                                                           }
                                                  },
                                        'Name' => 'struct hosts_entry',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296451' => {
                                        'BaseType' => '296385',
                                        'Name' => 'struct hosts_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296457' => {
                                        'BaseType' => '296451',
                                        'Name' => 'struct hosts_entry**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296463' => {
                                        'BaseType' => '295183',
                                        'Name' => 'struct request**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296469' => {
                                        'Line' => '440',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '296451'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '296457'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-evdns.c-440',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296505' => {
                                        'Line' => '441',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'sa',
                                                             'offset' => '0',
                                                             'type' => '690'
                                                           },
                                                    '1' => {
                                                             'name' => 'sin',
                                                             'offset' => '0',
                                                             'type' => '849'
                                                           },
                                                    '2' => {
                                                             'name' => 'sin6',
                                                             'offset' => '0',
                                                             'type' => '926'
                                                           }
                                                  },
                                        'Name' => 'anon-union-evdns.c-441',
                                        'PrivateABI' => 1,
                                        'Size' => '28',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Union'
                                      },
                          '296694' => {
                                        'Line' => '3846',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'len',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'next',
                                                             'offset' => '8',
                                                             'type' => '296734'
                                                           }
                                                  },
                                        'Name' => 'struct search_domain',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '296734' => {
                                        'BaseType' => '296694',
                                        'Name' => 'struct search_domain*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296740' => {
                                        'Line' => '5156',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'r',
                                                             'offset' => '0',
                                                             'type' => '295535'
                                                           },
                                                    '1' => {
                                                             'name' => 'type',
                                                             'offset' => '8',
                                                             'type' => '3689'
                                                           }
                                                  },
                                        'Name' => 'struct getaddrinfo_subrequest',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'evdns.c',
                                        'Type' => 'Struct'
                                      },
                          '297' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '148',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '308' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '150',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '319' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '348' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3667' => {
                                      'BaseType' => '90',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '367162' => {
                                        'Header' => 'keyvalq_struct.h',
                                        'Line' => '59',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '367244'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '367250'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-keyvalq_struct.h-59',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '367195' => {
                                        'Header' => 'keyvalq_struct.h',
                                        'Line' => '58',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '367162'
                                                           },
                                                    '1' => {
                                                             'name' => 'key',
                                                             'offset' => '16',
                                                             'type' => '370'
                                                           },
                                                    '2' => {
                                                             'name' => 'value',
                                                             'offset' => '24',
                                                             'type' => '370'
                                                           }
                                                  },
                                        'Name' => 'struct evkeyval',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '367244' => {
                                        'BaseType' => '367195',
                                        'Name' => 'struct evkeyval*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '367250' => {
                                        'BaseType' => '367244',
                                        'Name' => 'struct evkeyval**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '367256' => {
                                        'Header' => 'keyvalq_struct.h',
                                        'Line' => '65',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '367244'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '367250'
                                                           }
                                                  },
                                        'Name' => 'struct evkeyvalq',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '367755' => {
                                        'Header' => 'rpc.h',
                                        'Line' => '472',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVRPC_INPUT',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVRPC_OUTPUT',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum EVRPC_HOOK_TYPE',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '367786' => {
                                        'Header' => 'rpc.h',
                                        'Line' => '490',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVRPC_TERMINATE',
                                                             'value' => '-1'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVRPC_CONTINUE',
                                                             'value' => '0'
                                                           },
                                                    '2' => {
                                                             'name' => 'EVRPC_PAUSE',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum EVRPC_HOOK_RESULT',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '3678' => {
                                      'BaseType' => '108',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '367823' => {
                                        'Header' => 'rpc_struct.h',
                                        'Line' => '54',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'error',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'http_req',
                                                             'offset' => '8',
                                                             'type' => '368238'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_status',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '367860' => {
                                        'Header' => 'http_struct.h',
                                        'Line' => '57',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '371652'
                                                           },
                                                    '1' => {
                                                             'name' => 'evcon',
                                                             'offset' => '16',
                                                             'type' => '369617'
                                                           },
                                                    '10' => {
                                                              'name' => 'headers_size',
                                                              'offset' => '80',
                                                              'type' => '421'
                                                            },
                                                    '11' => {
                                                              'name' => 'body_size',
                                                              'offset' => '88',
                                                              'type' => '421'
                                                            },
                                                    '12' => {
                                                              'name' => 'uri',
                                                              'offset' => '96',
                                                              'type' => '370'
                                                            },
                                                    '13' => {
                                                              'name' => 'uri_elems',
                                                              'offset' => '104',
                                                              'type' => '371696'
                                                            },
                                                    '14' => {
                                                              'name' => 'major',
                                                              'offset' => '112',
                                                              'type' => '376'
                                                            },
                                                    '15' => {
                                                              'name' => 'minor',
                                                              'offset' => '113',
                                                              'type' => '376'
                                                            },
                                                    '16' => {
                                                              'name' => 'response_code',
                                                              'offset' => '116',
                                                              'type' => '119'
                                                            },
                                                    '17' => {
                                                              'name' => 'response_code_line',
                                                              'offset' => '120',
                                                              'type' => '370'
                                                            },
                                                    '18' => {
                                                              'name' => 'input_buffer',
                                                              'offset' => '128',
                                                              'type' => '5511'
                                                            },
                                                    '19' => {
                                                              'name' => 'ntoread',
                                                              'offset' => '136',
                                                              'type' => '437'
                                                            },
                                                    '2' => {
                                                             'name' => 'flags',
                                                             'offset' => '24',
                                                             'type' => '119'
                                                           },
                                                    '20' => {
                                                              'bitfield' => '1',
                                                              'name' => 'chunked',
                                                              'offset' => '144',
                                                              'type' => '64'
                                                            },
                                                    '21' => {
                                                              'bitfield' => '1',
                                                              'name' => 'userdone',
                                                              'offset' => '144',
                                                              'type' => '64'
                                                            },
                                                    '22' => {
                                                              'name' => 'output_buffer',
                                                              'offset' => '152',
                                                              'type' => '5511'
                                                            },
                                                    '23' => {
                                                              'name' => 'cb',
                                                              'offset' => '160',
                                                              'type' => '370173'
                                                            },
                                                    '24' => {
                                                              'name' => 'cb_arg',
                                                              'offset' => '168',
                                                              'type' => '319'
                                                            },
                                                    '25' => {
                                                              'name' => 'chunk_cb',
                                                              'offset' => '176',
                                                              'type' => '370173'
                                                            },
                                                    '26' => {
                                                              'name' => 'header_cb',
                                                              'offset' => '184',
                                                              'type' => '370635'
                                                            },
                                                    '27' => {
                                                              'name' => 'error_cb',
                                                              'offset' => '192',
                                                              'type' => '371718'
                                                            },
                                                    '28' => {
                                                              'name' => 'on_complete_cb',
                                                              'offset' => '200',
                                                              'type' => '370173'
                                                            },
                                                    '29' => {
                                                              'name' => 'on_complete_cb_arg',
                                                              'offset' => '208',
                                                              'type' => '319'
                                                            },
                                                    '3' => {
                                                             'name' => 'input_headers',
                                                             'offset' => '32',
                                                             'type' => '371685'
                                                           },
                                                    '4' => {
                                                             'name' => 'output_headers',
                                                             'offset' => '40',
                                                             'type' => '371685'
                                                           },
                                                    '5' => {
                                                             'name' => 'remote_host',
                                                             'offset' => '48',
                                                             'type' => '370'
                                                           },
                                                    '6' => {
                                                             'name' => 'remote_port',
                                                             'offset' => '56',
                                                             'type' => '3678'
                                                           },
                                                    '7' => {
                                                             'name' => 'host_cache',
                                                             'offset' => '64',
                                                             'type' => '370'
                                                           },
                                                    '8' => {
                                                             'name' => 'kind',
                                                             'offset' => '72',
                                                             'type' => '369034'
                                                           },
                                                    '9' => {
                                                             'name' => 'type',
                                                             'offset' => '76',
                                                             'type' => '368911'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_request',
                                        'Size' => '216',
                                        'Type' => 'Struct'
                                      },
                          '368238' => {
                                        'BaseType' => '367860',
                                        'Name' => 'struct evhttp_request*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368244' => {
                                        'Header' => 'rpc_struct.h',
                                        'Line' => '70',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '368457'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '368463'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-rpc_struct.h-70',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '368277' => {
                                        'Header' => 'rpc_struct.h',
                                        'Line' => '69',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '368244'
                                                           },
                                                    '1' => {
                                                             'name' => 'uri',
                                                             'offset' => '16',
                                                             'type' => '2162'
                                                           },
                                                    '10' => {
                                                              'name' => 'reply_marshal',
                                                              'offset' => '88',
                                                              'type' => '368566'
                                                            },
                                                    '11' => {
                                                              'name' => 'cb',
                                                              'offset' => '96',
                                                              'type' => '368679'
                                                            },
                                                    '12' => {
                                                              'name' => 'cb_arg',
                                                              'offset' => '104',
                                                              'type' => '319'
                                                            },
                                                    '13' => {
                                                              'name' => 'base',
                                                              'offset' => '112',
                                                              'type' => '368734'
                                                            },
                                                    '2' => {
                                                             'name' => 'request_new',
                                                             'offset' => '24',
                                                             'type' => '368484'
                                                           },
                                                    '3' => {
                                                             'name' => 'request_new_arg',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           },
                                                    '4' => {
                                                             'name' => 'request_free',
                                                             'offset' => '40',
                                                             'type' => '7045'
                                                           },
                                                    '5' => {
                                                             'name' => 'request_unmarshal',
                                                             'offset' => '48',
                                                             'type' => '368538'
                                                           },
                                                    '6' => {
                                                             'name' => 'reply_new',
                                                             'offset' => '56',
                                                             'type' => '368484'
                                                           },
                                                    '7' => {
                                                             'name' => 'reply_new_arg',
                                                             'offset' => '64',
                                                             'type' => '319'
                                                           },
                                                    '8' => {
                                                             'name' => 'reply_free',
                                                             'offset' => '72',
                                                             'type' => '7045'
                                                           },
                                                    '9' => {
                                                             'name' => 'reply_complete',
                                                             'offset' => '80',
                                                             'type' => '368544'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc',
                                        'Size' => '120',
                                        'Type' => 'Struct'
                                      },
                          '368457' => {
                                        'BaseType' => '368277',
                                        'Name' => 'struct evrpc*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368463' => {
                                        'BaseType' => '368457',
                                        'Name' => 'struct evrpc**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368484' => {
                                        'Name' => 'void*(*)(void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '319',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368538' => {
                                        'Name' => 'int(*)(void*, struct evbuffer*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            },
                                                     '1' => {
                                                              'type' => '5511'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368544' => {
                                        'Name' => 'int(*)(void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368566' => {
                                        'Name' => 'void(*)(struct evbuffer*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '5511'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368588' => {
                                        'BaseType' => '368594',
                                        'Name' => 'struct evrpc_req_generic*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368594' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '133',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hook_meta',
                                                             'offset' => '0',
                                                             'type' => '371569'
                                                           },
                                                    '1' => {
                                                             'name' => 'request',
                                                             'offset' => '8',
                                                             'type' => '319'
                                                           },
                                                    '2' => {
                                                             'name' => 'reply',
                                                             'offset' => '16',
                                                             'type' => '319'
                                                           },
                                                    '3' => {
                                                             'name' => 'rpc',
                                                             'offset' => '24',
                                                             'type' => '368457'
                                                           },
                                                    '4' => {
                                                             'name' => 'http_req',
                                                             'offset' => '32',
                                                             'type' => '368238'
                                                           },
                                                    '5' => {
                                                             'name' => 'rpc_data',
                                                             'offset' => '40',
                                                             'type' => '5511'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_req_generic',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '368679' => {
                                        'Name' => 'void(*)(struct evrpc_req_generic*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '368588'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368685' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '72',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'common',
                                                             'offset' => '0',
                                                             'type' => '370946'
                                                           },
                                                    '1' => {
                                                             'name' => 'http_server',
                                                             'offset' => '48',
                                                             'type' => '370024'
                                                           },
                                                    '2' => {
                                                             'name' => 'registered_rpcs',
                                                             'offset' => '56',
                                                             'type' => '370995'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_base',
                                        'PrivateABI' => 1,
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '368734' => {
                                        'BaseType' => '368685',
                                        'Name' => 'struct evrpc_base*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368740' => {
                                        'BaseType' => '368746',
                                        'Name' => 'struct evhttp_bound_socket*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368746' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '370270'
                                                           },
                                                    '1' => {
                                                             'name' => 'http',
                                                             'offset' => '16',
                                                             'type' => '370024'
                                                           },
                                                    '2' => {
                                                             'name' => 'bevcb',
                                                             'offset' => '24',
                                                             'type' => '370329'
                                                           },
                                                    '3' => {
                                                             'name' => 'bevcbarg',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           },
                                                    '4' => {
                                                             'name' => 'listener',
                                                             'offset' => '40',
                                                             'type' => '234343'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_bound_socket',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '368819' => {
                                        'BaseType' => '368831',
                                        'Header' => 'http.h',
                                        'Line' => '289',
                                        'Name' => 'evhttp_ext_method_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '368831' => {
                                        'Name' => 'int(*)(struct evhttp_ext_method*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '368852'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '368852' => {
                                        'BaseType' => '368858',
                                        'Name' => 'struct evhttp_ext_method*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '368858' => {
                                        'Header' => 'http.h',
                                        'Line' => '651',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'method',
                                                             'offset' => '0',
                                                             'type' => '2162'
                                                           },
                                                    '1' => {
                                                             'name' => 'type',
                                                             'offset' => '8',
                                                             'type' => '3689'
                                                           },
                                                    '2' => {
                                                             'name' => 'flags',
                                                             'offset' => '12',
                                                             'type' => '3678'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_ext_method',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '3689' => {
                                      'BaseType' => '131',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '368911' => {
                                        'Header' => 'http.h',
                                        'Line' => '623',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVHTTP_REQ_GET',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVHTTP_REQ_POST',
                                                             'value' => '2'
                                                           },
                                                    '10' => {
                                                              'name' => 'EVHTTP_REQ_PROPPATCH',
                                                              'value' => '1024'
                                                            },
                                                    '11' => {
                                                              'name' => 'EVHTTP_REQ_MKCOL',
                                                              'value' => '2048'
                                                            },
                                                    '12' => {
                                                              'name' => 'EVHTTP_REQ_LOCK',
                                                              'value' => '4096'
                                                            },
                                                    '13' => {
                                                              'name' => 'EVHTTP_REQ_UNLOCK',
                                                              'value' => '8192'
                                                            },
                                                    '14' => {
                                                              'name' => 'EVHTTP_REQ_COPY',
                                                              'value' => '16384'
                                                            },
                                                    '15' => {
                                                              'name' => 'EVHTTP_REQ_MOVE',
                                                              'value' => '32768'
                                                            },
                                                    '2' => {
                                                             'name' => 'EVHTTP_REQ_HEAD',
                                                             'value' => '4'
                                                           },
                                                    '3' => {
                                                             'name' => 'EVHTTP_REQ_PUT',
                                                             'value' => '8'
                                                           },
                                                    '4' => {
                                                             'name' => 'EVHTTP_REQ_DELETE',
                                                             'value' => '16'
                                                           },
                                                    '5' => {
                                                             'name' => 'EVHTTP_REQ_OPTIONS',
                                                             'value' => '32'
                                                           },
                                                    '6' => {
                                                             'name' => 'EVHTTP_REQ_TRACE',
                                                             'value' => '64'
                                                           },
                                                    '7' => {
                                                             'name' => 'EVHTTP_REQ_CONNECT',
                                                             'value' => '128'
                                                           },
                                                    '8' => {
                                                             'name' => 'EVHTTP_REQ_PATCH',
                                                             'value' => '256'
                                                           },
                                                    '9' => {
                                                             'name' => 'EVHTTP_REQ_PROPFIND',
                                                             'value' => '512'
                                                           }
                                                  },
                                        'Name' => 'enum evhttp_cmd_type',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '369034' => {
                                        'Header' => 'http.h',
                                        'Line' => '660',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVHTTP_REQUEST',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVHTTP_RESPONSE',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum evhttp_request_kind',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '369065' => {
                                        'Header' => 'http.h',
                                        'Line' => '749',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVREQ_HTTP_TIMEOUT',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVREQ_HTTP_EOF',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'EVREQ_HTTP_INVALID_HEADER',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'EVREQ_HTTP_BUFFER_ERROR',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'EVREQ_HTTP_REQUEST_CANCEL',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'EVREQ_HTTP_DATA_TOO_LONG',
                                                             'value' => '5'
                                                           }
                                                  },
                                        'Name' => 'enum evhttp_request_error',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '369142' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '34',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'EVCON_DISCONNECTED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'EVCON_CONNECTING',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'EVCON_IDLE',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'EVCON_READING_FIRSTLINE',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'EVCON_READING_HEADERS',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'EVCON_READING_BODY',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'EVCON_READING_TRAILER',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'EVCON_WRITING',
                                                             'value' => '7'
                                                           }
                                                  },
                                        'Name' => 'enum evhttp_connection_state',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '369208' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '52',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '369617'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '369623'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-http-internal.h-52',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '369241' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '369208'
                                                           },
                                                    '1' => {
                                                             'name' => 'bufev',
                                                             'offset' => '16',
                                                             'type' => '5845'
                                                           },
                                                    '10' => {
                                                              'name' => 'flags',
                                                              'offset' => '200',
                                                              'type' => '119'
                                                            },
                                                    '11' => {
                                                              'name' => 'timeout_connect',
                                                              'offset' => '208',
                                                              'type' => '501'
                                                            },
                                                    '12' => {
                                                              'name' => 'timeout_read',
                                                              'offset' => '224',
                                                              'type' => '501'
                                                            },
                                                    '13' => {
                                                              'name' => 'timeout_write',
                                                              'offset' => '240',
                                                              'type' => '501'
                                                            },
                                                    '14' => {
                                                              'name' => 'retry_cnt',
                                                              'offset' => '256',
                                                              'type' => '119'
                                                            },
                                                    '15' => {
                                                              'name' => 'retry_max',
                                                              'offset' => '260',
                                                              'type' => '119'
                                                            },
                                                    '16' => {
                                                              'name' => 'initial_retry_timeout',
                                                              'offset' => '264',
                                                              'type' => '501'
                                                            },
                                                    '17' => {
                                                              'name' => 'state',
                                                              'offset' => '280',
                                                              'type' => '369142'
                                                            },
                                                    '18' => {
                                                              'name' => 'http_server',
                                                              'offset' => '288',
                                                              'type' => '370024'
                                                            },
                                                    '19' => {
                                                              'name' => 'requests',
                                                              'offset' => '296',
                                                              'type' => '369629'
                                                            },
                                                    '2' => {
                                                             'name' => 'retry_ev',
                                                             'offset' => '24',
                                                             'type' => '4229'
                                                           },
                                                    '20' => {
                                                              'name' => 'cb',
                                                              'offset' => '312',
                                                              'type' => '370046'
                                                            },
                                                    '21' => {
                                                              'name' => 'cb_arg',
                                                              'offset' => '320',
                                                              'type' => '319'
                                                            },
                                                    '22' => {
                                                              'name' => 'closecb',
                                                              'offset' => '328',
                                                              'type' => '370046'
                                                            },
                                                    '23' => {
                                                              'name' => 'closecb_arg',
                                                              'offset' => '336',
                                                              'type' => '319'
                                                            },
                                                    '24' => {
                                                              'name' => 'read_more_deferred_cb',
                                                              'offset' => '344',
                                                              'type' => '6164'
                                                            },
                                                    '25' => {
                                                              'name' => 'base',
                                                              'offset' => '384',
                                                              'type' => '6587'
                                                            },
                                                    '26' => {
                                                              'name' => 'dns_base',
                                                              'offset' => '392',
                                                              'type' => '112710'
                                                            },
                                                    '27' => {
                                                              'name' => 'ai_family',
                                                              'offset' => '400',
                                                              'type' => '119'
                                                            },
                                                    '28' => {
                                                              'name' => 'ext_method_cmp',
                                                              'offset' => '408',
                                                              'type' => '368819'
                                                            },
                                                    '3' => {
                                                             'name' => 'bind_address',
                                                             'offset' => '144',
                                                             'type' => '370'
                                                           },
                                                    '4' => {
                                                             'name' => 'bind_port',
                                                             'offset' => '152',
                                                             'type' => '3678'
                                                           },
                                                    '5' => {
                                                             'name' => 'address',
                                                             'offset' => '160',
                                                             'type' => '370'
                                                           },
                                                    '6' => {
                                                             'name' => 'port',
                                                             'offset' => '168',
                                                             'type' => '3678'
                                                           },
                                                    '7' => {
                                                             'name' => 'unixsocket',
                                                             'offset' => '176',
                                                             'type' => '370'
                                                           },
                                                    '8' => {
                                                             'name' => 'max_headers_size',
                                                             'offset' => '184',
                                                             'type' => '421'
                                                           },
                                                    '9' => {
                                                             'name' => 'max_body_size',
                                                             'offset' => '192',
                                                             'type' => '3700'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_connection',
                                        'PrivateABI' => 1,
                                        'Size' => '416',
                                        'Type' => 'Struct'
                                      },
                          '369617' => {
                                        'BaseType' => '369241',
                                        'Name' => 'struct evhttp_connection*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '369623' => {
                                        'BaseType' => '369617',
                                        'Name' => 'struct evhttp_connection**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '369629' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '368238'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '369666'
                                                           }
                                                  },
                                        'Name' => 'struct evcon_requestq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '369666' => {
                                        'BaseType' => '368238',
                                        'Name' => 'struct evhttp_request**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '369683' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '148',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next_vhost',
                                                             'offset' => '0',
                                                             'type' => '370428'
                                                           },
                                                    '1' => {
                                                             'name' => 'sockets',
                                                             'offset' => '16',
                                                             'type' => '370467'
                                                           },
                                                    '10' => {
                                                              'name' => 'timeout_read',
                                                              'offset' => '128',
                                                              'type' => '501'
                                                            },
                                                    '11' => {
                                                              'name' => 'timeout_write',
                                                              'offset' => '144',
                                                              'type' => '501'
                                                            },
                                                    '12' => {
                                                              'name' => 'default_max_headers_size',
                                                              'offset' => '160',
                                                              'type' => '421'
                                                            },
                                                    '13' => {
                                                              'name' => 'default_max_body_size',
                                                              'offset' => '168',
                                                              'type' => '3700'
                                                            },
                                                    '14' => {
                                                              'name' => 'flags',
                                                              'offset' => '176',
                                                              'type' => '119'
                                                            },
                                                    '15' => {
                                                              'name' => 'default_content_type',
                                                              'offset' => '184',
                                                              'type' => '2162'
                                                            },
                                                    '16' => {
                                                              'name' => 'allowed_methods',
                                                              'offset' => '192',
                                                              'type' => '3689'
                                                            },
                                                    '17' => {
                                                              'name' => 'gencb',
                                                              'offset' => '200',
                                                              'type' => '370173'
                                                            },
                                                    '18' => {
                                                              'name' => 'gencbarg',
                                                              'offset' => '208',
                                                              'type' => '319'
                                                            },
                                                    '19' => {
                                                              'name' => 'bevcb',
                                                              'offset' => '216',
                                                              'type' => '370329'
                                                            },
                                                    '2' => {
                                                             'name' => 'callbacks',
                                                             'offset' => '32',
                                                             'type' => '370504'
                                                           },
                                                    '20' => {
                                                              'name' => 'bevcbarg',
                                                              'offset' => '224',
                                                              'type' => '319'
                                                            },
                                                    '21' => {
                                                              'name' => 'newreqcb',
                                                              'offset' => '232',
                                                              'type' => '370635'
                                                            },
                                                    '22' => {
                                                              'name' => 'newreqcbarg',
                                                              'offset' => '240',
                                                              'type' => '319'
                                                            },
                                                    '23' => {
                                                              'name' => 'errorcb',
                                                              'offset' => '248',
                                                              'type' => '370676'
                                                            },
                                                    '24' => {
                                                              'name' => 'errorcbarg',
                                                              'offset' => '256',
                                                              'type' => '319'
                                                            },
                                                    '25' => {
                                                              'name' => 'base',
                                                              'offset' => '264',
                                                              'type' => '6587'
                                                            },
                                                    '26' => {
                                                              'name' => 'ext_method_cmp',
                                                              'offset' => '272',
                                                              'type' => '368819'
                                                            },
                                                    '3' => {
                                                             'name' => 'connections',
                                                             'offset' => '48',
                                                             'type' => '370179'
                                                           },
                                                    '4' => {
                                                             'name' => 'ws_sessions',
                                                             'offset' => '64',
                                                             'type' => '370216'
                                                           },
                                                    '5' => {
                                                             'name' => 'connection_max',
                                                             'offset' => '80',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'connection_cnt',
                                                             'offset' => '84',
                                                             'type' => '119'
                                                           },
                                                    '7' => {
                                                             'name' => 'virtualhosts',
                                                             'offset' => '88',
                                                             'type' => '370541'
                                                           },
                                                    '8' => {
                                                             'name' => 'aliases',
                                                             'offset' => '104',
                                                             'type' => '370578'
                                                           },
                                                    '9' => {
                                                             'name' => 'vhost_pattern',
                                                             'offset' => '120',
                                                             'type' => '370'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp',
                                        'PrivateABI' => 1,
                                        'Size' => '280',
                                        'Type' => 'Struct'
                                      },
                          '370' => {
                                     'BaseType' => '376',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3700' => {
                                      'BaseType' => '160',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '370024' => {
                                        'BaseType' => '369683',
                                        'Name' => 'struct evhttp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370046' => {
                                        'Name' => 'void(*)(struct evhttp_connection*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '369617'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370052' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '116',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '370145'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '370151'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-http-internal.h-116',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370085' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '115',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '370052'
                                                           },
                                                    '1' => {
                                                             'name' => 'what',
                                                             'offset' => '16',
                                                             'type' => '370'
                                                           },
                                                    '2' => {
                                                             'name' => 'cb',
                                                             'offset' => '24',
                                                             'type' => '370173'
                                                           },
                                                    '3' => {
                                                             'name' => 'cbarg',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_cb',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '370145' => {
                                        'BaseType' => '370085',
                                        'Name' => 'struct evhttp_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370151' => {
                                        'BaseType' => '370145',
                                        'Name' => 'struct evhttp_cb**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370173' => {
                                        'Name' => 'void(*)(struct evhttp_request*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '368238'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370179' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '125',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '369617'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '369623'
                                                           }
                                                  },
                                        'Name' => 'struct evconq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370216' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '128',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370258'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370264'
                                                           }
                                                  },
                                        'Name' => 'struct evwsq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370253' => {
                                        'Line' => '41',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '391392'
                                                           },
                                                    '1' => {
                                                             'name' => 'bufev',
                                                             'offset' => '16',
                                                             'type' => '5845'
                                                           },
                                                    '2' => {
                                                             'name' => 'cb',
                                                             'offset' => '24',
                                                             'type' => '388252'
                                                           },
                                                    '3' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           },
                                                    '4' => {
                                                             'name' => 'cbclose',
                                                             'offset' => '40',
                                                             'type' => '388432'
                                                           },
                                                    '5' => {
                                                             'name' => 'cbclose_arg',
                                                             'offset' => '48',
                                                             'type' => '319'
                                                           },
                                                    '6' => {
                                                             'name' => 'http_server',
                                                             'offset' => '56',
                                                             'type' => '370024'
                                                           },
                                                    '7' => {
                                                             'name' => 'incomplete_frames',
                                                             'offset' => '64',
                                                             'type' => '5511'
                                                           },
                                                    '8' => {
                                                             'name' => 'closed',
                                                             'offset' => '72',
                                                             'type' => '391425'
                                                           }
                                                  },
                                        'Name' => 'struct evws_connection',
                                        'PrivateABI' => 1,
                                        'Size' => '80',
                                        'Source' => 'ws.c',
                                        'Type' => 'Struct'
                                      },
                          '370258' => {
                                        'BaseType' => '370253',
                                        'Name' => 'struct evws_connection*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370264' => {
                                        'BaseType' => '370258',
                                        'Name' => 'struct evws_connection**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370270' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '132',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '368740'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '370303'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-http-internal.h-132',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370303' => {
                                        'BaseType' => '368740',
                                        'Name' => 'struct evhttp_bound_socket**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370329' => {
                                        'Name' => 'struct bufferevent*(*)(struct event_base*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '6587'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '5845',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370346' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '143',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '370416'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '370422'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-http-internal.h-143',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370379' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '142',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '370346'
                                                           },
                                                    '1' => {
                                                             'name' => 'alias',
                                                             'offset' => '16',
                                                             'type' => '370'
                                                           }
                                                  },
                                        'Name' => 'struct evhttp_server_alias',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '370416' => {
                                        'BaseType' => '370379',
                                        'Name' => 'struct evhttp_server_alias*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370422' => {
                                        'BaseType' => '370416',
                                        'Name' => 'struct evhttp_server_alias**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370428' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '150',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '370024'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '370461'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-http-internal.h-150',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370461' => {
                                        'BaseType' => '370024',
                                        'Name' => 'struct evhttp**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370467' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '153',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '368740'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370303'
                                                           }
                                                  },
                                        'Name' => 'struct boundq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370504' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '155',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370145'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370151'
                                                           }
                                                  },
                                        'Name' => 'struct httpcbq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370541' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '164',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370024'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370461'
                                                           }
                                                  },
                                        'Name' => 'struct vhostsq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370578' => {
                                        'Header' => 'http-internal.h',
                                        'Line' => '166',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370416'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370422'
                                                           }
                                                  },
                                        'Name' => 'struct aliasq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370635' => {
                                        'Name' => 'int(*)(struct evhttp_request*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '368238'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370676' => {
                                        'Name' => 'int(*)(struct evhttp_request*, struct evbuffer*, int, char const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '368238'
                                                            },
                                                     '1' => {
                                                              'type' => '5511'
                                                            },
                                                     '2' => {
                                                              'type' => '119'
                                                            },
                                                     '3' => {
                                                              'type' => '2162'
                                                            },
                                                     '4' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370682' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '370764'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '370770'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-evrpc-internal.h-39',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370715' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '38',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '370682'
                                                           },
                                                    '1' => {
                                                             'name' => 'process',
                                                             'offset' => '16',
                                                             'type' => '370806'
                                                           },
                                                    '2' => {
                                                             'name' => 'process_arg',
                                                             'offset' => '24',
                                                             'type' => '319'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_hook',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '370764' => {
                                        'BaseType' => '370715',
                                        'Name' => 'struct evrpc_hook*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370770' => {
                                        'BaseType' => '370764',
                                        'Name' => 'struct evrpc_hook**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370806' => {
                                        'Name' => 'int(*)(void*, struct evhttp_request*, struct evbuffer*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            },
                                                     '1' => {
                                                              'type' => '368238'
                                                            },
                                                     '2' => {
                                                              'type' => '5511'
                                                            },
                                                     '3' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '370812' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370764'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370770'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_hook_list',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370849' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '58',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '370934'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '370940'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_pause_list',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '370886' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '98',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '371334'
                                                           },
                                                    '1' => {
                                                             'name' => 'ctx',
                                                             'offset' => '16',
                                                             'type' => '319'
                                                           },
                                                    '2' => {
                                                             'name' => 'cb',
                                                             'offset' => '24',
                                                             'type' => '371383'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_hook_ctx',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '370934' => {
                                        'BaseType' => '370886',
                                        'Name' => 'struct evrpc_hook_ctx*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370940' => {
                                        'BaseType' => '370934',
                                        'Name' => 'struct evrpc_hook_ctx**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '370946' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '60',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'in_hooks',
                                                             'offset' => '0',
                                                             'type' => '370812'
                                                           },
                                                    '1' => {
                                                             'name' => 'out_hooks',
                                                             'offset' => '16',
                                                             'type' => '370812'
                                                           },
                                                    '2' => {
                                                             'name' => 'pause_requests',
                                                             'offset' => '32',
                                                             'type' => '370849'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_hooks_',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '370995' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '79',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '368457'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '368463'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_list',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '371032' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '95',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '371249'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '371255'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_requestq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '371069' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '164',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'hook_meta',
                                                             'offset' => '0',
                                                             'type' => '371569'
                                                           },
                                                    '1' => {
                                                             'name' => 'next',
                                                             'offset' => '8',
                                                             'type' => '371575'
                                                           },
                                                    '10' => {
                                                              'name' => 'reply',
                                                              'offset' => '200',
                                                              'type' => '319'
                                                            },
                                                    '11' => {
                                                              'name' => 'request_marshal',
                                                              'offset' => '208',
                                                              'type' => '368566'
                                                            },
                                                    '12' => {
                                                              'name' => 'reply_clear',
                                                              'offset' => '216',
                                                              'type' => '7045'
                                                            },
                                                    '13' => {
                                                              'name' => 'reply_unmarshal',
                                                              'offset' => '224',
                                                              'type' => '368538'
                                                            },
                                                    '2' => {
                                                             'name' => 'pool',
                                                             'offset' => '24',
                                                             'type' => '371608'
                                                           },
                                                    '3' => {
                                                             'name' => 'evcon',
                                                             'offset' => '32',
                                                             'type' => '369617'
                                                           },
                                                    '4' => {
                                                             'name' => 'req',
                                                             'offset' => '40',
                                                             'type' => '368238'
                                                           },
                                                    '5' => {
                                                             'name' => 'ev_timeout',
                                                             'offset' => '48',
                                                             'type' => '4229'
                                                           },
                                                    '6' => {
                                                             'name' => 'name',
                                                             'offset' => '168',
                                                             'type' => '370'
                                                           },
                                                    '7' => {
                                                             'name' => 'cb',
                                                             'offset' => '176',
                                                             'type' => '371646'
                                                           },
                                                    '8' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '184',
                                                             'type' => '319'
                                                           },
                                                    '9' => {
                                                             'name' => 'request',
                                                             'offset' => '192',
                                                             'type' => '319'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_request_wrapper',
                                        'PrivateABI' => 1,
                                        'Size' => '232',
                                        'Type' => 'Struct'
                                      },
                          '371249' => {
                                        'BaseType' => '371069',
                                        'Name' => 'struct evrpc_request_wrapper*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '371255' => {
                                        'BaseType' => '371249',
                                        'Name' => 'struct evrpc_request_wrapper**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '371261' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '86',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'common',
                                                             'offset' => '0',
                                                             'type' => '370946'
                                                           },
                                                    '1' => {
                                                             'name' => 'base',
                                                             'offset' => '48',
                                                             'type' => '6587'
                                                           },
                                                    '2' => {
                                                             'name' => 'connections',
                                                             'offset' => '56',
                                                             'type' => '370179'
                                                           },
                                                    '3' => {
                                                             'name' => 'timeout',
                                                             'offset' => '72',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'requests',
                                                             'offset' => '80',
                                                             'type' => '371032'
                                                           }
                                                  },
                                        'Name' => 'struct evrpc_pool',
                                        'PrivateABI' => 1,
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '371334' => {
                                        'Header' => 'evrpc-internal.h',
                                        'Line' => '99',
                                        'Memb' => {
                                                    '0' => {
