$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.5.0',
          'Headers' => {
                         'bufferevent.h' => 1,
                         'bufferevent_struct.h' => 1,
                         'dns.h' => 1,
                         'dns_compat.h' => 1,
                         'dns_struct.h' => 1,
                         'event_struct.h' => 1,
                         'http.h' => 1,
                         'http_compat.h' => 1,
                         'http_struct.h' => 1,
                         'keyvalq_struct.h' => 1,
                         'rpc.h' => 1,
                         'rpc_struct.h' => 1,
                         'tag.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libevent_extra-2.1.so.7.0.1',
          'LibraryVersion' => '2.1.12',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'evdns.c' => 1,
                         'event_tagging.c' => 1,
                         'evrpc.c' => 1,
                         'http.c' => 1
                       },
          'SymbolInfo' => {
                            '100085' => {
                                          'Header' => 'http.h',

                                                            'evrpc_remove_hook' => 1,
                                                            'evrpc_reqstate_free_' => 1,
                                                            'evrpc_request_done' => 1,
                                                            'evrpc_request_get_pool' => 1,
                                                            'evrpc_request_set_cb' => 1,
                                                            'evrpc_request_set_pool' => 1,
                                                            'evrpc_resume_request' => 1,
                                                            'evrpc_send_request_generic' => 1,
                                                            'evrpc_unregister_rpc' => 1,
                                                            'evtag_consume' => 1,
                                                            'evtag_decode_int' => 1,
                                                            'evtag_decode_int64' => 1,
                                                            'evtag_decode_tag' => 1,
                                                            'evtag_encode_int' => 1,
                                                            'evtag_encode_int64' => 1,
                                                            'evtag_encode_tag' => 1,
                                                            'evtag_init' => 1,
                                                            'evtag_marshal' => 1,
                                                            'evtag_marshal_buffer' => 1,
                                                            'evtag_marshal_int' => 1,
                                                            'evtag_marshal_int64' => 1,
                                                            'evtag_marshal_string' => 1,
                                                            'evtag_marshal_timeval' => 1,
                                                            'evtag_payload_length' => 1,
                                                            'evtag_peek' => 1,
                                                            'evtag_peek_length' => 1,
                                                            'evtag_unmarshal' => 1,
                                                            'evtag_unmarshal_fixed' => 1,
                                                            'evtag_unmarshal_header' => 1,
                                                            'evtag_unmarshal_int' => 1,
                                                            'evtag_unmarshal_int64' => 1,
                                                            'evtag_unmarshal_string' => 1,
                                                            'evtag_unmarshal_timeval' => 1
                                                          }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '103217' => {
                                        'BaseType' => '84821',
                                        'Name' => 'evhttp_bound_socket_foreach_fn*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '109' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1116' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '112380' => {
                                        'BaseType' => '420',
                                        'Name' => 'uint16_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116' => {
                                     'BaseType' => '109',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '118521' => {
                                        'BaseType' => '86447',
                                        'Name' => 'struct evkeyvalq const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '121' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '132' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1382' => {
                                      'BaseType' => '52',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '139' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '140',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1393' => {
                                      'Header' => 'socket.h',
                                      'Line' => '175',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_data',
                                                           'offset' => '2',
                                                           'type' => '1435'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1430' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '1435' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[14]',
                                      'Size' => '14',
                                      'Type' => 'Array'
                                    },
                          '1451' => {
                                      'Header' => 'socket.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1500'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '1500' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '1516' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '161' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '148',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1611' => {
                                      'Header' => 'in.h',
                                      'Line' => '237',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin_addr',
                                                           'offset' => '4',
                                                           'type' => '2223'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin_zero',
                                                           'offset' => '8',
                                                           'type' => '2406'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1688' => {
                                      'Header' => 'in.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin6_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin6_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6_flowinfo',
                                                           'offset' => '4',
                                                           'type' => '436'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin6_addr',
                                                           'offset' => '8',
                                                           'type' => '2354'
                                                         },
                                                  '4' => {
                                                           'name' => 'sin6_scope_id',
                                                           'offset' => '24',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in6',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '172' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '150',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '183' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '190' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '19186' => {
                                       'BaseType' => '273',
                                       'Name' => 'struct timeval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '201' => {
                                     'BaseType' => '212',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2069' => {
                                      'BaseType' => '1430',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '212' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '219' => {
                                     'BaseType' => '212',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2212' => {
                                      'BaseType' => '436',
                                      'Header' => 'in.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2223' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '2212'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '224' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '197',
                                     'Name' => '__socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2248' => {
                                      'BaseType' => '2223',
                                      'Name' => 'struct in_addr const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '2253' => {
                                      'BaseType' => '420',
                                      'Header' => 'in.h',
                                      'Line' => '119',
                                      'Name' => 'in_port_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2264' => {
                                      'Header' => 'in.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '2306'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '2322'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '2338'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-213',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '2306' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2322' => {
                                      'BaseType' => '420',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2338' => {
                                      'BaseType' => '436',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '235' => {
                                     'BaseType' => '139',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2354' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '2264'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2379' => {
                                      'BaseType' => '2354',
                                      'Name' => 'struct in6_addr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '23826' => {
                                       'BaseType' => '2379',
                                       'Name' => 'struct in6_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2406' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '2422' => {
                                      'Header' => 'netdb.h',
                                      'Line' => '565',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ai_flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ai_family',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'ai_socktype',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ai_protocol',
                                                           'offset' => '12',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'ai_addrlen',
                                                           'offset' => '16',
                                                           'type' => '481'
                                                         },
                                                  '5' => {
                                                           'name' => 'ai_addr',
                                                           'offset' => '24',
                                                           'type' => '1516'
                                                         },
                                                  '6' => {
                                                           'name' => 'ai_canonname',
                                                           'offset' => '32',
                                                           'type' => '201'
                                                         },
                                                  '7' => {
                                                           'name' => 'ai_next',
                                                           'offset' => '40',
                                                           'type' => '2545'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '246' => {
                                     'BaseType' => '190',
                                     'Header' => 'types.h',
                                     'Line' => '109',
                                     'Name' => 'ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '24688' => {
                                       'BaseType' => '2248',
                                       'Name' => 'struct in_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2540' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '2545' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2551' => {
                                      'BaseType' => '2540',
                                      'Name' => 'struct addrinfo const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '257' => {
                                     'BaseType' => '66',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2651' => {
                                      'BaseType' => '2662',
                                      'Header' => 'dns.h',
                                      'Line' => '229',
                                      'Name' => 'evdns_callback_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2662' => {
                                      'Name' => 'void(*)(int, char, int, int, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '212'
                                                          },
                                                   '2' => {
                                                            'type' => '109'
                                                          },
                                                   '3' => {
                                                            'type' => '109'
                                                          },
                                                   '4' => {
                                                            'type' => '183'
                                                          },
                                                   '5' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2704' => {
                                      'BaseType' => '2716',
                                      'Header' => 'dns.h',
                                      'Line' => '564',
                                      'Name' => 'evdns_debug_log_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2716' => {
                                      'Name' => 'void(*)(int, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '345'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '273' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '161'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '172'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '2738' => {
                                      'BaseType' => '2750',
                                      'Header' => 'dns.h',
                                      'Line' => '620',
                                      'Name' => 'evdns_request_callback_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2750' => {
                                      'Name' => 'void(*)(struct evdns_server_request*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2772'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2772' => {
                                      'BaseType' => '2778',
                                      'Name' => 'struct evdns_server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2778' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '56',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'nquestions',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'questions',
                                                           'offset' => '8',
                                                           'type' => '2915'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_request',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2827' => {
                                      'BaseType' => '2839',
                                      'Header' => 'dns.h',
                                      'Line' => '697',
                                      'Name' => 'evdns_getaddrinfo_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2839' => {
                                      'Name' => 'void(*)(int, struct addrinfo*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '2545'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2866' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '61',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'class',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_question',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '2915' => {
                                      'BaseType' => '2921',
                                      'Name' => 'struct evdns_server_question**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2921' => {
                                      'BaseType' => '2866',
                                      'Name' => 'struct evdns_server_question*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2927' => {
                                      'Name' => 'void(*)(int, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '91'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2954' => {
                                      'Name' => 'void(*)(struct event*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2976'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2976' => {
                                      'BaseType' => '2982',
                                      'Name' => 'struct event*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2982' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '123',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_evcallback',
                                                           'offset' => '0',
                                                           'type' => '3129'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout_pos',
                                                           'offset' => '40',
                                                           'type' => '3340'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_fd',
                                                           'offset' => '56',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '64',
                                                           'type' => '3552'
                                                         },
                                                  '4' => {
                                                           'name' => 'ev_',
                                                           'offset' => '72',
                                                           'type' => '3521'
                                                         },
                                                  '5' => {
                                                           'name' => 'ev_events',
                                                           'offset' => '104',
                                                           'type' => '91'
                                                         },
                                                  '6' => {
                                                           'name' => 'ev_res',
                                                           'offset' => '106',
                                                           'type' => '91'
                                                         },
                                                  '7' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '112',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct event',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '3091' => {
                                      'Header' => 'event.h',
                                      'Name' => 'struct event_base',
                                      'Type' => 'Struct'
                                    },
                          '3096' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '3214'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3220'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-108',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '310' => {
                                     'BaseType' => '273',
                                     'Name' => 'struct timeval const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '3129' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '107',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_active_next',
                                                           'offset' => '0',
                                                           'type' => '3096'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_flags',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_pri',
                                                           'offset' => '18',
                                                           'type' => '404'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_closure',
                                                           'offset' => '19',
                                                           'type' => '404'
                                                         },
                                                  '4' => {
                                                           'name' => 'evcb_cb_union',
                                                           'offset' => '24',
                                                           'type' => '3226'
                                                         },
                                                  '5' => {
                                                           'name' => 'evcb_arg',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct event_callback',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3214' => {
                                      'BaseType' => '3129',
                                      'Name' => 'struct event_callback*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3220' => {
                                      'BaseType' => '3214',
                                      'Name' => 'struct event_callback**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3226' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_callback',
                                                           'offset' => '0',
                                                           'type' => '2927'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_selfcb',
                                                           'offset' => '0',
                                                           'type' => '3295'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_evfinalize',
                                                           'offset' => '0',
                                                           'type' => '2954'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_cbfinalize',
                                                           'offset' => '0',
                                                           'type' => '3295'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-113',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3295' => {
                                      'Name' => 'void(*)(struct event_callback*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3214'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3301' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '2976'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3334'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-128',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3334' => {
                                      'BaseType' => '2976',
                                      'Name' => 'struct event**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3340' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '127',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_next_with_common_timeout',
                                                           'offset' => '0',
                                                           'type' => '3301'
                                                         },
                                                  '1' => {
                                                           'name' => 'min_heap_idx',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-127',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '3371' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '138',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '2976'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3334'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-138',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3404' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '137',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io_next',
                                                           'offset' => '0',
                                                           'type' => '3371'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '16',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-137',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3437' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '2976'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3334'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-144',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '345' => {
                                     'BaseType' => '219',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3470' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '143',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_signal_next',
                                                           'offset' => '0',
                                                           'type' => '3437'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_ncalls',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_pncalls',
                                                           'offset' => '24',
                                                           'type' => '3515'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-143',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '351' => {
                                     'BaseType' => '345',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '3515' => {
                                      'BaseType' => '91',
                                      'Name' => 'short*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3521' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '135',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io',
                                                           'offset' => '0',
                                                           'type' => '3404'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_signal',
                                                           'offset' => '0',
                                                           'type' => '3470'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-135',
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '3552' => {
                                      'BaseType' => '3091',
                                      'Name' => 'struct event_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3796' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3853' => {
                                      'BaseType' => '310',
                                      'Name' => 'struct timeval const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3876' => {
                                      'Line' => '4304',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evdns_base',
                                                           'offset' => '0',
                                                           'type' => '4075'
                                                         },
                                                  '1' => {
                                                           'name' => 'hints',
                                                           'offset' => '8',
                                                           'type' => '2422'
                                                         },
                                                  '10' => {
                                                            'name' => 'pending_error',
                                                            'offset' => '256',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'user_canceled',
                                                            'offset' => '260',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_done',
                                                            'offset' => '260',
                                                            'type' => '59'
                                                          },
                                                  '2' => {
                                                           'name' => 'user_cb',
                                                           'offset' => '56',
                                                           'type' => '2827'
                                                         },
                                                  '3' => {
                                                           'name' => 'user_data',
                                                           'offset' => '64',
                                                           'type' => '183'
                                                         },
                                                  '4' => {
                                                           'name' => 'port',
                                                           'offset' => '72',
                                                           'type' => '420'
                                                         },
                                                  '5' => {
                                                           'name' => 'ipv4_request',
                                                           'offset' => '80',
                                                           'type' => '6401'
                                                         },
                                                  '6' => {
                                                           'name' => 'ipv6_request',
                                                           'offset' => '96',
                                                           'type' => '6401'
                                                         },
                                                  '7' => {
                                                           'name' => 'cname_result',
                                                           'offset' => '112',
                                                           'type' => '201'
                                                         },
                                                  '8' => {
                                                           'name' => 'pending_result',
                                                           'offset' => '120',
                                                           'type' => '2545'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout',
                                                           'offset' => '128',
                                                           'type' => '2982'
                                                         }
                                                },
                                      'Name' => 'struct evdns_getaddrinfo_request',
                                      'PrivateABI' => 1,
                                      'Size' => '264',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '38785' => {
                                       'BaseType' => '2223',
                                       'Name' => 'struct in_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '404' => {
                                     'BaseType' => '80',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '4069' => {
                                      'BaseType' => '3876',
                                      'Name' => 'struct evdns_getaddrinfo_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4075' => {
                                      'BaseType' => '4081',
                                      'Name' => 'struct evdns_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4081' => {
                                      'Line' => '305',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'req_heads',
                                                           'offset' => '0',
                                                           'type' => '6005'
                                                         },
                                                  '1' => {
                                                           'name' => 'req_waiting_head',
                                                           'offset' => '8',
                                                           'type' => '4844'
                                                         },
                                                  '10' => {
                                                            'name' => 'global_max_reissues',
                                                            'offset' => '72',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'global_max_retransmits',
                                                            'offset' => '76',
                                                            'type' => '109'
                                                          },
                                                  '12' => {
                                                            'name' => 'global_max_nameserver_timeout',
                                                            'offset' => '80',
                                                            'type' => '109'
                                                          },
                                                  '13' => {
                                                            'name' => 'global_randomize_case',
                                                            'offset' => '84',
                                                            'type' => '109'
                                                          },
                                                  '14' => {
                                                            'name' => 'global_nameserver_probe_initial_timeout',
                                                            'offset' => '88',
                                                            'type' => '273'
                                                          },
                                                  '15' => {
                                                            'name' => 'global_outgoing_address',
                                                            'offset' => '104',
                                                            'type' => '1451'
                                                          },
                                                  '16' => {
                                                            'name' => 'global_outgoing_addrlen',
                                                            'offset' => '232',
                                                            'type' => '481'
                                                          },
                                                  '17' => {
                                                            'name' => 'global_getaddrinfo_allow_skew',
                                                            'offset' => '240',
                                                            'type' => '273'
                                                          },
                                                  '18' => {
                                                            'name' => 'so_rcvbuf',
                                                            'offset' => '256',
                                                            'type' => '109'
                                                          },
                                                  '19' => {
                                                            'name' => 'so_sndbuf',
                                                            'offset' => '260',
                                                            'type' => '109'
                                                          },
                                                  '2' => {
                                                           'name' => 'server_head',
                                                           'offset' => '16',
                                                           'type' => '5156'
                                                         },
                                                  '20' => {
                                                            'name' => 'getaddrinfo_ipv4_timeouts',
                                                            'offset' => '264',
                                                            'type' => '109'
                                                          },
                                                  '21' => {
                                                            'name' => 'getaddrinfo_ipv6_timeouts',
                                                            'offset' => '268',
                                                            'type' => '109'
                                                          },
                                                  '22' => {
                                                            'name' => 'getaddrinfo_ipv4_answered',
                                                            'offset' => '272',
                                                            'type' => '109'
                                                          },
                                                  '23' => {
                                                            'name' => 'getaddrinfo_ipv6_answered',
                                                            'offset' => '276',
                                                            'type' => '109'
                                                          },
                                                  '24' => {
                                                            'name' => 'global_search_state',
                                                            'offset' => '280',
                                                            'type' => '4926'
                                                          },
                                                  '25' => {
                                                            'name' => 'hostsdb',
                                                            'offset' => '288',
                                                            'type' => '5887'
                                                          },
                                                  '26' => {
                                                            'name' => 'lock',
                                                            'offset' => '304',
                                                            'type' => '183'
                                                          },
                                                  '27' => {
                                                            'name' => 'disable_when_inactive',
                                                            'offset' => '312',
                                                            'type' => '109'
                                                          },
                                                  '3' => {
                                                           'name' => 'n_req_heads',
                                                           'offset' => '24',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'event_base',
                                                           'offset' => '32',
                                                           'type' => '3552'
                                                         },
                                                  '5' => {
                                                           'name' => 'global_good_nameservers',
                                                           'offset' => '40',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'global_requests_inflight',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'global_requests_waiting',
                                                           'offset' => '48',
                                                           'type' => '109'
                                                         },
                                                  '8' => {
                                                           'name' => 'global_max_requests_inflight',
                                                           'offset' => '52',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'global_timeout',
                                                           'offset' => '56',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct evdns_base',
                                      'PrivateABI' => 1,
                                      'Size' => '320',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '420' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '436' => {
                                     'BaseType' => '121',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '447' => {
                                     'BaseType' => '458',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4525' => {
                                      'Line' => '158',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'current_req',
                                                           'offset' => '0',
                                                           'type' => '4844'
                                                         },
                                                  '1' => {
                                                           'name' => 'base',
                                                           'offset' => '8',
                                                           'type' => '4075'
                                                         },
                                                  '2' => {
                                                           'name' => 'pending_cb',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'search_index',
                                                           'offset' => '20',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'search_state',
                                                           'offset' => '24',
                                                           'type' => '4926'
                                                         },
                                                  '5' => {
                                                           'name' => 'search_origname',
                                                           'offset' => '32',
                                                           'type' => '201'
                                                         },
                                                  '6' => {
                                                           'name' => 'search_flags',
                                                           'offset' => '40',
                                                           'type' => '109'
                                                         }
                                                },
                                      'Name' => 'struct evdns_request',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '45541' => {
                                       'Name' => 'void(*)(char*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '201'
                                                           },
                                                    '1' => {
                                                             'type' => '257'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '45596' => {
                                       'Name' => 'uint16_t(*)()',
                                       'Return' => '420',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '458' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '4622' => {
                                      'Line' => '172',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'request',
                                                           'offset' => '0',
                                                           'type' => '4937'
                                                         },
                                                  '1' => {
                                                           'name' => 'request_type',
                                                           'offset' => '8',
                                                           'type' => '404'
                                                         },
                                                  '10' => {
                                                            'name' => 'timeout_event',
                                                            'offset' => '64',
                                                            'type' => '2982'
                                                          },
                                                  '11' => {
                                                            'name' => 'trans_id',
                                                            'offset' => '192',
                                                            'type' => '420'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_appended',
                                                            'offset' => '192',
                                                            'type' => '59'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'transmit_me',
                                                            'offset' => '192',
                                                            'type' => '59'
                                                          },
                                                  '14' => {
                                                            'name' => 'put_cname_in_ptr',
                                                            'offset' => '200',
                                                            'type' => '505'
                                                          },
                                                  '15' => {
                                                            'name' => 'base',
                                                            'offset' => '208',
                                                            'type' => '4075'
                                                          },
                                                  '16' => {
                                                            'name' => 'handle',
                                                            'offset' => '216',
                                                            'type' => '5167'
                                                          },
                                                  '2' => {
                                                           'name' => 'request_len',
                                                           'offset' => '12',
                                                           'type' => '59'
                                                         },
                                                  '3' => {
                                                           'name' => 'reissue_count',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'tx_count',
                                                           'offset' => '20',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'user_pointer',
                                                           'offset' => '24',
                                                           'type' => '183'
                                                         },
                                                  '6' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '32',
                                                           'type' => '2651'
                                                         },
                                                  '7' => {
                                                           'name' => 'ns',
                                                           'offset' => '40',
                                                           'type' => '5156'
                                                         },
                                                  '8' => {
                                                           'name' => 'next',
                                                           'offset' => '48',
                                                           'type' => '4844'
                                                         },
                                                  '9' => {
                                                           'name' => 'prev',
                                                           'offset' => '56',
                                                           'type' => '4844'
                                                         }
                                                },
                                      'Name' => 'struct request',
                                      'PrivateABI' => 1,
                                      'Size' => '224',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '481' => {
                                     'BaseType' => '224',
                                     'Header' => 'unistd.h',
                                     'Line' => '277',
                                     'Name' => 'socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4844' => {
                                      'BaseType' => '4622',
                                      'Name' => 'struct request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4855' => {
                                      'Line' => '3079',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'refcount',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ndots',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'num_domains',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'head',
                                                           'offset' => '16',
                                                           'type' => '6395'
                                                         }
                                                },
                                      'Name' => 'struct search_state',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '4926' => {
                                      'BaseType' => '4855',
                                      'Name' => 'struct search_state*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4937' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4948' => {
                                      'Line' => '218',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'address',
                                                           'offset' => '8',
                                                           'type' => '1451'
                                                         },
                                                  '10' => {
                                                            'name' => 'state',
                                                            'offset' => '432',
                                                            'type' => '212'
                                                          },
                                                  '11' => {
                                                            'name' => 'choked',
                                                            'offset' => '433',
                                                            'type' => '212'
                                                          },
                                                  '12' => {
                                                            'name' => 'write_waiting',
                                                            'offset' => '434',
                                                            'type' => '212'
                                                          },
                                                  '13' => {
                                                            'name' => 'base',
                                                            'offset' => '440',
                                                            'type' => '4075'
                                                          },
                                                  '14' => {
                                                            'name' => 'requests_inflight',
                                                            'offset' => '448',
                                                            'type' => '109'
                                                          },
                                                  '2' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '136',
                                                           'type' => '481'
                                                         },
                                                  '3' => {
                                                           'name' => 'failed_times',
                                                           'offset' => '140',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'timedout',
                                                           'offset' => '144',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'event',
                                                           'offset' => '152',
                                                           'type' => '2982'
                                                         },
                                                  '6' => {
                                                           'name' => 'next',
                                                           'offset' => '280',
                                                           'type' => '5156'
                                                         },
                                                  '7' => {
                                                           'name' => 'prev',
                                                           'offset' => '288',
                                                           'type' => '5156'
                                                         },
                                                  '8' => {
                                                           'name' => 'timeout_event',
                                                           'offset' => '296',
                                                           'type' => '2982'
                                                         },
                                                  '9' => {
                                                           'name' => 'probe_request',
                                                           'offset' => '424',
                                                           'type' => '5167'
                                                         }
                                                },
                                      'Name' => 'struct nameserver',
                                      'PrivateABI' => 1,
                                      'Size' => '456',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '505' => {
                                     'BaseType' => '201',
                                     'Name' => 'char**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5156' => {
                                      'BaseType' => '4948',
                                      'Name' => 'struct nameserver*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5167' => {
                                      'BaseType' => '4525',
                                      'Name' => 'struct evdns_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '5408' => {
                                      'Line' => '245',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'choked',
                                                           'offset' => '8',
                                                           'type' => '212'
                                                         },
                                                  '3' => {
                                                           'name' => 'closing',
                                                           'offset' => '9',
                                                           'type' => '212'
                                                         },
                                                  '4' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '16',
                                                           'type' => '2738'
                                                         },
                                                  '5' => {
                                                           'name' => 'user_data',
                                                           'offset' => '24',
                                                           'type' => '183'
                                                         },
                                                  '6' => {
                                                           'name' => 'event',
                                                           'offset' => '32',
                                                           'type' => '2982'
                                                         },
                                                  '7' => {
                                                           'name' => 'pending_replies',
                                                           'offset' => '160',
                                                           'type' => '5751'
                                                         },
                                                  '8' => {
                                                           'name' => 'event_base',
                                                           'offset' => '168',
                                                           'type' => '3552'
                                                         },
                                                  '9' => {
                                                           'name' => 'lock',
                                                           'offset' => '176',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_port',
                                      'PrivateABI' => 1,
                                      'Size' => '184',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5542' => {
                                      'Line' => '276',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_pending',
                                                           'offset' => '0',
                                                           'type' => '5751'
                                                         },
                                                  '1' => {
                                                           'name' => 'prev_pending',
                                                           'offset' => '8',
                                                           'type' => '5751'
                                                         },
                                                  '10' => {
                                                            'name' => 'authority',
                                                            'offset' => '184',
                                                            'type' => '5875'
                                                          },
                                                  '11' => {
                                                            'name' => 'additional',
                                                            'offset' => '192',
                                                            'type' => '5875'
                                                          },
                                                  '12' => {
                                                            'name' => 'response',
                                                            'offset' => '200',
                                                            'type' => '201'
                                                          },
                                                  '13' => {
                                                            'name' => 'response_len',
                                                            'offset' => '208',
                                                            'type' => '257'
                                                          },
                                                  '14' => {
                                                            'name' => 'base',
                                                            'offset' => '216',
                                                            'type' => '2778'
                                                          },
                                                  '2' => {
                                                           'name' => 'trans_id',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'port',
                                                           'offset' => '24',
                                                           'type' => '5881'
                                                         },
                                                  '4' => {
                                                           'name' => 'addr',
                                                           'offset' => '32',
                                                           'type' => '1451'
                                                         },
                                                  '5' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '160',
                                                           'type' => '481'
                                                         },
                                                  '6' => {
                                                           'name' => 'n_answer',
                                                           'offset' => '164',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'n_authority',
                                                           'offset' => '168',
                                                           'type' => '109'
                                                         },
                                                  '8' => {
                                                           'name' => 'n_additional',
                                                           'offset' => '172',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'answer',
                                                           'offset' => '176',
                                                           'type' => '5875'
                                                         }
                                                },
                                      'Name' => 'struct server_request',
                                      'PrivateABI' => 1,
                                      'Size' => '232',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '56165' => {
                                       'BaseType' => '66',
                                       'Header' => 'types.h',
                                       'Line' => '44',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '57204' => {
                                       'BaseType' => '56165',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '5751' => {
                                      'BaseType' => '5542',
                                      'Name' => 'struct server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5757' => {
                                      'Line' => '263',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '5875'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '201'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'class',
                                                           'offset' => '18',
                                                           'type' => '420'
                                                         },
                                                  '4' => {
                                                           'name' => 'ttl',
                                                           'offset' => '20',
                                                           'type' => '436'
                                                         },
                                                  '5' => {
                                                           'name' => 'is_name',
                                                           'offset' => '24',
                                                           'type' => '212'
                                                         },
                                                  '6' => {
                                                           'name' => 'datalen',
                                                           'offset' => '26',
                                                           'type' => '420'
                                                         },
                                                  '7' => {
                                                           'name' => 'data',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct server_reply_item',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '58107' => {
                                       'BaseType' => '58113',
                                       'Name' => 'struct evbuffer*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58113' => {
                                       'Header' => 'buffer.h',
                                       'Name' => 'struct evbuffer',
                                       'Type' => 'Struct'
                                     },
                          '5875' => {
                                      'BaseType' => '5757',
                                      'Name' => 'struct server_reply_item*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5881' => {
                                      'BaseType' => '5408',
                                      'Name' => 'struct evdns_server_port*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5887' => {
                                      'Line' => '360',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqh_first',
                                                           'offset' => '0',
                                                           'type' => '5993'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqh_last',
                                                           'offset' => '8',
                                                           'type' => '5999'
                                                         }
                                                },
                                      'Name' => 'struct hosts_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '5927' => {
                                      'Line' => '369',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '6011'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '6047'
                                                         },
                                                  '2' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'hostname',
                                                           'offset' => '48',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct hosts_entry',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '59278' => {
                                       'BaseType' => '57204',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59574' => {
                                       'BaseType' => '436',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5993' => {
                                      'BaseType' => '5927',
                                      'Name' => 'struct hosts_entry*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5999' => {
                                      'BaseType' => '5993',
                                      'Name' => 'struct hosts_entry**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6005' => {
                                      'BaseType' => '4844',
                                      'Name' => 'struct request**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6011' => {
                                      'Line' => '370',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '5993'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '5999'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evdns.c-370',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6047' => {
                                      'Line' => '371',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa',
                                                           'offset' => '0',
                                                           'type' => '1393'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin',
                                                           'offset' => '0',
                                                           'type' => '1611'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6',
                                                           'offset' => '0',
                                                           'type' => '1688'
                                                         }
                                                },
                                      'Name' => 'anon-union-evdns.c-371',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Union'
                                    },
                          '6355' => {
                                      'Line' => '3073',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'len',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '6395'
                                                         }
                                                },
                                      'Name' => 'struct search_domain',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6395' => {
                                      'BaseType' => '6355',
                                      'Name' => 'struct search_domain*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6401' => {
                                      'Line' => '4298',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'r',
                                                           'offset' => '0',
                                                           'type' => '5167'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct getaddrinfo_subrequest',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '64441' => {
                                       'BaseType' => '132',
                                       'Header' => 'types.h',
                                       'Line' => '43',
                                       'Name' => '__int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '64550' => {
                                       'BaseType' => '64441',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '27',
                                       'Name' => 'int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '66584' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '66666'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '66672'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-keyvalq_struct.h-59',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '66617' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '66584'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '24',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyval',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '66666' => {
                                       'BaseType' => '66617',
                                       'Name' => 'struct evkeyval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66672' => {
                                       'BaseType' => '66666',
                                       'Name' => 'struct evkeyval**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '66678' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '66666'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '66672'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyvalq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '67177' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '472',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_INPUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_OUTPUT',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_TYPE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '67208' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '490',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_TERMINATE',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_CONTINUE',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVRPC_PAUSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_RESULT',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '67245' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'error',
                                                            'offset' => '0',
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_req',
                                                            'offset' => '8',
                                                            'type' => '67660'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_status',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '67282' => {
                                       'Header' => 'http_struct.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '70623'
                                                          },
                                                   '1' => {
                                                            'name' => 'evcon',
                                                            'offset' => '16',
                                                            'type' => '68821'
                                                          },
                                                   '10' => {
                                                             'name' => 'headers_size',
                                                             'offset' => '80',
                                                             'type' => '257'
                                                           },
                                                   '11' => {
                                                             'name' => 'body_size',
                                                             'offset' => '88',
                                                             'type' => '257'
                                                           },
                                                   '12' => {
                                                             'name' => 'uri',
                                                             'offset' => '96',
                                                             'type' => '201'
                                                           },
                                                   '13' => {
                                                             'name' => 'uri_elems',
                                                             'offset' => '104',
                                                             'type' => '70667'
                                                           },
                                                   '14' => {
                                                             'name' => 'major',
                                                             'offset' => '112',
                                                             'type' => '212'
                                                           },
                                                   '15' => {
                                                             'name' => 'minor',
                                                             'offset' => '113',
                                                             'type' => '212'
                                                           },
                                                   '16' => {
                                                             'name' => 'response_code',
                                                             'offset' => '116',
                                                             'type' => '109'
                                                           },
                                                   '17' => {
                                                             'name' => 'response_code_line',
                                                             'offset' => '120',
                                                             'type' => '201'
                                                           },
                                                   '18' => {
                                                             'name' => 'input_buffer',
                                                             'offset' => '128',
                                                             'type' => '58107'
                                                           },
                                                   '19' => {
                                                             'name' => 'ntoread',
                                                             'offset' => '136',
                                                             'type' => '64550'
                                                           },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '24',
                                                            'type' => '109'
                                                          },
                                                   '20' => {
                                                             'bitfield' => '1',
                                                             'name' => 'chunked',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '21' => {
                                                             'bitfield' => '1',
                                                             'name' => 'userdone',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '22' => {
                                                             'name' => 'output_buffer',
                                                             'offset' => '152',
                                                             'type' => '58107'
                                                           },
                                                   '23' => {
                                                             'name' => 'cb',
                                                             'offset' => '160',
                                                             'type' => '69265'
                                                           },
                                                   '24' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '168',
                                                             'type' => '183'
                                                           },
                                                   '25' => {
                                                             'name' => 'chunk_cb',
                                                             'offset' => '176',
                                                             'type' => '69265'
                                                           },
                                                   '26' => {
                                                             'name' => 'header_cb',
                                                             'offset' => '184',
                                                             'type' => '70693'
                                                           },
                                                   '27' => {
                                                             'name' => 'error_cb',
                                                             'offset' => '192',
                                                             'type' => '70715'
                                                           },
                                                   '28' => {
                                                             'name' => 'on_complete_cb',
                                                             'offset' => '200',
                                                             'type' => '69265'
                                                           },
                                                   '29' => {
                                                             'name' => 'on_complete_cb_arg',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '3' => {
                                                            'name' => 'input_headers',
                                                            'offset' => '32',
                                                            'type' => '70656'
                                                          },
                                                   '4' => {
                                                            'name' => 'output_headers',
                                                            'offset' => '40',
                                                            'type' => '70656'
                                                          },
                                                   '5' => {
                                                            'name' => 'remote_host',
                                                            'offset' => '48',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'remote_port',
                                                            'offset' => '56',
                                                            'type' => '420'
                                                          },
                                                   '7' => {
                                                            'name' => 'host_cache',
                                                            'offset' => '64',
                                                            'type' => '201'
                                                          },
                                                   '8' => {
                                                            'name' => 'kind',
                                                            'offset' => '72',
                                                            'type' => '68279'
                                                          },
                                                   '9' => {
                                                            'name' => 'type',
                                                            'offset' => '76',
                                                            'type' => '68205'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_request',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '67660' => {
                                       'BaseType' => '67282',
                                       'Name' => 'struct evhttp_request*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67666' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '67879'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '67885'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-rpc_struct.h-70',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '67699' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '67666'
                                                          },
                                                   '1' => {
                                                            'name' => 'uri',
                                                            'offset' => '16',
                                                            'type' => '345'
                                                          },
                                                   '10' => {
                                                             'name' => 'reply_marshal',
                                                             'offset' => '88',
                                                             'type' => '67988'
                                                           },
                                                   '11' => {
                                                             'name' => 'cb',
                                                             'offset' => '96',
                                                             'type' => '68101'
                                                           },
                                                   '12' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '104',
                                                             'type' => '183'
                                                           },
                                                   '13' => {
                                                             'name' => 'base',
                                                             'offset' => '112',
                                                             'type' => '68156'
                                                           },
                                                   '2' => {
                                                            'name' => 'request_new',
                                                            'offset' => '24',
                                                            'type' => '67906'
                                                          },
                                                   '3' => {
                                                            'name' => 'request_new_arg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          },
                                                   '4' => {
                                                            'name' => 'request_free',
                                                            'offset' => '40',
                                                            'type' => '3796'
                                                          },
                                                   '5' => {
                                                            'name' => 'request_unmarshal',
                                                            'offset' => '48',
                                                            'type' => '67960'
                                                          },
                                                   '6' => {
                                                            'name' => 'reply_new',
                                                            'offset' => '56',
                                                            'type' => '67906'
                                                          },
                                                   '7' => {
                                                            'name' => 'reply_new_arg',
                                                            'offset' => '64',
                                                            'type' => '183'
                                                          },
                                                   '8' => {
                                                            'name' => 'reply_free',
                                                            'offset' => '72',
                                                            'type' => '3796'
                                                          },
                                                   '9' => {
                                                            'name' => 'reply_complete',
                                                            'offset' => '80',
                                                            'type' => '67966'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '67879' => {
                                       'BaseType' => '67699',
                                       'Name' => 'struct evrpc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67885' => {
                                       'BaseType' => '67879',
                                       'Name' => 'struct evrpc**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '67906' => {
                                       'Name' => 'void*(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '183',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '67960' => {
                                       'Name' => 'int(*)(void*, struct evbuffer*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '58107'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '67966' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '67988' => {
                                       'Name' => 'void(*)(struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '58107'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '68010' => {
                                       'BaseType' => '68016',
                                       'Name' => 'struct evrpc_req_generic*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68016' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hook_meta',
                                                            'offset' => '0',
                                                            'type' => '70540'
                                                          },
                                                   '1' => {
                                                            'name' => 'request',
                                                            'offset' => '8',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'reply',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '3' => {
                                                            'name' => 'rpc',
                                                            'offset' => '24',
                                                            'type' => '67879'
                                                          },
                                                   '4' => {
                                                            'name' => 'http_req',
                                                            'offset' => '32',
                                                            'type' => '67660'
                                                          },
                                                   '5' => {
                                                            'name' => 'rpc_data',
                                                            'offset' => '40',
                                                            'type' => '58107'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_req_generic',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '68101' => {
                                       'Name' => 'void(*)(struct evrpc_req_generic*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68010'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '68107' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '72',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'common',
                                                            'offset' => '0',
                                                            'type' => '69917'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_server',
                                                            'offset' => '48',
                                                            'type' => '69116'
                                                          },
                                                   '2' => {
                                                            'name' => 'registered_rpcs',
                                                            'offset' => '56',
                                                            'type' => '69966'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_base',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '68156' => {
                                       'BaseType' => '68107',
                                       'Name' => 'struct evrpc_base*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68162' => {
                                       'BaseType' => '68168',
                                       'Name' => 'struct evhttp_bound_socket*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68168' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '121',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '69308'
                                                          },
                                                   '1' => {
                                                            'name' => 'listener',
                                                            'offset' => '16',
                                                            'type' => '69352'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_bound_socket',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '68205' => {
                                       'Header' => 'http.h',
                                       'Line' => '492',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQ_GET',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_REQ_POST',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVHTTP_REQ_HEAD',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVHTTP_REQ_PUT',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVHTTP_REQ_DELETE',
                                                            'value' => '16'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVHTTP_REQ_OPTIONS',
                                                            'value' => '32'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVHTTP_REQ_TRACE',
                                                            'value' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVHTTP_REQ_CONNECT',
                                                            'value' => '128'
                                                          },
                                                   '8' => {
                                                            'name' => 'EVHTTP_REQ_PATCH',
                                                            'value' => '256'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_cmd_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '68279' => {
                                       'Header' => 'http.h',
                                       'Line' => '505',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQUEST',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_RESPONSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_kind',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '68310' => {
                                       'Header' => 'http.h',
                                       'Line' => '574',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVREQ_HTTP_TIMEOUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVREQ_HTTP_EOF',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVREQ_HTTP_INVALID_HEADER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVREQ_HTTP_BUFFER_ERROR',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVREQ_HTTP_REQUEST_CANCEL',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVREQ_HTTP_DATA_TOO_LONG',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_error',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '68387' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '36',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVCON_DISCONNECTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVCON_CONNECTING',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVCON_IDLE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVCON_READING_FIRSTLINE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVCON_READING_HEADERS',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVCON_READING_BODY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVCON_READING_TRAILER',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVCON_WRITING',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_connection_state',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '68453' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '68821'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '68827'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-54',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '68486' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '51',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '68453'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '16',
                                                            'type' => '109'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '208',
                                                             'type' => '109'
                                                           },
                                                   '11' => {
                                                             'name' => 'timeout',
                                                             'offset' => '216',
                                                             'type' => '273'
                                                           },
                                                   '12' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '232',
                                                             'type' => '109'
                                                           },
                                                   '13' => {
                                                             'name' => 'retry_max',
                                                             'offset' => '236',
                                                             'type' => '109'
                                                           },
                                                   '14' => {
                                                             'name' => 'initial_retry_timeout',
                                                             'offset' => '240',
                                                             'type' => '273'
                                                           },
                                                   '15' => {
                                                             'name' => 'state',
                                                             'offset' => '256',
                                                             'type' => '68387'
                                                           },
                                                   '16' => {
                                                             'name' => 'http_server',
                                                             'offset' => '264',
                                                             'type' => '69116'
                                                           },
                                                   '17' => {
                                                             'name' => 'requests',
                                                             'offset' => '272',
                                                             'type' => '68833'
                                                           },
                                                   '18' => {
                                                             'name' => 'cb',
                                                             'offset' => '288',
                                                             'type' => '69138'
                                                           },
                                                   '19' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '296',
                                                             'type' => '183'
                                                           },
                                                   '2' => {
                                                            'name' => 'bufev',
                                                            'offset' => '24',
                                                            'type' => '68881'
                                                          },
                                                   '20' => {
                                                             'name' => 'closecb',
                                                             'offset' => '304',
                                                             'type' => '69138'
                                                           },
                                                   '21' => {
                                                             'name' => 'closecb_arg',
                                                             'offset' => '312',
                                                             'type' => '183'
                                                           },
                                                   '22' => {
                                                             'name' => 'read_more_deferred_cb',
                                                             'offset' => '320',
                                                             'type' => '3129'
                                                           },
                                                   '23' => {
                                                             'name' => 'base',
                                                             'offset' => '360',
                                                             'type' => '3552'
                                                           },
                                                   '24' => {
                                                             'name' => 'dns_base',
                                                             'offset' => '368',
                                                             'type' => '4075'
                                                           },
                                                   '25' => {
                                                             'name' => 'ai_family',
                                                             'offset' => '376',
                                                             'type' => '109'
                                                           },
                                                   '3' => {
                                                            'name' => 'retry_ev',
                                                            'offset' => '32',
                                                            'type' => '2982'
                                                          },
                                                   '4' => {
                                                            'name' => 'bind_address',
                                                            'offset' => '160',
                                                            'type' => '201'
                                                          },
                                                   '5' => {
                                                            'name' => 'bind_port',
                                                            'offset' => '168',
                                                            'type' => '420'
                                                          },
                                                   '6' => {
                                                            'name' => 'address',
                                                            'offset' => '176',
                                                            'type' => '201'
                                                          },
                                                   '7' => {
                                                            'name' => 'port',
                                                            'offset' => '184',
                                                            'type' => '420'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_headers_size',
                                                            'offset' => '192',
                                                            'type' => '257'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_body_size',
                                                            'offset' => '200',
                                                            'type' => '57204'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_connection',
                                       'PrivateABI' => 1,
                                       'Size' => '384',
                                       'Type' => 'Struct'
                                     },
                          '68821' => {
                                       'BaseType' => '68486',
                                       'Name' => 'struct evhttp_connection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68827' => {
                                       'BaseType' => '68821',
                                       'Name' => 'struct evhttp_connection**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68833' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '92',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '67660'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '68870'
                                                          }
                                                 },
                                       'Name' => 'struct evcon_requestq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '68870' => {
                                       'BaseType' => '67660',
                                       'Name' => 'struct evhttp_request**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68876' => {
                                       'Header' => 'bufferevent_struct.h',
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ev_base',
                                                            'offset' => '0',
                                                            'type' => '3552'
                                                          },
                                                   '1' => {
                                                            'name' => 'be_ops',
                                                            'offset' => '8',
                                                            'type' => '88702'
                                                          },
                                                   '10' => {
                                                             'name' => 'errorcb',
                                                             'offset' => '336',
                                                             'type' => '85524'
                                                           },
                                                   '11' => {
                                                             'name' => 'cbarg',
                                                             'offset' => '344',
                                                             'type' => '183'
                                                           },
                                                   '12' => {
                                                             'name' => 'timeout_read',
                                                             'offset' => '352',
                                                             'type' => '273'
                                                           },
                                                   '13' => {
                                                             'name' => 'timeout_write',
                                                             'offset' => '368',
                                                             'type' => '273'
                                                           },
                                                   '14' => {
                                                             'name' => 'enabled',
                                                             'offset' => '384',
                                                             'type' => '91'
                                                           },
                                                   '2' => {
                                                            'name' => 'ev_read',
                                                            'offset' => '16',
                                                            'type' => '2982'
                                                          },
                                                   '3' => {
                                                            'name' => 'ev_write',
                                                            'offset' => '144',
                                                            'type' => '2982'
                                                          },
                                                   '4' => {
                                                            'name' => 'input',
                                                            'offset' => '272',
                                                            'type' => '58107'
                                                          },
                                                   '5' => {
                                                            'name' => 'output',
                                                            'offset' => '280',
                                                            'type' => '58107'
                                                          },
                                                   '6' => {
                                                            'name' => 'wm_read',
                                                            'offset' => '288',
                                                            'type' => '88531'
                                                          },
                                                   '7' => {
                                                            'name' => 'wm_write',
                                                            'offset' => '304',
                                                            'type' => '88531'
                                                          },
                                                   '8' => {
                                                            'name' => 'readcb',
                                                            'offset' => '320',
                                                            'type' => '85280'
                                                          },
                                                   '9' => {
                                                            'name' => 'writecb',
                                                            'offset' => '328',
                                                            'type' => '85280'
                                                          }
                                                 },
                                       'Name' => 'struct bufferevent',
                                       'Size' => '392',
                                       'Type' => 'Struct'
                                     },
                          '68881' => {
                                       'BaseType' => '68876',
                                       'Name' => 'struct bufferevent*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68887' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '134',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_vhost',
                                                            'offset' => '0',
                                                            'type' => '69440'
                                                          },
                                                   '1' => {
                                                            'name' => 'sockets',
                                                            'offset' => '16',
                                                            'type' => '69479'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '136',
                                                             'type' => '109'
                                                           },
                                                   '11' => {
                                                             'name' => 'default_content_type',
                                                             'offset' => '144',
                                                             'type' => '345'
                                                           },
                                                   '12' => {
                                                             'name' => 'allowed_methods',
                                                             'offset' => '152',
                                                             'type' => '420'
                                                           },
                                                   '13' => {
                                                             'name' => 'gencb',
                                                             'offset' => '160',
                                                             'type' => '69265'
                                                           },
                                                   '14' => {
                                                             'name' => 'gencbarg',
                                                             'offset' => '168',
                                                             'type' => '183'
                                                           },
                                                   '15' => {
                                                             'name' => 'bevcb',
                                                             'offset' => '176',
                                                             'type' => '69647'
                                                           },
                                                   '16' => {
                                                             'name' => 'bevcbarg',
                                                             'offset' => '184',
                                                             'type' => '183'
                                                           },
                                                   '17' => {
                                                             'name' => 'base',
                                                             'offset' => '192',
                                                             'type' => '3552'
                                                           },
                                                   '2' => {
                                                            'name' => 'callbacks',
                                                            'offset' => '32',
                                                            'type' => '69516'
                                                          },
                                                   '3' => {
                                                            'name' => 'connections',
                                                            'offset' => '48',
                                                            'type' => '69271'
                                                          },
                                                   '4' => {
                                                            'name' => 'virtualhosts',
                                                            'offset' => '64',
                                                            'type' => '69553'
                                                          },
                                                   '5' => {
                                                            'name' => 'aliases',
                                                            'offset' => '80',
                                                            'type' => '69590'
                                                          },
                                                   '6' => {
                                                            'name' => 'vhost_pattern',
                                                            'offset' => '96',
                                                            'type' => '201'
                                                          },
                                                   '7' => {
                                                            'name' => 'timeout',
                                                            'offset' => '104',
                                                            'type' => '273'
                                                          },
                                                   '8' => {
                                                            'name' => 'default_max_headers_size',
                                                            'offset' => '120',
                                                            'type' => '257'
                                                          },
                                                   '9' => {
                                                            'name' => 'default_max_body_size',
                                                            'offset' => '128',
                                                            'type' => '57204'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp',
                                       'PrivateABI' => 1,
                                       'Size' => '200',
                                       'Type' => 'Struct'
                                     },
                          '69116' => {
                                       'BaseType' => '68887',
                                       'Name' => 'struct evhttp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69138' => {
                                       'Name' => 'void(*)(struct evhttp_connection*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68821'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '69144' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '109',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '69237'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69243'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-109',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69177' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '108',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '69144'
                                                          },
                                                   '1' => {
                                                            'name' => 'what',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '69265'
                                                          },
                                                   '3' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_cb',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '69237' => {
                                       'BaseType' => '69177',
                                       'Name' => 'struct evhttp_cb*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69243' => {
                                       'BaseType' => '69237',
                                       'Name' => 'struct evhttp_cb**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69265' => {
                                       'Name' => 'void(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '67660'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '69271' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '118',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '68821'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '68827'
                                                          }
                                                 },
                                       'Name' => 'struct evconq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69308' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '122',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '68162'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69341'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-122',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69341' => {
                                       'BaseType' => '68162',
                                       'Name' => 'struct evhttp_bound_socket**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69347' => {
                                       'Name' => 'struct evconnlistener',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '69352' => {
                                       'BaseType' => '69347',
                                       'Name' => 'struct evconnlistener*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69358' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '129',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '69428'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69434'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-129',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69391' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '128',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '69358'
                                                          },
                                                   '1' => {
                                                            'name' => 'alias',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_server_alias',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '69428' => {
                                       'BaseType' => '69391',
                                       'Name' => 'struct evhttp_server_alias*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69434' => {
                                       'BaseType' => '69428',
                                       'Name' => 'struct evhttp_server_alias**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69440' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '136',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '69116'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69473'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-136',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69473' => {
                                       'BaseType' => '69116',
                                       'Name' => 'struct evhttp**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69479' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '139',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '68162'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69341'
                                                          }
                                                 },
                                       'Name' => 'struct boundq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69516' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '141',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '69237'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69243'
                                                          }
                                                 },
                                       'Name' => 'struct httpcbq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69553' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '146',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '69116'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69473'
                                                          }
                                                 },
                                       'Name' => 'struct vhostsq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69590' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '69428'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69434'
                                                          }
                                                 },
                                       'Name' => 'struct aliasq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69647' => {
                                       'Name' => 'struct bufferevent*(*)(struct event_base*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3552'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '68881',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '69653' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '69735'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69741'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-39',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69686' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '69653'
                                                          },
                                                   '1' => {
                                                            'name' => 'process',
                                                            'offset' => '16',
                                                            'type' => '69777'
                                                          },
                                                   '2' => {
                                                            'name' => 'process_arg',
                                                            'offset' => '24',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '69735' => {
                                       'BaseType' => '69686',
                                       'Name' => 'struct evrpc_hook*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69741' => {
                                       'BaseType' => '69735',
                                       'Name' => 'struct evrpc_hook**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69777' => {
                                       'Name' => 'int(*)(void*, struct evhttp_request*, struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '67660'
                                                           },
                                                    '2' => {
                                                             'type' => '58107'
                                                           },
                                                    '3' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '69783' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '69735'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69741'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69820' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '69905'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '69911'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_pause_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '69857' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '98',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '70305'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '70354'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_ctx',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '69905' => {
                                       'BaseType' => '69857',
                                       'Name' => 'struct evrpc_hook_ctx*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69911' => {
                                       'BaseType' => '69905',
                                       'Name' => 'struct evrpc_hook_ctx**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '69917' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '60',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_hooks',
                                                            'offset' => '0',
                                                            'type' => '69783'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_hooks',
                                                            'offset' => '16',
                                                            'type' => '69783'
                                                          },
                                                   '2' => {
                                                            'name' => 'pause_requests',
                                                            'offset' => '32',
                                                            'type' => '69820'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hooks_',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '69966' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '67879'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '67885'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70003' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '70220'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '70226'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_requestq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70040' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hook_meta',
                                                            'offset' => '0',
                                                            'type' => '70540'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '70546'
                                                          },
                                                   '10' => {
                                                             'name' => 'reply',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '11' => {
                                                             'name' => 'request_marshal',
                                                             'offset' => '216',
                                                             'type' => '67988'
                                                           },
                                                   '12' => {
                                                             'name' => 'reply_clear',
                                                             'offset' => '224',
                                                             'type' => '3796'
                                                           },
                                                   '13' => {
                                                             'name' => 'reply_unmarshal',
                                                             'offset' => '232',
                                                             'type' => '67960'
                                                           },
                                                   '2' => {
                                                            'name' => 'pool',
                                                            'offset' => '24',
                                                            'type' => '70579'
                                                          },
                                                   '3' => {
                                                            'name' => 'evcon',
                                                            'offset' => '32',
                                                            'type' => '68821'
                                                          },
                                                   '4' => {
                                                            'name' => 'req',
                                                            'offset' => '40',
                                                            'type' => '67660'
                                                          },
                                                   '5' => {
                                                            'name' => 'ev_timeout',
                                                            'offset' => '48',
                                                            'type' => '2982'
                                                          },
                                                   '6' => {
                                                            'name' => 'name',
                                                            'offset' => '176',
                                                            'type' => '201'
                                                          },
                                                   '7' => {
                                                            'name' => 'cb',
                                                            'offset' => '184',
                                                            'type' => '70617'
                                                          },
                                                   '8' => {
                                                            'name' => 'cb_arg',
                                                            'offset' => '192',
                                                            'type' => '183'
                                                          },
                                                   '9' => {
                                                            'name' => 'request',
                                                            'offset' => '200',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_request_wrapper',
                                       'PrivateABI' => 1,
                                       'Size' => '240',
                                       'Type' => 'Struct'
                                     },
                          '70220' => {
                                       'BaseType' => '70040',
                                       'Name' => 'struct evrpc_request_wrapper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70226' => {
                                       'BaseType' => '70220',
                                       'Name' => 'struct evrpc_request_wrapper**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70232' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'common',
                                                            'offset' => '0',
                                                            'type' => '69917'
                                                          },
                                                   '1' => {
                                                            'name' => 'base',
                                                            'offset' => '48',
                                                            'type' => '3552'
                                                          },
                                                   '2' => {
                                                            'name' => 'connections',
                                                            'offset' => '56',
                                                            'type' => '69271'
                                                          },
                                                   '3' => {
                                                            'name' => 'timeout',
                                                            'offset' => '72',
                                                            'type' => '109'
                                                          },
                                                   '4' => {
                                                            'name' => 'requests',
                                                            'offset' => '80',
                                                            'type' => '70003'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_pool',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '70305' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '99',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '69905'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '69911'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-99',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70354' => {
                                       'Name' => 'void(*)(void*, enum EVRPC_HOOK_RESULT)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '67208'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '70360' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '106',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '70454'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '70460'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-106',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70393' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '105',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '70360'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '183'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_size',
                                                            'offset' => '32',
                                                            'type' => '257'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_meta',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '70454' => {
                                       'BaseType' => '70393',
                                       'Name' => 'struct evrpc_meta*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70460' => {
                                       'BaseType' => '70454',
                                       'Name' => 'struct evrpc_meta**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70466' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '113',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '70454'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '70460'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_meta_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70503' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '115',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'meta_data',
                                                            'offset' => '0',
                                                            'type' => '70466'
                                                          },
                                                   '1' => {
                                                            'name' => 'evcon',
                                                            'offset' => '16',
                                                            'type' => '68821'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_meta',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '70540' => {
                                       'BaseType' => '70503',
                                       'Name' => 'struct evrpc_hook_meta*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70546' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '70220'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '70226'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-171',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70579' => {
                                       'BaseType' => '70232',
                                       'Name' => 'struct evrpc_pool*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70611' => {
                                       'BaseType' => '67245',
                                       'Name' => 'struct evrpc_status*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70617' => {
                                       'Name' => 'void(*)(struct evrpc_status*, void*, void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '70611'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           },
                                                    '2' => {
                                                             'type' => '183'
                                                           },
                                                    '3' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '70623' => {
                                       'Header' => 'http_struct.h',
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '67660'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '68870'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http_struct.h-59',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '70656' => {
                                       'BaseType' => '66678',
                                       'Name' => 'struct evkeyvalq*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70662' => {
                                       'Line' => '4480',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'flags',
                                                            'offset' => '0',
                                                            'type' => '59'
                                                          },
                                                   '1' => {
                                                            'name' => 'scheme',
                                                            'offset' => '8',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'userinfo',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '3' => {
                                                            'name' => 'host',
                                                            'offset' => '24',
                                                            'type' => '201'
                                                          },
                                                   '4' => {
                                                            'name' => 'port',
                                                            'offset' => '32',
                                                            'type' => '109'
                                                          },
                                                   '5' => {
                                                            'name' => 'path',
                                                            'offset' => '40',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'query',
                                                            'offset' => '48',
                                                            'type' => '201'
                                                          },
                                                   '7' => {
                                                            'name' => 'fragment',
                                                            'offset' => '56',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_uri',
                                       'PrivateABI' => 1,
                                       'Size' => '64',
                                       'Source' => 'http.c',
                                       'Type' => 'Struct'
                                     },
                          '70667' => {
                                       'BaseType' => '70662',
                                       'Name' => 'struct evhttp_uri*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '70693' => {
                                       'Name' => 'int(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '67660'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '70715' => {
                                       'Name' => 'void(*)(enum evhttp_request_error, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68310'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '72142' => {
                                       'BaseType' => '183',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72148' => {
                                       'BaseType' => '257',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80' => {
                                    'BaseType' => '45',
                                    'Header' => 'types.h',
                                    'Line' => '37',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '84821' => {
                                       'BaseType' => '84832',
                                       'Header' => 'http.h',
                                       'Line' => '163',
                                       'Name' => 'evhttp_bound_socket_foreach_fn',
                                       'Type' => 'Typedef'
                                     },
                          '84832' => {
                                       'Name' => 'void(struct evhttp_bound_socket*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68162'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Type' => 'Func'
                                     },
                          '85280' => {
                                       'BaseType' => '85291',
                                       'Header' => 'bufferevent.h',
                                       'Line' => '135',
                                       'Name' => 'bufferevent_data_cb',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '85291' => {
                                       'Name' => 'void(*)(struct bufferevent*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '85524' => {
                                       'BaseType' => '85535',
                                       'Header' => 'bufferevent.h',
                                       'Line' => '154',
                                       'Name' => 'bufferevent_event_cb',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '85535' => {
                                       'Name' => 'void(*)(struct bufferevent*, short, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           },
                                                    '1' => {
                                                             'type' => '91'
                                                           },
                                                    '2' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '85604' => {
                                       'Header' => 'bufferevent.h',
                                       'Line' => '598',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BEV_NORMAL',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'BEV_FLUSH',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'BEV_FINISHED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum bufferevent_flush_mode',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '86052' => {
                                       'BaseType' => '67282',
                                       'Name' => 'struct evhttp_request const',
                                       'Size' => '216',
                                       'Type' => 'Const'
                                     },
                          '86447' => {
                                       'BaseType' => '66678',
                                       'Name' => 'struct evkeyvalq const',
                                       'Size' => '16',
                                       'Type' => 'Const'
                                     },
                          '86576' => {
                                       'BaseType' => '70662',
                                       'Name' => 'struct evhttp_uri const',
                                       'Size' => '64',
                                       'Type' => 'Const'
                                     },
                          '88531' => {
                                       'Header' => 'bufferevent_struct.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'low',
                                                            'offset' => '0',
                                                            'type' => '257'
                                                          },
                                                   '1' => {
                                                            'name' => 'high',
                                                            'offset' => '8',
                                                            'type' => '257'
                                                          }
                                                 },
                                       'Name' => 'struct event_watermark',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '88568' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '253',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '345'
                                                          },
                                                   '1' => {
                                                            'name' => 'mem_offset',
                                                            'offset' => '8',
                                                            'type' => '235'
                                                          },
                                                   '2' => {
                                                            'name' => 'enable',
                                                            'offset' => '16',
                                                            'type' => '88804'
                                                          },
                                                   '3' => {
                                                            'name' => 'disable',
                                                            'offset' => '24',
                                                            'type' => '88804'
                                                          },
                                                   '4' => {
                                                            'name' => 'unlink',
                                                            'offset' => '32',
                                                            'type' => '88821'
                                                          },
                                                   '5' => {
                                                            'name' => 'destruct',
                                                            'offset' => '40',
                                                            'type' => '88821'
                                                          },
                                                   '6' => {
                                                            'name' => 'adj_timeouts',
                                                            'offset' => '48',
                                                            'type' => '88842'
                                                          },
                                                   '7' => {
                                                            'name' => 'flush',
                                                            'offset' => '56',
                                                            'type' => '88873'
                                                          },
                                                   '8' => {
                                                            'name' => 'ctrl',
                                                            'offset' => '64',
                                                            'type' => '88910'
                                                          }
                                                 },
                                       'Name' => 'struct bufferevent_ops',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '88697' => {
                                       'BaseType' => '88568',
                                       'Name' => 'struct bufferevent_ops const',
                                       'Size' => '72',
                                       'Type' => 'Const'
                                     },
                          '88702' => {
                                       'BaseType' => '88697',
                                       'Name' => 'struct bufferevent_ops const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '88708' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '236',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BEV_CTRL_SET_FD',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'BEV_CTRL_GET_FD',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'BEV_CTRL_GET_UNDERLYING',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'BEV_CTRL_CANCEL_ALL',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum bufferevent_ctrl_op',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '88750' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '244',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'ptr',
                                                            'offset' => '0',
                                                            'type' => '183'
                                                          },
                                                   '1' => {
                                                            'name' => 'fd',
                                                            'offset' => '0',
                                                            'type' => '109'
                                                          }
                                                 },
                                       'Name' => 'union bufferevent_ctrl_data',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Union'
                                     },
                          '88804' => {
                                       'Name' => 'int(*)(struct bufferevent*, short)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           },
                                                    '1' => {
                                                             'type' => '91'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '88821' => {
                                       'Name' => 'void(*)(struct bufferevent*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '88842' => {
                                       'Name' => 'int(*)(struct bufferevent*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '88873' => {
                                       'Name' => 'int(*)(struct bufferevent*, short, enum bufferevent_flush_mode)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           },
                                                    '1' => {
                                                             'type' => '91'
                                                           },
                                                    '2' => {
                                                             'type' => '85604'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '88904' => {
                                       'BaseType' => '88750',
                                       'Name' => 'union bufferevent_ctrl_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '88910' => {
                                       'Name' => 'int(*)(struct bufferevent*, enum bufferevent_ctrl_op, union bufferevent_ctrl_data*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '68881'
                                                           },
                                                    '1' => {
                                                             'type' => '88708'
                                                           },
                                                    '2' => {
                                                             'type' => '88904'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '90729' => {
                                       'BaseType' => '86576',
                                       'Name' => 'struct evhttp_uri const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '91' => {
                                    'Name' => 'short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '98' => {
                                    'BaseType' => '52',
                                    'Header' => 'types.h',
                                    'Line' => '39',
                                    'Name' => '__uint16_t',
                                    'PrivateABI' => 1,
                                    'Size' => '2',
                                    'Type' => 'Typedef'
                                  },
                          '98271' => {
                                       'BaseType' => '86052',
                                       'Name' => 'struct evhttp_request const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libevent_extra-2.1.so.7.0.1' => {
                                                                     'EVUTIL_ISALNUM_' => 0,
                                                                     'EVUTIL_ISALPHA_' => 0,
                                                                     'EVUTIL_ISDIGIT_' => 0,
                                                                     'EVUTIL_ISXDIGIT_' => 0,
                                                                     'EVUTIL_TOLOWER_' => 0,
                                                                     '_ITM_deregisterTMCloneTable' => 0,
                                                                     '_ITM_registerTMCloneTable' => 0,
                                                                     '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                     '__errno_location@GLIBC_2.2.5' => 0,
                                                                     '__gmon_start__' => 0,
                                                                     '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                                     '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                     'bind@GLIBC_2.2.5' => 0,
                                                                     'bufferevent_base_set' => 0,
                                                                     'bufferevent_disable' => 0,
                                                                     'bufferevent_disable_hard_' => 0,
                                                                     'bufferevent_enable' => 0,
                                                                     'bufferevent_free' => 0,
                                                                     'bufferevent_get_base' => 0,
                                                                     'bufferevent_get_input' => 0,
                                                                     'bufferevent_get_options_' => 0,
                                                                     'bufferevent_get_output' => 0,
                                                                     'bufferevent_get_priority' => 0,
                                                                     'bufferevent_getfd' => 0,
                                                                     'bufferevent_set_timeouts' => 0,
                                                                     'bufferevent_setcb' => 0,
                                                                     'bufferevent_setfd' => 0,
                                                                     'bufferevent_socket_connect' => 0,
                                                                     'bufferevent_socket_connect_hostname' => 0,
                                                                     'bufferevent_socket_get_conn_address_' => 0,
                                                                     'bufferevent_socket_new' => 0,
                                                                     'bufferevent_socket_set_conn_address_' => 0,
                                                                     'evbuffer_add' => 0,
                                                                     'evbuffer_add_buffer' => 0,
                                                                     'evbuffer_add_printf' => 0,
                                                                     'evbuffer_drain' => 0,
                                                                     'evbuffer_free' => 0,
                                                                     'evbuffer_freeze' => 0,
                                                                     'evbuffer_get_length' => 0,
                                                                     'evbuffer_new' => 0,
                                                                     'evbuffer_pullup' => 0,
                                                                     'evbuffer_readln' => 0,
                                                                     'evbuffer_remove' => 0,
                                                                     'evbuffer_remove_buffer' => 0,
                                                                     'evbuffer_unfreeze' => 0,
                                                                     'evconnlistener_free' => 0,
                                                                     'evconnlistener_get_fd' => 0,
                                                                     'evconnlistener_new' => 0,
                                                                     'evconnlistener_set_cb' => 0,
                                                                     'event_add' => 0,
                                                                     'event_assign' => 0,
                                                                     'event_debug_logging_mask_' => 0,
                                                                     'event_debug_unassign' => 0,
                                                                     'event_debugx_' => 0,
                                                                     'event_deferred_cb_cancel_' => 0,
                                                                     'event_deferred_cb_init_' => 0,
                                                                     'event_deferred_cb_schedule_' => 0,
                                                                     'event_del' => 0,
                                                                     'event_err' => 0,
