$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.5.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'buffer_compat.h' => 1,
                         'bufferevent.h' => 1,
                         'bufferevent_compat.h' => 1,
                         'bufferevent_struct.h' => 1,
                         'event.h' => 1,
                         'event_compat.h' => 1,
                         'event_struct.h' => 1,
                         'listener.h' => 1,
                         'thread.h' => 1,
                         'util.h' => 1,
                         'watch.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libevent_core-2.2.so.1.0.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'buffer.c' => 1,
                         'bufferevent.c' => 1,
                         'bufferevent_filter.c' => 1,
                         'bufferevent_pair.c' => 1,
                         'bufferevent_ratelim.c' => 1,
                         'bufferevent_sock.c' => 1,
                         'event.c' => 1,
                         'evthread.c' => 1,

                                                           'evutil_rtrim_lws_' => 1,
                                                           'evutil_secure_rng_add_bytes' => 1,
                                                           'evutil_secure_rng_get_bytes' => 1,
                                                           'evutil_secure_rng_global_setup_locks_' => 1,
                                                           'evutil_secure_rng_init' => 1,
                                                           'evutil_secure_rng_set_urandom_device_file' => 1,
                                                           'evutil_set_evdns_getaddrinfo_cancel_fn_' => 1,
                                                           'evutil_set_evdns_getaddrinfo_fn_' => 1,
                                                           'evutil_snprintf' => 1,
                                                           'evutil_sockaddr_cmp' => 1,
                                                           'evutil_sockaddr_is_loopback_' => 1,
                                                           'evutil_socket_' => 1,
                                                           'evutil_socket_connect_' => 1,
                                                           'evutil_socket_finished_connecting_' => 1,
                                                           'evutil_socketpair' => 1,
                                                           'evutil_strtoll' => 1,
                                                           'evutil_tv_to_msec_' => 1,
                                                           'evutil_usleep_' => 1,
                                                           'evutil_v4addr_is_local_' => 1,
                                                           'evutil_v6addr_is_local_' => 1,
                                                           'evutil_vsnprintf' => 1,
                                                           'evutil_weakrand_' => 1,
                                                           'evutil_weakrand_range_' => 1,
                                                           'evutil_weakrand_seed_' => 1,
                                                           'evwatch_base' => 1,
                                                           'evwatch_check_new' => 1,
                                                           'evwatch_free' => 1,
                                                           'evwatch_prepare_get_timeout' => 1,
                                                           'evwatch_prepare_new' => 1,
                                                           'libevent_global_shutdown' => 1,
                                                           'nil_eventop' => -64,
                                                           'pollops' => -64,
                                                           'selectops' => -64
                                                         }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '108' => {
                                     'BaseType' => '57',
                                     'Header' => 'types.h',
                                     'Line' => '39',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '108173' => {
                                        'BaseType' => '64',
                                        'Header' => 'types.h',
                                        'Line' => '197',
                                        'Name' => '__socklen_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '108990' => {
                                        'BaseType' => '108173',
                                        'Header' => 'unistd.h',
                                        'Line' => '277',
                                        'Name' => 'socklen_t',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '110181' => {
                                        'Header' => 'netdb.h',
                                        'Line' => '565',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ai_flags',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'ai_family',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'ai_socktype',
                                                             'offset' => '8',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'ai_protocol',
                                                             'offset' => '12',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'ai_addrlen',
                                                             'offset' => '16',
                                                             'type' => '108990'
                                                           },
                                                    '5' => {
                                                             'name' => 'ai_addr',
                                                             'offset' => '24',
                                                             'type' => '754'
                                                           },
                                                    '6' => {
                                                             'name' => 'ai_canonname',
                                                             'offset' => '32',
                                                             'type' => '370'
                                                           },
                                                    '7' => {
                                                             'name' => 'ai_next',
                                                             'offset' => '40',
                                                             'type' => '110304'
                                                           }
                                                  },
                                        'Name' => 'struct addrinfo',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '110299' => {
                                        'BaseType' => '110181',
                                        'Name' => 'struct addrinfo const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '110304' => {
                                        'BaseType' => '110181',
                                        'Name' => 'struct addrinfo*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110310' => {
                                        'BaseType' => '110299',
                                        'Name' => 'struct addrinfo const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112044' => {
                                        'BaseType' => '112050',
                                        'Name' => 'struct evdns_base*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '112050' => {
                                        'Name' => 'struct evdns_base',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '1144' => {
                                      'BaseType' => '727',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '119' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '122048' => {
                                        'BaseType' => '1534',
                                        'Header' => 'FILE.h',
                                        'Line' => '7',
                                        'Name' => 'FILE',
                                        'PrivateABI' => 1,
                                        'Size' => '216',
                                        'Type' => 'Typedef'
                                      },
                          '123711' => {
                                        'BaseType' => '4168',
                                        'Header' => 'event.h',
                                        'Line' => '1027',
                                        'Name' => 'event_callback_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '123750' => {
                                        'BaseType' => '4195',
                                        'Header' => 'event.h',
                                        'Line' => '1159',
                                        'Name' => 'event_finalize_callback_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '123899' => {
                                        'BaseType' => '4223',
                                        'Name' => 'struct event const',
                                        'Size' => '120',
                                        'Type' => 'Const'
                                      },
                          '123904' => {
                                        'BaseType' => '123916',
                                        'Header' => 'event.h',
                                        'Line' => '1603',
                                        'Name' => 'event_base_foreach_event_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '123916' => {
                                        'Name' => 'int(*)(struct event_base const*, struct event const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '123947'
                                                            },
                                                     '1' => {
                                                              'type' => '124596'
                                                            },
                                                     '2' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '123947' => {
                                        'BaseType' => '124591',
                                        'Name' => 'struct event_base const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '124591' => {
                                        'BaseType' => '4332',
                                        'Name' => 'struct event_base const',
                                        'Size' => '688',
                                        'Type' => 'Const'
                                      },
                          '124596' => {
                                        'BaseType' => '123899',
                                        'Name' => 'struct event const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126443' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '401',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '126519'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '126525'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-event-internal.h-401',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '126479' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '400',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '126443'
                                                           },
                                                    '1' => {
                                                             'name' => 'avoid_method',
                                                             'offset' => '16',
                                                             'type' => '2162'
                                                           }
                                                  },
                                        'Name' => 'struct event_config_entry',
                                        'PrivateABI' => 1,
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '126519' => {
                                        'BaseType' => '126479',
                                        'Name' => 'struct event_config_entry*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126525' => {
                                        'BaseType' => '126519',
                                        'Name' => 'struct event_config_entry**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126531' => {
                                        'Header' => 'event-internal.h',
                                        'Line' => '409',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqh_first',
                                                             'offset' => '0',
                                                             'type' => '126519'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqh_last',
                                                             'offset' => '8',
                                                             'type' => '126525'
                                                           }
                                                  },
                                        'Name' => 'struct event_configq',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '126571' => {
                                        'Header' => 'event.h',
                                        'Line' => '408',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'entries',
                                                             'offset' => '0',
                                                             'type' => '126531'
                                                           },
                                                    '1' => {
                                                             'name' => 'n_cpus_hint',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '2' => {
                                                             'name' => 'max_dispatch_interval',
                                                             'offset' => '24',
                                                             'type' => '501'
                                                           },
                                                    '3' => {
                                                             'name' => 'max_dispatch_callbacks',
                                                             'offset' => '40',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'limit_callbacks_after_prio',
                                                             'offset' => '44',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'require_features',
                                                             'offset' => '48',
                                                             'type' => '4047'
                                                           },
                                                    '6' => {
                                                             'name' => 'flags',
                                                             'offset' => '52',
                                                             'type' => '4090'
                                                           }
                                                  },
                                        'Name' => 'struct event_config',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '126676' => {
                                        'BaseType' => '126571',
                                        'Name' => 'struct event_config const',
                                        'Size' => '56',
                                        'Type' => 'Const'
                                      },
                          '127525' => {
                                        'Name' => 'void*(*)(size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '421'
                                                            }
                                                   },
                                        'Return' => '319',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '127573' => {
                                        'Name' => 'void*(*)(void*, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '319'
                                                            },
                                                     '1' => {
                                                              'type' => '421'
                                                            }
                                                   },
                                        'Return' => '319',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1287' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '131' => {
                                     'BaseType' => '64',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '131674' => {
                                        'BaseType' => '122048',
                                        'Name' => 'FILE*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '43',
                                     'Name' => '__int64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '14468' => {
                                       'BaseType' => '1954',
                                       'Name' => 'struct __va_list_tag*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '145325' => {
                                        'BaseType' => '6567',
                                        'Name' => 'struct event_base**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '145337' => {
                                        'BaseType' => '123711',
                                        'Name' => 'event_callback_fn*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '14671' => {
                                       'BaseType' => '5003',
                                       'Name' => 'struct evbuffer_ptr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15120' => {
                                       'BaseType' => '5040',
                                       'Name' => 'struct evbuffer_ptr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '15126' => {
                                       'BaseType' => '52',
                                       'Name' => 'unsigned char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '153' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1534' => {
                                      'Header' => 'libio.h',
                                      'Line' => '245',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_flags',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => '_IO_read_ptr',
                                                           'offset' => '8',
                                                           'type' => '370'
                                                         },
                                                  '10' => {
                                                            'name' => '_IO_backup_base',
                                                            'offset' => '80',
                                                            'type' => '370'
                                                          },
                                                  '11' => {
                                                            'name' => '_IO_save_end',
                                                            'offset' => '88',
                                                            'type' => '370'
                                                          },
                                                  '12' => {
                                                            'name' => '_markers',
                                                            'offset' => '96',
                                                            'type' => '2071'
                                                          },
                                                  '13' => {
                                                            'name' => '_chain',
                                                            'offset' => '104',
                                                            'type' => '2077'
                                                          },
                                                  '14' => {
                                                            'name' => '_fileno',
                                                            'offset' => '112',
                                                            'type' => '119'
                                                          },
                                                  '15' => {
                                                            'name' => '_flags2',
                                                            'offset' => '116',
                                                            'type' => '119'
                                                          },
                                                  '16' => {
                                                            'name' => '_old_offset',
                                                            'offset' => '120',
                                                            'type' => '237'
                                                          },
                                                  '17' => {
                                                            'name' => '_cur_column',
                                                            'offset' => '128',
                                                            'type' => '57'
                                                          },
                                                  '18' => {
                                                            'name' => '_vtable_offset',
                                                            'offset' => '130',
                                                            'type' => '83'
                                                          },
                                                  '19' => {
                                                            'name' => '_shortbuf',
                                                            'offset' => '131',
                                                            'type' => '2083'
                                                          },
                                                  '2' => {
                                                           'name' => '_IO_read_end',
                                                           'offset' => '16',
                                                           'type' => '370'
                                                         },
                                                  '20' => {
                                                            'name' => '_lock',
                                                            'offset' => '136',
                                                            'type' => '2099'
                                                          },
                                                  '21' => {
                                                            'name' => '_offset',
                                                            'offset' => '144',
                                                            'type' => '248'
                                                          },
                                                  '22' => {
                                                            'name' => '__pad1',
                                                            'offset' => '152',
                                                            'type' => '319'
                                                          },
                                                  '23' => {
                                                            'name' => '__pad2',
                                                            'offset' => '160',
                                                            'type' => '319'
                                                          },
                                                  '24' => {
                                                            'name' => '__pad3',
                                                            'offset' => '168',
                                                            'type' => '319'
                                                          },
                                                  '25' => {
                                                            'name' => '__pad4',
                                                            'offset' => '176',
                                                            'type' => '319'
                                                          },
                                                  '26' => {
                                                            'name' => '__pad5',
                                                            'offset' => '184',
                                                            'type' => '421'
                                                          },
                                                  '27' => {
                                                            'name' => '_mode',
                                                            'offset' => '192',
                                                            'type' => '119'
                                                          },
                                                  '28' => {
                                                            'name' => '_unused2',
                                                            'offset' => '196',
                                                            'type' => '2105'
                                                          },
                                                  '3' => {
                                                           'name' => '_IO_read_base',
                                                           'offset' => '24',
                                                           'type' => '370'
                                                         },
                                                  '4' => {
                                                           'name' => '_IO_write_base',
                                                           'offset' => '32',
                                                           'type' => '370'
                                                         },
                                                  '5' => {
                                                           'name' => '_IO_write_ptr',
                                                           'offset' => '40',
                                                           'type' => '370'
                                                         },
                                                  '6' => {
                                                           'name' => '_IO_write_end',
                                                           'offset' => '48',
                                                           'type' => '370'
                                                         },
                                                  '7' => {
                                                           'name' => '_IO_buf_base',
                                                           'offset' => '56',
                                                           'type' => '370'
                                                         },
                                                  '8' => {
                                                           'name' => '_IO_buf_end',
                                                           'offset' => '64',
                                                           'type' => '370'
                                                         },
                                                  '9' => {
                                                           'name' => '_IO_save_base',
                                                           'offset' => '72',
                                                           'type' => '370'
                                                         }
                                                },
                                      'Name' => 'struct _IO_FILE',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '15613' => {
                                       'BaseType' => '5738',
                                       'Name' => 'struct evbuffer const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '156967' => {
                                        'BaseType' => '126571',
                                        'Name' => 'struct event_config*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '157715' => {
                                        'BaseType' => '2162',
                                        'Name' => 'char const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '160' => {
                                     'BaseType' => '76',
                                     'Header' => 'types.h',
                                     'Line' => '44',
                                     'Name' => '__uint64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '161643' => {
                                        'BaseType' => '126676',
                                        'Name' => 'struct event_config const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182' => {
                                     'BaseType' => '64',
                                     'Header' => 'types.h',
                                     'Line' => '134',
                                     'Name' => '__uid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '184582' => {
                                        'BaseType' => '6787',
                                        'Name' => 'struct evthread_lock_callbacks const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '184750' => {
                                        'BaseType' => '6941',
                                        'Name' => 'struct evthread_condition_callbacks const',
                                        'Size' => '40',
                                        'Type' => 'Const'
                                      },
                          '190776' => {
                                        'BaseType' => '184750',
                                        'Name' => 'struct evthread_condition_callbacks const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '191092' => {
                                        'BaseType' => '184582',
                                        'Name' => 'struct evthread_lock_callbacks const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1954' => {
                                      'Header' => '<built-in>',
                                      'Line' => '0',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'gp_offset',
                                                           'offset' => '0',
                                                           'type' => '64'
                                                         },
                                                  '1' => {
                                                           'name' => 'fp_offset',
                                                           'offset' => '4',
                                                           'type' => '64'
                                                         },
                                                  '2' => {
                                                           'name' => 'overflow_arg_area',
                                                           'offset' => '8',
                                                           'type' => '319'
                                                         },
                                                  '3' => {
                                                           'name' => 'reg_save_area',
                                                           'offset' => '16',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'struct __va_list_tag',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '2015' => {
                                      'BaseType' => '1',
                                      'Header' => 'libio.h',
                                      'Line' => '154',
                                      'Name' => '_IO_lock_t',
                                      'PrivateABI' => 1,
                                      'Type' => 'Typedef'
                                    },
                          '202062' => {
                                        'BaseType' => '64',
                                        'Name' => 'unsigned int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2022' => {
                                      'Header' => 'libio.h',
                                      'Line' => '160',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_next',
                                                           'offset' => '0',
                                                           'type' => '2071'
                                                         },
                                                  '1' => {
                                                           'name' => '_sbuf',
                                                           'offset' => '8',
                                                           'type' => '2077'
                                                         },
                                                  '2' => {
                                                           'name' => '_pos',
                                                           'offset' => '16',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'struct _IO_marker',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '204363' => {
                                        'BaseType' => '110304',
                                        'Name' => 'struct addrinfo**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2071' => {
                                      'BaseType' => '2022',
                                      'Name' => 'struct _IO_marker*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2077' => {
                                      'BaseType' => '1534',
                                      'Name' => 'struct _IO_FILE*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2083' => {
                                      'BaseType' => '376',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '2099' => {
                                      'BaseType' => '2015',
                                      'Name' => '_IO_lock_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2105' => {
                                      'BaseType' => '376',
                                      'Name' => 'char[20]',
                                      'Size' => '20',
                                      'Type' => 'Array'
                                    },
                          '2162' => {
                                      'BaseType' => '383',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '220609' => {
                                        'Header' => 'struct_tm.h',
                                        'Line' => '7',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tm_sec',
                                                             'offset' => '0',
                                                             'type' => '119'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_min',
                                                             'offset' => '4',
                                                             'type' => '119'
                                                           },
                                                    '10' => {
                                                              'name' => 'tm_zone',
                                                              'offset' => '48',
                                                              'type' => '2162'
                                                            },
                                                    '2' => {
                                                             'name' => 'tm_hour',
                                                             'offset' => '8',
                                                             'type' => '119'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_mday',
                                                             'offset' => '12',
                                                             'type' => '119'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_mon',
                                                             'offset' => '16',
                                                             'type' => '119'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_year',
                                                             'offset' => '20',
                                                             'type' => '119'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_wday',
                                                             'offset' => '24',
                                                             'type' => '119'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_yday',
                                                             'offset' => '28',
                                                             'type' => '119'
                                                           },
                                                    '8' => {
                                                             'name' => 'tm_isdst',
                                                             'offset' => '32',
                                                             'type' => '119'
                                                           },
                                                    '9' => {
                                                             'name' => 'tm_gmtoff',
                                                             'offset' => '40',
                                                             'type' => '153'
                                                           }
                                                  },
                                        'Name' => 'struct tm',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '220753' => {
                                        'BaseType' => '220609',
                                        'Name' => 'struct tm const',
                                        'Size' => '56',
                                        'Type' => 'Const'
                                      },
                          '222607' => {
                                        'BaseType' => '7105',
                                        'Name' => 'struct evutil_monotonic_timer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '223529' => {
                                        'BaseType' => '220753',
                                        'Name' => 'struct tm const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2277' => {
                                      'BaseType' => '2288',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2288' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '2301' => {
                                      'BaseType' => '370',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '232782' => {
                                        'BaseType' => '232793',
                                        'Header' => 'listener.h',
                                        'Line' => '51',
                                        'Name' => 'evconnlistener_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '232793' => {
                                        'Name' => 'void(*)(struct evconnlistener*, int, struct sockaddr*, int, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '232830'
                                                            },
                                                     '1' => {
                                                              'type' => '119'
                                                            },
                                                     '2' => {
                                                              'type' => '754'
                                                            },
                                                     '3' => {
                                                              'type' => '119'
                                                            },
                                                     '4' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '232830' => {
                                        'BaseType' => '232836',
                                        'Name' => 'struct evconnlistener*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '232836' => {
                                        'Line' => '79',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ops',
                                                             'offset' => '0',
                                                             'type' => '233976'
                                                           },
                                                    '1' => {
                                                             'name' => 'lock',
                                                             'offset' => '8',
                                                             'type' => '319'
                                                           },
                                                    '2' => {
                                                             'name' => 'cb',
                                                             'offset' => '16',
                                                             'type' => '232782'
                                                           },
                                                    '3' => {
                                                             'name' => 'errorcb',
                                                             'offset' => '24',
                                                             'type' => '232959'
                                                           },
                                                    '4' => {
                                                             'name' => 'user_data',
                                                             'offset' => '32',
                                                             'type' => '319'
                                                           },
                                                    '5' => {
                                                             'name' => 'flags',
                                                             'offset' => '40',
                                                             'type' => '64'
                                                           },
                                                    '6' => {
                                                             'name' => 'refcnt',
                                                             'offset' => '44',
                                                             'type' => '101'
                                                           },
                                                    '7' => {
                                                             'name' => 'accept4_flags',
                                                             'offset' => '48',
                                                             'type' => '119'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '1',
                                                             'name' => 'enabled',
                                                             'offset' => '52',
                                                             'type' => '64'
                                                           }
                                                  },
                                        'Name' => 'struct evconnlistener',
                                        'PrivateABI' => 1,
                                        'Size' => '56',
                                        'Source' => 'listener.c',
                                        'Type' => 'Struct'
                                      },
                          '232959' => {
                                        'BaseType' => '232970',
                                        'Header' => 'listener.h',
                                        'Line' => '59',
                                        'Name' => 'evconnlistener_errorcb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '232970' => {
                                        'Name' => 'void(*)(struct evconnlistener*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '232830'
                                                            },
                                                     '1' => {
                                                              'type' => '319'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '233827' => {
                                        'Line' => '70',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'enable',
                                                             'offset' => '0',
                                                             'type' => '233932'
                                                           },
                                                    '1' => {
                                                             'name' => 'disable',
                                                             'offset' => '8',
                                                             'type' => '233932'
                                                           },
                                                    '2' => {
                                                             'name' => 'destroy',
                                                             'offset' => '16',
                                                             'type' => '233949'
                                                           },
                                                    '3' => {
                                                             'name' => 'shutdown',
                                                             'offset' => '24',
                                                             'type' => '233949'
                                                           },
                                                    '4' => {
                                                             'name' => 'getfd',
                                                             'offset' => '32',
                                                             'type' => '233932'
                                                           },
                                                    '5' => {
                                                             'name' => 'getbase',
                                                             'offset' => '40',
                                                             'type' => '233970'
                                                           }
                                                  },
                                        'Name' => 'struct evconnlistener_ops',
                                        'PrivateABI' => 1,
                                        'Size' => '48',
                                        'Source' => 'listener.c',
                                        'Type' => 'Struct'
                                      },
                          '233912' => {
                                        'BaseType' => '233827',
                                        'Name' => 'struct evconnlistener_ops const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '233932' => {
                                        'Name' => 'int(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '232830'
                                                            }
                                                   },
                                        'Return' => '119',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '233949' => {
                                        'Name' => 'void(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '232830'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '233970' => {
                                        'Name' => 'struct event_base*(*)(struct evconnlistener*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '232830'
                                                            }
                                                   },
                                        'Return' => '6567',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '233976' => {
                                        'BaseType' => '233912',
                                        'Name' => 'struct evconnlistener_ops const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '237' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '140',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '239476' => {
                                        'BaseType' => '239488',
                                        'Header' => 'event.h',
                                        'Line' => '734',
                                        'Name' => 'event_log_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '239488' => {
                                        'Name' => 'void(*)(int, char const*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '119'
                                                            },
                                                     '1' => {
                                                              'type' => '2162'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '239510' => {
                                        'BaseType' => '4151',
                                        'Header' => 'event.h',
                                        'Line' => '753',
                                        'Name' => 'event_fatal_cb',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '248' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '141',
                                     'Name' => '__off64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '24899' => {
                                       'BaseType' => '421',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '259' => {
                                     'BaseType' => '119',
                                     'Header' => 'types.h',
                                     'Line' => '142',
                                     'Name' => '__pid_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '270' => {
                                     'BaseType' => '119',
                                     'Name' => 'int[2]',
                                     'Size' => '8',
                                     'Type' => 'Array'
                                   },
                          '286' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '144',
                                     'Name' => '__clock_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '297' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '148',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '308' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '150',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '319' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '348' => {
                                     'BaseType' => '153',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3667' => {
                                      'BaseType' => '90',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '3678' => {
                                      'BaseType' => '108',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '3689' => {
                                      'BaseType' => '131',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '370' => {
                                     'BaseType' => '376',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3700' => {
                                      'BaseType' => '160',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '27',
                                      'Name' => 'uint64_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3718' => {
                                      'BaseType' => '3689',
                                      'Header' => 'in.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3729' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '3718'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3754' => {
                                      'BaseType' => '3678',
                                      'Header' => 'in.h',
                                      'Line' => '119',
                                      'Name' => 'in_port_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '376' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3765' => {
                                      'Header' => 'in.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '3807'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '3823'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '3839'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-213',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '3807' => {
                                      'BaseType' => '3667',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '3823' => {
                                      'BaseType' => '3678',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '383' => {
                                     'BaseType' => '376',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '3839' => {
                                      'BaseType' => '3689',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '3855' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '3765'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '388' => {
                                     'BaseType' => '237',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3907' => {
                                      'Header' => '__sigval_t.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sival_int',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'sival_ptr',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'union sigval',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3942' => {
                                      'BaseType' => '3907',
                                      'Header' => '__sigval_t.h',
                                      'Line' => '30',
                                      'Name' => '__sigval_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '399' => {
                                     'BaseType' => '348',
                                     'Header' => 'types.h',
                                     'Line' => '109',
                                     'Name' => 'ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4047' => {
                                      'Header' => 'event.h',
                                      'Line' => '501',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EV_FEATURE_ET',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'EV_FEATURE_O1',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'EV_FEATURE_FDS',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'EV_FEATURE_EARLY_CLOSE',
                                                           'value' => '8'
                                                         }
                                                },
                                      'Name' => 'enum event_method_feature',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4090' => {
                                      'Header' => 'event.h',
                                      'Line' => '529',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EVENT_BASE_FLAG_NOLOCK',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'EVENT_BASE_FLAG_IGNORE_ENV',
                                                           'value' => '2'
                                                         },
                                                  '2' => {
                                                           'name' => 'EVENT_BASE_FLAG_STARTUP_IOCP',
                                                           'value' => '4'
                                                         },
                                                  '3' => {
                                                           'name' => 'EVENT_BASE_FLAG_NO_CACHE_TIME',
                                                           'value' => '8'
                                                         },
                                                  '4' => {
                                                           'name' => 'EVENT_BASE_FLAG_EPOLL_USE_CHANGELIST',
                                                           'value' => '16'
                                                         },
                                                  '5' => {
                                                           'name' => 'EVENT_BASE_FLAG_PRECISE_TIMER',
                                                           'value' => '32'
                                                         },
                                                  '6' => {
                                                           'name' => 'EVENT_BASE_FLAG_EPOLL_DISALLOW_TIMERFD',
                                                           'value' => '64'
                                                         }
                                                },
                                      'Name' => 'enum event_base_config_flag',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '410' => {
                                     'BaseType' => '297',
                                     'Header' => 'time_t.h',
                                     'Line' => '7',
                                     'Name' => 'time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4151' => {
                                      'Name' => 'void(*)(int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '119'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4168' => {
                                      'Name' => 'void(*)(int, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '119'
                                                          },
                                                   '1' => {
                                                            'type' => '101'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4195' => {
                                      'Name' => 'void(*)(struct event*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4217'
                                                          },
                                                   '1' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '421' => {
                                     'BaseType' => '76',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4217' => {
                                      'BaseType' => '4223',
                                      'Name' => 'struct event*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4223' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '123',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_evcallback',
                                                           'offset' => '0',
                                                           'type' => '6144'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout_pos',
                                                           'offset' => '40',
                                                           'type' => '6355'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_fd',
                                                           'offset' => '56',
                                                           'type' => '119'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_events',
                                                           'offset' => '60',
                                                           'type' => '101'
                                                         },
                                                  '4' => {
                                                           'name' => 'ev_res',
                                                           'offset' => '62',
                                                           'type' => '101'
                                                         },
                                                  '5' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '64',
                                                           'type' => '6567'
                                                         },
                                                  '6' => {
                                                           'name' => 'ev_',
                                                           'offset' => '72',
                                                           'type' => '6536'
                                                         },
                                                  '7' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '104',
                                                           'type' => '501'
                                                         }
                                                },
                                      'Name' => 'struct event',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '432' => {
                                     'BaseType' => '421',
                                     'Name' => 'size_t const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '4332' => {
                                      'Header' => 'event.h',
                                      'Line' => '255',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evsel',
                                                           'offset' => '0',
                                                           'type' => '9693'
                                                         },
                                                  '1' => {
                                                           'name' => 'evbase',
                                                           'offset' => '8',
                                                           'type' => '319'
                                                         },
                                                  '10' => {
                                                            'name' => 'event_count_active_max',
                                                            'offset' => '212',
                                                            'type' => '119'
                                                          },
                                                  '11' => {
                                                            'name' => 'event_gotterm',
                                                            'offset' => '216',
                                                            'type' => '119'
                                                          },
                                                  '12' => {
                                                            'name' => 'event_break',
                                                            'offset' => '220',
                                                            'type' => '119'
                                                          },
                                                  '13' => {
                                                            'name' => 'event_continue',
                                                            'offset' => '224',
                                                            'type' => '119'
                                                          },
                                                  '14' => {
                                                            'name' => 'event_running_priority',
                                                            'offset' => '228',
                                                            'type' => '119'
                                                          },
                                                  '15' => {
                                                            'name' => 'running_loop',
                                                            'offset' => '232',
                                                            'type' => '119'
                                                          },
                                                  '16' => {
                                                            'name' => 'n_deferreds_queued',
                                                            'offset' => '236',
                                                            'type' => '119'
                                                          },
                                                  '17' => {
                                                            'name' => 'activequeues',
                                                            'offset' => '240',
                                                            'type' => '9699'
                                                          },
                                                  '18' => {
                                                            'name' => 'nactivequeues',
                                                            'offset' => '248',
                                                            'type' => '119'
                                                          },
                                                  '19' => {
                                                            'name' => 'active_later_queue',
                                                            'offset' => '256',
                                                            'type' => '9414'
                                                          },
                                                  '2' => {
                                                           'name' => 'changelist',
                                                           'offset' => '16',
                                                           'type' => '9343'
                                                         },
                                                  '20' => {
                                                            'name' => 'common_timeout_queues',
                                                            'offset' => '272',
                                                            'type' => '9705'
                                                          },
                                                  '21' => {
                                                            'name' => 'n_common_timeouts',
                                                            'offset' => '280',
                                                            'type' => '119'
                                                          },
                                                  '22' => {
                                                            'name' => 'n_common_timeouts_allocated',
                                                            'offset' => '284',
                                                            'type' => '119'
                                                          },
                                                  '23' => {
                                                            'name' => 'io',
                                                            'offset' => '288',
                                                            'type' => '9239'
                                                          },
                                                  '24' => {
                                                            'name' => 'sigmap',
                                                            'offset' => '304',
                                                            'type' => '9239'
                                                          },
                                                  '25' => {
                                                            'name' => 'timeheap',
                                                            'offset' => '320',
                                                            'type' => '8102'
                                                          },
                                                  '26' => {
                                                            'name' => 'tv_cache',
                                                            'offset' => '344',
                                                            'type' => '501'
                                                          },
                                                  '27' => {
                                                            'name' => 'monotonic_timer',
                                                            'offset' => '360',
                                                            'type' => '7105'
                                                          },
                                                  '28' => {
                                                            'name' => 'tv_clock_diff',
                                                            'offset' => '400',
                                                            'type' => '501'
                                                          },
                                                  '29' => {
                                                            'name' => 'last_updated_clock_diff',
                                                            'offset' => '416',
                                                            'type' => '410'
                                                          },
                                                  '3' => {
                                                           'name' => 'evsigsel',
                                                           'offset' => '32',
                                                           'type' => '9693'
                                                         },
                                                  '30' => {
                                                            'name' => 'th_owner_id',
                                                            'offset' => '424',
                                                            'type' => '76'
                                                          },
                                                  '31' => {
                                                            'name' => 'th_base_lock',
                                                            'offset' => '432',
                                                            'type' => '319'
                                                          },
                                                  '32' => {
                                                            'name' => 'current_event_cond',
                                                            'offset' => '440',
                                                            'type' => '319'
                                                          },
                                                  '33' => {
                                                            'name' => 'current_event_waiters',
                                                            'offset' => '448',
                                                            'type' => '119'
                                                          },
                                                  '34' => {
                                                            'name' => 'current_event',
                                                            'offset' => '456',
                                                            'type' => '6229'
                                                          },
                                                  '35' => {
                                                            'name' => 'flags',
                                                            'offset' => '464',
                                                            'type' => '4090'
                                                          },
                                                  '36' => {
                                                            'name' => 'max_dispatch_time',
                                                            'offset' => '472',
                                                            'type' => '501'
                                                          },
                                                  '37' => {
                                                            'name' => 'max_dispatch_callbacks',
                                                            'offset' => '488',
                                                            'type' => '119'
                                                          },
                                                  '38' => {
                                                            'name' => 'limit_callbacks_after_prio',
                                                            'offset' => '492',
                                                            'type' => '119'
                                                          },
                                                  '39' => {
                                                            'name' => 'is_notify_pending',
                                                            'offset' => '496',
                                                            'type' => '119'
                                                          },
                                                  '4' => {
                                                           'name' => 'sig',
                                                           'offset' => '40',
                                                           'type' => '8905'
                                                         },
                                                  '40' => {
                                                            'name' => 'th_notify_fd',
                                                            'offset' => '500',
                                                            'type' => '270'
                                                          },
                                                  '41' => {
                                                            'name' => 'th_notify',
                                                            'offset' => '512',
                                                            'type' => '4223'
                                                          },
                                                  '42' => {
                                                            'name' => 'th_notify_fn',
                                                            'offset' => '632',
                                                            'type' => '9732'
                                                          },
                                                  '43' => {
                                                            'name' => 'weakrand_seed',
                                                            'offset' => '640',
                                                            'type' => '7154'
                                                          },
                                                  '44' => {
                                                            'name' => 'once_events',
                                                            'offset' => '648',
                                                            'type' => '9666'
                                                          },
                                                  '45' => {
                                                            'name' => 'watchers',
                                                            'offset' => '656',
                                                            'type' => '9738'
                                                          },
                                                  '5' => {
                                                           'name' => 'virtual_event_count',
                                                           'offset' => '192',
                                                           'type' => '119'
                                                         },
                                                  '6' => {
                                                           'name' => 'virtual_event_count_max',
                                                           'offset' => '196',
                                                           'type' => '119'
                                                         },
                                                  '7' => {
                                                           'name' => 'event_count',
                                                           'offset' => '200',
                                                           'type' => '119'
                                                         },
                                                  '8' => {
                                                           'name' => 'event_count_max',
                                                           'offset' => '204',
                                                           'type' => '119'
                                                         },
                                                  '9' => {
                                                           'name' => 'event_count_active',
                                                           'offset' => '208',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'struct event_base',
                                      'Size' => '688',
                                      'Type' => 'Struct'
                                    },
                          '437' => {
                                     'BaseType' => '142',
                                     'Header' => 'stdint-intn.h',
                                     'Line' => '27',
                                     'Name' => 'int64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '474' => {
                                     'BaseType' => '76',
                                     'Name' => 'unsigned long[16]',
                                     'Size' => '128',
                                     'Type' => 'Array'
                                   },
                          '490' => {
                                     'Header' => '__sigset_t.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__val',
                                                          'offset' => '0',
                                                          'type' => '474'
                                                        }
                                               },
                                     'Name' => 'struct __sigset_t',
                                     'PrivateABI' => 1,
                                     'Size' => '128',
                                     'Type' => 'Struct'
                                   },
                          '4970' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '121',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'chain',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => 'pos_in_chain',
                                                           'offset' => '8',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'anon-struct-buffer.h-121',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '5003' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '116',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pos',
                                                           'offset' => '0',
                                                           'type' => '399'
                                                         },
                                                  '1' => {
                                                           'name' => 'internal_',
                                                           'offset' => '8',
                                                           'type' => '4970'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_ptr',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '501' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '297'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '308'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '5040' => {
                                      'BaseType' => '5003',
                                      'Name' => 'struct evbuffer_ptr const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '5045' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '423',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EVBUFFER_EOL_ANY',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'EVBUFFER_EOL_CRLF',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'EVBUFFER_EOL_CRLF_STRICT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'EVBUFFER_EOL_LF',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'EVBUFFER_EOL_NUL',
                                                           'value' => '4'
                                                         }
                                                },
                                      'Name' => 'enum evbuffer_eol_style',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '5094' => {
                                      'BaseType' => '5106',
                                      'Header' => 'buffer.h',
                                      'Line' => '501',
                                      'Name' => 'evbuffer_ref_cleanup_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5106' => {
                                      'Name' => 'void(*)(void const*, size_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2277'
                                                          },
                                                   '1' => {
                                                            'type' => '421'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5133' => {
                                      'BaseType' => '5145',
                                      'Header' => 'buffer.h',
                                      'Line' => '595',
                                      'Name' => 'evbuffer_file_segment_cleanup_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5145' => {
                                      'Name' => 'void(*)(struct evbuffer_file_segment const*, int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5172'
                                                          },
                                                   '1' => {
                                                            'type' => '119'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5172' => {
                                      'BaseType' => '5358',
                                      'Name' => 'struct evbuffer_file_segment const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5178' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '237',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lock',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '8',
                                                           'type' => '119'
                                                         },
                                                  '10' => {
                                                            'name' => 'length',
                                                            'offset' => '56',
                                                            'type' => '437'
                                                          },
                                                  '11' => {
                                                            'name' => 'cleanup_cb',
                                                            'offset' => '64',
                                                            'type' => '5133'
                                                          },
                                                  '12' => {
                                                            'name' => 'cleanup_cb_arg',
                                                            'offset' => '72',
                                                            'type' => '319'
                                                          },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '12',
                                                           'type' => '64'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'can_sendfile',
                                                           'offset' => '16',
                                                           'type' => '64'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'is_mapping',
                                                           'offset' => '16',
                                                           'type' => '64'
                                                         },
                                                  '5' => {
                                                           'name' => 'fd',
                                                           'offset' => '20',
                                                           'type' => '119'
                                                         },
                                                  '6' => {
                                                           'name' => 'mapping',
                                                           'offset' => '24',
                                                           'type' => '319'
                                                         },
                                                  '7' => {
                                                           'name' => 'contents',
                                                           'offset' => '32',
                                                           'type' => '370'
                                                         },
                                                  '8' => {
                                                           'name' => 'file_offset',
                                                           'offset' => '40',
                                                           'type' => '437'
                                                         },
                                                  '9' => {
                                                           'name' => 'mmap_offset',
                                                           'offset' => '48',
                                                           'type' => '437'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_file_segment',
                                      'PrivateABI' => 1,
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '52' => {
                                    'BaseType' => '45',
                                    'Name' => 'unsigned char const',
                                    'Size' => '1',
                                    'Type' => 'Const'
                                  },
                          '52250' => {
                                       'BaseType' => '5831',
                                       'Name' => 'struct bufferevent const',
                                       'Size' => '376',
                                       'Type' => 'Const'
                                     },
                          '52293' => {
                                       'Header' => 'bufferevent.h',
                                       'Line' => '158',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BEV_OPT_CLOSE_ON_FREE',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'BEV_OPT_THREADSAFE',
                                                            'value' => '2'
                                                          },
                                                   '2' => {
                                                            'name' => 'BEV_OPT_DEFER_CALLBACKS',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'BEV_OPT_UNLOCK_CALLBACKS',
                                                            'value' => '8'
                                                          }
                                                 },
                                       'Name' => 'enum bufferevent_options',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '5358' => {
                                      'BaseType' => '5178',
                                      'Name' => 'struct evbuffer_file_segment const',
                                      'Size' => '80',
                                      'Type' => 'Const'
                                    },
                          '5363' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '794',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EVBUFFER_PTR_SET',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'EVBUFFER_PTR_ADD',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum evbuffer_ptr_how',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '538' => {
                                     'BaseType' => '501',
                                     'Name' => 'struct timeval const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '5394' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '885',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'orig_size',
                                                           'offset' => '0',
                                                           'type' => '421'
                                                         },
                                                  '1' => {
                                                           'name' => 'n_added',
                                                           'offset' => '8',
                                                           'type' => '421'
                                                         },
                                                  '2' => {
                                                           'name' => 'n_deleted',
                                                           'offset' => '16',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_cb_info',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '54319' => {
                                       'Name' => 'struct evdns_getaddrinfo_request',
                                       'PrivateABI' => 1,
                                       'Type' => 'Struct'
                                     },
                          '54324' => {
                                       'BaseType' => '54319',
                                       'Name' => 'struct evdns_getaddrinfo_request*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5447' => {
                                      'BaseType' => '5394',
                                      'Name' => 'struct evbuffer_cb_info const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '5452' => {
                                      'BaseType' => '5464',
                                      'Header' => 'buffer.h',
                                      'Line' => '914',
                                      'Name' => 'evbuffer_cb_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5464' => {
                                      'Name' => 'void(*)(struct evbuffer*, struct evbuffer_cb_info const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5491'
                                                          },
                                                   '1' => {
                                                            'type' => '5743'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5491' => {
                                      'BaseType' => '5497',
                                      'Name' => 'struct evbuffer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5497' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '80',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'first',
                                                           'offset' => '0',
                                                           'type' => '7494'
                                                         },
                                                  '1' => {
                                                           'name' => 'last',
                                                           'offset' => '8',
                                                           'type' => '7494'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'freeze_end',
                                                            'offset' => '64',
                                                            'type' => '64'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'deferred_cbs',
                                                            'offset' => '64',
                                                            'type' => '64'
                                                          },
                                                  '12' => {
                                                            'name' => 'flags',
                                                            'offset' => '68',
                                                            'type' => '3689'
                                                          },
                                                  '13' => {
                                                            'name' => 'cb_queue',
                                                            'offset' => '72',
                                                            'type' => '6567'
                                                          },
                                                  '14' => {
                                                            'name' => 'refcnt',
                                                            'offset' => '80',
                                                            'type' => '119'
                                                          },
                                                  '15' => {
                                                            'name' => 'deferred',
                                                            'offset' => '88',
                                                            'type' => '6144'
                                                          },
                                                  '16' => {
                                                            'name' => 'callbacks',
                                                            'offset' => '128',
                                                            'type' => '7372'
                                                          },
                                                  '17' => {
                                                            'name' => 'parent',
                                                            'offset' => '136',
                                                            'type' => '5825'
                                                          },
                                                  '2' => {
                                                           'name' => 'last_with_datap',
                                                           'offset' => '16',
                                                           'type' => '7500'
                                                         },
                                                  '3' => {
                                                           'name' => 'total_len',
                                                           'offset' => '24',
                                                           'type' => '421'
                                                         },
                                                  '4' => {
                                                           'name' => 'max_read',
                                                           'offset' => '32',
                                                           'type' => '421'
                                                         },
                                                  '5' => {
                                                           'name' => 'n_add_for_cb',
                                                           'offset' => '40',
                                                           'type' => '421'
                                                         },
                                                  '6' => {
                                                           'name' => 'n_del_for_cb',
                                                           'offset' => '48',
                                                           'type' => '421'
                                                         },
                                                  '7' => {
                                                           'name' => 'lock',
                                                           'offset' => '56',
                                                           'type' => '319'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'own_lock',
                                                           'offset' => '64',
                                                           'type' => '64'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'freeze_start',
                                                           'offset' => '64',
                                                           'type' => '64'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '56344' => {
                                       'Header' => 'ratelim-internal.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'read_limit',
                                                            'offset' => '0',
                                                            'type' => '399'
                                                          },
                                                   '1' => {
                                                            'name' => 'write_limit',
                                                            'offset' => '8',
                                                            'type' => '399'
                                                          },
                                                   '2' => {
                                                            'name' => 'last_updated',
                                                            'offset' => '16',
                                                            'type' => '3689'
                                                          }
                                                 },
                                       'Name' => 'struct ev_token_bucket',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '56393' => {
                                       'Header' => 'ratelim-internal.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'read_rate',
                                                            'offset' => '0',
                                                            'type' => '421'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_maximum',
                                                            'offset' => '8',
                                                            'type' => '421'
                                                          },
                                                   '2' => {
                                                            'name' => 'write_rate',
                                                            'offset' => '16',
                                                            'type' => '421'
                                                          },
                                                   '3' => {
                                                            'name' => 'write_maximum',
                                                            'offset' => '24',
                                                            'type' => '421'
                                                          },
                                                   '4' => {
                                                            'name' => 'tick_timeout',
                                                            'offset' => '32',
                                                            'type' => '501'
                                                          },
                                                   '5' => {
                                                            'name' => 'msec_per_tick',
                                                            'offset' => '48',
                                                            'type' => '64'
                                                          }
                                                 },
                                       'Name' => 'struct ev_token_bucket_cfg',
                                       'PrivateABI' => 1,
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '56478' => {
                                       'BaseType' => '3678',
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '77',
                                       'Name' => 'bufferevent_suspend_flags',
                                       'PrivateABI' => 1,
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '56489' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '81',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'lh_first',
                                                            'offset' => '0',
                                                            'type' => '56815'
                                                          }
                                                 },
                                       'Name' => 'struct rlim_group_member_list',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '56514' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '154',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bev',
                                                            'offset' => '0',
                                                            'type' => '5831'
                                                          },
                                                   '1' => {
                                                            'name' => 'read_watermarks_cb',
                                                            'offset' => '376',
                                                            'type' => '7329'
                                                          },
                                                   '10' => {
                                                             'name' => 'errno_pending',
                                                             'offset' => '392',
                                                             'type' => '119'
                                                           },
                                                   '11' => {
                                                             'name' => 'dns_error',
                                                             'offset' => '396',
                                                             'type' => '119'
                                                           },
                                                   '12' => {
                                                             'name' => 'deferred',
                                                             'offset' => '400',
                                                             'type' => '6144'
                                                           },
                                                   '13' => {
                                                             'name' => 'options',
                                                             'offset' => '440',
                                                             'type' => '52293'
                                                           },
                                                   '14' => {
                                                             'name' => 'refcnt',
                                                             'offset' => '444',
                                                             'type' => '119'
                                                           },
                                                   '15' => {
                                                             'name' => 'lock',
                                                             'offset' => '448',
                                                             'type' => '319'
                                                           },
                                                   '16' => {
                                                             'name' => 'max_single_read',
                                                             'offset' => '456',
                                                             'type' => '399'
                                                           },
                                                   '17' => {
                                                             'name' => 'max_single_write',
                                                             'offset' => '464',
                                                             'type' => '399'
                                                           },
                                                   '18' => {
                                                             'name' => 'rate_limiting',
                                                             'offset' => '472',
                                                             'type' => '57249'
                                                           },
                                                   '19' => {
                                                             'name' => 'conn_address',
                                                             'offset' => '480',
                                                             'type' => '57153'
                                                           },
                                                   '2' => {
                                                            'bitfield' => '1',
                                                            'name' => 'own_lock',
                                                            'offset' => '384',
                                                            'type' => '64'
                                                          },
                                                   '20' => {
                                                             'name' => 'dns_request',
                                                             'offset' => '512',
                                                             'type' => '54324'
                                                           },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'readcb_pending',
                                                            'offset' => '384',
                                                            'type' => '64'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'writecb_pending',
                                                            'offset' => '384',
                                                            'type' => '64'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'connecting',
                                                            'offset' => '384',
                                                            'type' => '64'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'connection_refused',
                                                            'offset' => '384',
                                                            'type' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'eventcb_pending',
                                                            'offset' => '386',
                                                            'type' => '101'
                                                          },
                                                   '8' => {
                                                            'name' => 'read_suspended',
                                                            'offset' => '388',
                                                            'type' => '56478'
                                                          },
                                                   '9' => {
                                                            'name' => 'write_suspended',
                                                            'offset' => '390',
                                                            'type' => '56478'
                                                          }
                                                 },
                                       'Name' => 'struct bufferevent_private',
                                       'PrivateABI' => 1,
                                       'Size' => '520',
                                       'Type' => 'Struct'
                                     },
                          '56815' => {
                                       'BaseType' => '56514',
                                       'Name' => 'struct bufferevent_private*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56821' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'members',
                                                            'offset' => '0',
                                                            'type' => '56489'
                                                          },
                                                   '1' => {
                                                            'name' => 'rate_limit',
                                                            'offset' => '8',
                                                            'type' => '56344'
                                                          },
                                                   '10' => {
                                                             'name' => 'min_share',
                                                             'offset' => '120',
                                                             'type' => '399'
                                                           },
                                                   '11' => {
                                                             'name' => 'configured_min_share',
                                                             'offset' => '128',
                                                             'type' => '399'
                                                           },
                                                   '12' => {
                                                             'name' => 'master_refill_event',
                                                             'offset' => '136',
                                                             'type' => '4223'
                                                           },
                                                   '13' => {
                                                             'name' => 'weakrand_seed',
                                                             'offset' => '256',
                                                             'type' => '7154'
                                                           },
                                                   '14' => {
                                                             'name' => 'lock',
                                                             'offset' => '264',
                                                             'type' => '319'
                                                           },
                                                   '2' => {
                                                            'name' => 'rate_limit_cfg',
                                                            'offset' => '32',
                                                            'type' => '56393'
                                                          },
                                                   '3' => {
                                                            'bitfield' => '1',
                                                            'name' => 'read_suspended',
                                                            'offset' => '88',
                                                            'type' => '64'
                                                          },
                                                   '4' => {
                                                            'bitfield' => '1',
                                                            'name' => 'write_suspended',
                                                            'offset' => '88',
                                                            'type' => '64'
                                                          },
                                                   '5' => {
                                                            'bitfield' => '1',
                                                            'name' => 'pending_unsuspend_read',
                                                            'offset' => '88',
                                                            'type' => '64'
                                                          },
                                                   '6' => {
                                                            'bitfield' => '1',
                                                            'name' => 'pending_unsuspend_write',
                                                            'offset' => '88',
                                                            'type' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'total_read',
                                                            'offset' => '96',
                                                            'type' => '3700'
                                                          },
                                                   '8' => {
                                                            'name' => 'total_written',
                                                            'offset' => '104',
                                                            'type' => '3700'
                                                          },
                                                   '9' => {
                                                            'name' => 'n_members',
                                                            'offset' => '112',
                                                            'type' => '119'
                                                          }
                                                 },
                                       'Name' => 'struct bufferevent_rate_limit_group',
                                       'PrivateABI' => 1,
                                       'Size' => '272',
                                       'Type' => 'Struct'
                                     },
                          '57' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '57029' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '136',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'le_next',
                                                            'offset' => '0',
                                                            'type' => '56815'
                                                          },
                                                   '1' => {
                                                            'name' => 'le_prev',
                                                            'offset' => '8',
                                                            'type' => '57062'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-bufferevent-internal.h-136',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '57062' => {
                                       'BaseType' => '56815',
                                       'Name' => 'struct bufferevent_private**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57068' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '130',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_in_group',
                                                            'offset' => '0',
                                                            'type' => '57029'
                                                          },
                                                   '1' => {
                                                            'name' => 'group',
                                                            'offset' => '16',
                                                            'type' => '57141'
                                                          },
                                                   '2' => {
                                                            'name' => 'limit',
                                                            'offset' => '24',
                                                            'type' => '56344'
                                                          },
                                                   '3' => {
                                                            'name' => 'cfg',
                                                            'offset' => '48',
                                                            'type' => '57147'
                                                          },
                                                   '4' => {
                                                            'name' => 'refill_bucket_event',
                                                            'offset' => '56',
                                                            'type' => '4223'
                                                          }
                                                 },
                                       'Name' => 'struct bufferevent_rate_limit',
                                       'PrivateABI' => 1,
                                       'Size' => '176',
                                       'Type' => 'Struct'
                                     },
                          '57141' => {
                                       'BaseType' => '56821',
                                       'Name' => 'struct bufferevent_rate_limit_group*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57147' => {
                                       'BaseType' => '56393',
                                       'Name' => 'struct ev_token_bucket_cfg*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '57153' => {
                                       'Header' => 'bufferevent-internal.h',
                                       'Line' => '227',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in6',
                                                            'offset' => '0',
                                                            'type' => '926'
                                                          },
                                                   '1' => {
                                                            'name' => 'in',
                                                            'offset' => '0',
                                                            'type' => '849'
                                                          }
                                                 },
                                       'Name' => 'anon-union-bufferevent-internal.h-227',
                                       'PrivateABI' => 1,
                                       'Size' => '28',
                                       'Type' => 'Union'
                                     },
                          '57249' => {
                                       'BaseType' => '57068',
                                       'Name' => 'struct bufferevent_rate_limit*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5738' => {
                                      'BaseType' => '5497',
                                      'Name' => 'struct evbuffer const',
                                      'Size' => '144',
                                      'Type' => 'Const'
                                    },
                          '5743' => {
                                      'BaseType' => '5447',
                                      'Name' => 'struct evbuffer_cb_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5749' => {
                                      'BaseType' => '5760',
                                      'Header' => 'buffer_compat.h',
                                      'Line' => '73',
                                      'Name' => 'evbuffer_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5760' => {
                                      'Name' => 'void(*)(struct evbuffer*, size_t, size_t, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5491'
                                                          },
                                                   '1' => {
                                                            'type' => '421'
                                                          },
                                                   '2' => {
                                                            'type' => '421'
                                                          },
                                                   '3' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5792' => {
                                      'BaseType' => '5803',
                                      'Header' => 'bufferevent.h',
                                      'Line' => '136',
                                      'Name' => 'bufferevent_data_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '5803' => {
                                      'Name' => 'void(*)(struct bufferevent*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          },
                                                   '1' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '5825' => {
                                      'BaseType' => '5831',
                                      'Name' => 'struct bufferevent*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5831' => {
                                      'Header' => 'bufferevent_struct.h',
                                      'Line' => '70',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '0',
                                                           'type' => '6567'
                                                         },
                                                  '1' => {
                                                           'name' => 'be_ops',
                                                           'offset' => '8',
                                                           'type' => '6781'
                                                         },
                                                  '10' => {
                                                            'name' => 'errorcb',
                                                            'offset' => '320',
                                                            'type' => '6036'
                                                          },
                                                  '11' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '328',
                                                            'type' => '319'
                                                          },
                                                  '12' => {
                                                            'name' => 'timeout_read',
                                                            'offset' => '336',
                                                            'type' => '501'
                                                          },
                                                  '13' => {
                                                            'name' => 'timeout_write',
                                                            'offset' => '352',
                                                            'type' => '501'
                                                          },
                                                  '14' => {
                                                            'name' => 'enabled',
                                                            'offset' => '368',
                                                            'type' => '101'
                                                          },
                                                  '2' => {
                                                           'name' => 'ev_read',
                                                           'offset' => '16',
                                                           'type' => '4223'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_write',
                                                           'offset' => '136',
                                                           'type' => '4223'
                                                         },
                                                  '4' => {
                                                           'name' => 'input',
                                                           'offset' => '256',
                                                           'type' => '5491'
                                                         },
                                                  '5' => {
                                                           'name' => 'output',
                                                           'offset' => '264',
                                                           'type' => '5491'
                                                         },
                                                  '6' => {
                                                           'name' => 'wm_read',
                                                           'offset' => '272',
                                                           'type' => '6610'
                                                         },
                                                  '7' => {
                                                           'name' => 'wm_write',
                                                           'offset' => '288',
                                                           'type' => '6610'
                                                         },
                                                  '8' => {
                                                           'name' => 'readcb',
                                                           'offset' => '304',
                                                           'type' => '5792'
                                                         },
                                                  '9' => {
                                                           'name' => 'writecb',
                                                           'offset' => '312',
                                                           'type' => '5792'
                                                         }
                                                },
                                      'Name' => 'struct bufferevent',
                                      'Size' => '376',
                                      'Type' => 'Struct'
                                    },
                          '6036' => {
                                      'BaseType' => '6047',
                                      'Header' => 'bufferevent.h',
                                      'Line' => '155',
                                      'Name' => 'bufferevent_event_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6047' => {
                                      'Name' => 'void(*)(struct bufferevent*, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          },
                                                   '1' => {
                                                            'type' => '101'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6074' => {
                                      'Header' => 'bufferevent.h',
                                      'Line' => '621',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'BEV_NORMAL',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'BEV_FLUSH',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'BEV_FINISHED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum bufferevent_flush_mode',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6111' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '6229'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '6235'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-108',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6144' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '107',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_active_next',
                                                           'offset' => '0',
                                                           'type' => '6111'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_flags',
                                                           'offset' => '16',
                                                           'type' => '101'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_pri',
                                                           'offset' => '18',
                                                           'type' => '3667'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_closure',
                                                           'offset' => '19',
                                                           'type' => '3667'
                                                         },
                                                  '4' => {
                                                           'name' => 'evcb_cb_union',
                                                           'offset' => '24',
                                                           'type' => '6241'
                                                         },
                                                  '5' => {
                                                           'name' => 'evcb_arg',
                                                           'offset' => '32',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'struct event_callback',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '6229' => {
                                      'BaseType' => '6144',
                                      'Name' => 'struct event_callback*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6235' => {
                                      'BaseType' => '6229',
                                      'Name' => 'struct event_callback**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6241' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_callback',
                                                           'offset' => '0',
                                                           'type' => '4168'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_selfcb',
                                                           'offset' => '0',
                                                           'type' => '6310'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_evfinalize',
                                                           'offset' => '0',
                                                           'type' => '4195'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_cbfinalize',
                                                           'offset' => '0',
                                                           'type' => '6310'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-113',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '6310' => {
                                      'Name' => 'void(*)(struct event_callback*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6229'
                                                          },
                                                   '1' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6316' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '4217'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '6349'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-128',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6349' => {
                                      'BaseType' => '4217',
                                      'Name' => 'struct event**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6355' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '127',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_next_with_common_timeout',
                                                           'offset' => '0',
                                                           'type' => '6316'
                                                         },
                                                  '1' => {
                                                           'name' => 'min_heap_idx',
                                                           'offset' => '0',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-127',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '6386' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '141',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '4217'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '6349'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-141',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '64' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6419' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '140',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io_next',
                                                           'offset' => '0',
                                                           'type' => '6386'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '16',
                                                           'type' => '501'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-140',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '642' => {
                                     'Header' => 'struct_iovec.h',
                                     'Line' => '26',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'iov_base',
                                                          'offset' => '0',
                                                          'type' => '319'
                                                        },
                                                 '1' => {
                                                          'name' => 'iov_len',
                                                          'offset' => '8',
                                                          'type' => '421'
                                                        }
                                               },
                                     'Name' => 'struct iovec',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '6452' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '147',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '4217'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '6349'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-147',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6485' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_signal_next',
                                                           'offset' => '0',
                                                           'type' => '6452'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_ncalls',
                                                           'offset' => '16',
                                                           'type' => '101'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_pncalls',
                                                           'offset' => '24',
                                                           'type' => '6530'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-146',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '65041' => {
                                       'BaseType' => '52250',
                                       'Name' => 'struct bufferevent const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6530' => {
                                      'BaseType' => '101',
                                      'Name' => 'short*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6536' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '138',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io',
                                                           'offset' => '0',
                                                           'type' => '6419'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_signal',
                                                           'offset' => '0',
                                                           'type' => '6485'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-138',
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '65407' => {
                                       'BaseType' => '5792',
                                       'Name' => 'bufferevent_data_cb*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65413' => {
                                       'BaseType' => '6036',
                                       'Name' => 'bufferevent_event_cb*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6567' => {
                                      'BaseType' => '4332',
                                      'Name' => 'struct event_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6573' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '158',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqh_first',
                                                           'offset' => '0',
                                                           'type' => '4217'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqh_last',
                                                           'offset' => '8',
                                                           'type' => '6349'
                                                         }
                                                },
                                      'Name' => 'struct event_list',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6610' => {
                                      'Header' => 'bufferevent_struct.h',
                                      'Line' => '57',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'low',
                                                           'offset' => '0',
                                                           'type' => '421'
                                                         },
                                                  '1' => {
                                                           'name' => 'high',
                                                           'offset' => '8',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'struct event_watermark',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6647' => {
                                      'Header' => 'bufferevent-internal.h',
                                      'Line' => '253',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '2162'
                                                         },
                                                  '1' => {
                                                           'name' => 'mem_offset',
                                                           'offset' => '8',
                                                           'type' => '388'
                                                         },
                                                  '2' => {
                                                           'name' => 'enable',
                                                           'offset' => '16',
                                                           'type' => '7727'
                                                         },
                                                  '3' => {
                                                           'name' => 'disable',
                                                           'offset' => '24',
                                                           'type' => '7727'
                                                         },
                                                  '4' => {
                                                           'name' => 'unlink',
                                                           'offset' => '32',
                                                           'type' => '7744'
                                                         },
                                                  '5' => {
                                                           'name' => 'destruct',
                                                           'offset' => '40',
                                                           'type' => '7744'
                                                         },
                                                  '6' => {
                                                           'name' => 'adj_timeouts',
                                                           'offset' => '48',
                                                           'type' => '7765'
                                                         },
                                                  '7' => {
                                                           'name' => 'flush',
                                                           'offset' => '56',
                                                           'type' => '7796'
                                                         },
                                                  '8' => {
                                                           'name' => 'ctrl',
                                                           'offset' => '64',
                                                           'type' => '7833'
                                                         }
                                                },
                                      'Name' => 'struct bufferevent_ops',
                                      'PrivateABI' => 1,
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '6776' => {
                                      'BaseType' => '6647',
                                      'Name' => 'struct bufferevent_ops const',
                                      'Size' => '72',
                                      'Type' => 'Const'
                                    },
                          '6781' => {
                                      'BaseType' => '6776',
                                      'Name' => 'struct bufferevent_ops const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6787' => {
                                      'Header' => 'thread.h',
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lock_api_version',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'supported_locktypes',
                                                           'offset' => '4',
                                                           'type' => '64'
                                                         },
                                                  '2' => {
                                                           'name' => 'alloc',
                                                           'offset' => '8',
                                                           'type' => '6887'
                                                         },
                                                  '3' => {
                                                           'name' => 'free',
                                                           'offset' => '16',
                                                           'type' => '6909'
                                                         },
                                                  '4' => {
                                                           'name' => 'lock',
                                                           'offset' => '24',
                                                           'type' => '6935'
                                                         },
                                                  '5' => {
                                                           'name' => 'unlock',
                                                           'offset' => '32',
                                                           'type' => '6935'
                                                         }
                                                },
                                      'Name' => 'struct evthread_lock_callbacks',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '679' => {
                                     'BaseType' => '57',
                                     'Header' => 'sockaddr.h',
                                     'Line' => '28',
                                     'Name' => 'sa_family_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '6887' => {
                                      'Name' => 'void*(*)(unsigned int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '64'
                                                          }
                                                 },
                                      'Return' => '319',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '690' => {
                                     'Header' => 'socket.h',
                                     'Line' => '175',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'sa_family',
                                                          'offset' => '0',
                                                          'type' => '679'
                                                        },
                                                 '1' => {
                                                          'name' => 'sa_data',
                                                          'offset' => '2',
                                                          'type' => '732'
                                                        }
                                               },
                                     'Name' => 'struct sockaddr',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '6909' => {
                                      'Name' => 'void(*)(void*, unsigned int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '319'
                                                          },
                                                   '1' => {
                                                            'type' => '64'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6935' => {
                                      'Name' => 'int(*)(unsigned int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '64'
                                                          },
                                                   '1' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6941' => {
                                      'Header' => 'thread.h',
                                      'Line' => '140',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'condition_api_version',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'alloc_condition',
                                                           'offset' => '8',
                                                           'type' => '6887'
                                                         },
                                                  '2' => {
                                                           'name' => 'free_condition',
                                                           'offset' => '16',
                                                           'type' => '7025'
                                                         },
                                                  '3' => {
                                                           'name' => 'signal_condition',
                                                           'offset' => '24',
                                                           'type' => '7051'
                                                         },
                                                  '4' => {
                                                           'name' => 'wait_condition',
                                                           'offset' => '32',
                                                           'type' => '7088'
                                                         }
                                                },
                                      'Name' => 'struct evthread_condition_callbacks',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '7025' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7051' => {
                                      'Name' => 'int(*)(void*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '319'
                                                          },
                                                   '1' => {
                                                            'type' => '119'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7082' => {
                                      'BaseType' => '538',
                                      'Name' => 'struct timeval const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7088' => {
                                      'Name' => 'int(*)(void*, void*, struct timeval const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '319'
                                                          },
                                                   '1' => {
                                                            'type' => '319'
                                                          },
                                                   '2' => {
                                                            'type' => '7082'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7105' => {
                                      'Header' => 'util.h',
                                      'Line' => '64',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'monotonic_clock',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'adjust_monotonic_clock',
                                                           'offset' => '8',
                                                           'type' => '501'
                                                         },
                                                  '2' => {
                                                           'name' => 'last_time',
                                                           'offset' => '24',
                                                           'type' => '501'
                                                         }
                                                },
                                      'Name' => 'struct evutil_monotonic_timer',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '7154' => {
                                      'Header' => 'util-internal.h',
                                      'Line' => '321',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'seed',
                                                           'offset' => '0',
                                                           'type' => '3689'
                                                         }
                                                },
                                      'Name' => 'struct evutil_weakrand_state',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7219' => {
                                      'Name' => 'unsigned long(*)()',
                                      'Return' => '76',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '72193' => {
                                       'Header' => 'bufferevent.h',
                                       'Line' => '696',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BEV_OK',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'BEV_NEED_MORE',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'BEV_ERROR',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum bufferevent_filter_result',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '72230' => {
                                       'BaseType' => '72242',
                                       'Header' => 'bufferevent.h',
                                       'Line' => '726',
                                       'Name' => 'bufferevent_filter_cb',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '72242' => {
                                       'Name' => 'enum bufferevent_filter_result(*)(struct evbuffer*, struct evbuffer*, ssize_t, enum bufferevent_flush_mode, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '5491'
                                                           },
                                                    '1' => {
                                                             'type' => '5491'
                                                           },
                                                    '2' => {
                                                             'type' => '399'
                                                           },
                                                    '3' => {
                                                             'type' => '6074'
                                                           },
                                                    '4' => {
                                                             'type' => '319'
                                                           }
                                                  },
                                       'Return' => '72193',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '7236' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '64',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '7329'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '7335'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evbuffer-internal.h-64',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7269' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '62',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '7236'
                                                         },
                                                  '1' => {
                                                           'name' => 'cb',
                                                           'offset' => '16',
                                                           'type' => '7341'
                                                         },
                                                  '2' => {
                                                           'name' => 'cbarg',
                                                           'offset' => '24',
                                                           'type' => '319'
                                                         },
                                                  '3' => {
                                                           'name' => 'flags',
                                                           'offset' => '32',
                                                           'type' => '3689'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_cb_entry',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '727' => {
                                     'BaseType' => '690',
                                     'Name' => 'struct sockaddr const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '732' => {
                                     'BaseType' => '376',
                                     'Name' => 'char[14]',
                                     'Size' => '14',
                                     'Type' => 'Array'
                                   },
                          '7329' => {
                                      'BaseType' => '7269',
                                      'Name' => 'struct evbuffer_cb_entry*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7335' => {
                                      'BaseType' => '7329',
                                      'Name' => 'struct evbuffer_cb_entry**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7341' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '68',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cb_func',
                                                           'offset' => '0',
                                                           'type' => '5452'
                                                         },
                                                  '1' => {
                                                           'name' => 'cb_obsolete',
                                                           'offset' => '0',
                                                           'type' => '5749'
                                                         }
                                                },
                                      'Name' => 'anon-union-evbuffer-internal.h-68',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '7372' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '153',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lh_first',
                                                           'offset' => '0',
                                                           'type' => '7329'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_cb_queue',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7397' => {
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '173',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '7494'
                                                         },
                                                  '1' => {
                                                           'name' => 'buffer_len',
                                                           'offset' => '8',
                                                           'type' => '421'
                                                         },
                                                  '2' => {
                                                           'name' => 'misalign',
                                                           'offset' => '16',
                                                           'type' => '7506'
                                                         },
                                                  '3' => {
                                                           'name' => 'off',
                                                           'offset' => '24',
                                                           'type' => '421'
                                                         },
                                                  '4' => {
                                                           'name' => 'flags',
                                                           'offset' => '32',
                                                           'type' => '64'
                                                         },
                                                  '5' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '36',
                                                           'type' => '119'
                                                         },
                                                  '6' => {
                                                           'name' => 'buffer',
                                                           'offset' => '40',
                                                           'type' => '7517'
                                                         }
                                                },
                                      'Name' => 'struct evbuffer_chain',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '748' => {
                                     'BaseType' => '642',
                                     'Name' => 'struct iovec*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7494' => {
                                      'BaseType' => '7397',
                                      'Name' => 'struct evbuffer_chain*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7500' => {
                                      'BaseType' => '7494',
                                      'Name' => 'struct evbuffer_chain**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7506' => {
                                      'BaseType' => '437',
                                      'Header' => 'evbuffer-internal.h',
                                      'Line' => '164',
                                      'Name' => 'ev_misalign_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7517' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '754' => {
                                     'BaseType' => '690',
                                     'Name' => 'struct sockaddr*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7585' => {
                                      'BaseType' => '5178',
                                      'Name' => 'struct evbuffer_file_segment*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '76' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '7631' => {
                                      'Header' => 'bufferevent-internal.h',
                                      'Line' => '236',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'BEV_CTRL_SET_FD',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'BEV_CTRL_GET_FD',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'BEV_CTRL_GET_UNDERLYING',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'BEV_CTRL_CANCEL_ALL',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum bufferevent_ctrl_op',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7673' => {
                                      'Header' => 'bufferevent-internal.h',
                                      'Line' => '244',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => 'fd',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'union bufferevent_ctrl_data',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '7727' => {
                                      'Name' => 'int(*)(struct bufferevent*, short)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          },
                                                   '1' => {
                                                            'type' => '101'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7744' => {
                                      'Name' => 'void(*)(struct bufferevent*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7765' => {
                                      'Name' => 'int(*)(struct bufferevent*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7796' => {
                                      'Name' => 'int(*)(struct bufferevent*, short, enum bufferevent_flush_mode)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          },
                                                   '1' => {
                                                            'type' => '101'
                                                          },
                                                   '2' => {
                                                            'type' => '6074'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '78037' => {
                                       'BaseType' => '119',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '7827' => {
                                      'BaseType' => '7673',
                                      'Name' => 'union bufferevent_ctrl_data*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7833' => {
                                      'Name' => 'int(*)(struct bufferevent*, enum bufferevent_ctrl_op, union bufferevent_ctrl_data*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '5825'
                                                          },
                                                   '1' => {
                                                            'type' => '7631'
                                                          },
                                                   '2' => {
                                                            'type' => '7827'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7875' => {
                                      'BaseType' => '7886',
                                      'Header' => 'watch.h',
                                      'Line' => '59',
                                      'Name' => 'evwatch_prepare_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7886' => {
                                      'Name' => 'void(*)(struct evwatch*, struct evwatch_prepare_cb_info const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7913'
                                                          },
                                                   '1' => {
                                                            'type' => '7992'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7913' => {
                                      'BaseType' => '7919',
                                      'Name' => 'struct evwatch*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7919' => {
                                      'Header' => 'event-internal.h',
                                      'Line' => '236',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '9590'
                                                         },
                                                  '1' => {
                                                           'name' => 'base',
                                                           'offset' => '16',
                                                           'type' => '6567'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '24',
                                                           'type' => '64'
                                                         },
                                                  '3' => {
                                                           'name' => 'callback',
                                                           'offset' => '32',
                                                           'type' => '9555'
                                                         },
                                                  '4' => {
                                                           'name' => 'arg',
                                                           'offset' => '40',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'struct evwatch',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '7992' => {
                                      'BaseType' => '8023',
                                      'Name' => 'struct evwatch_prepare_cb_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7998' => {
                                      'Header' => 'event-internal.h',
                                      'Line' => '212',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'timeout',
                                                           'offset' => '0',
                                                           'type' => '7082'
                                                         }
                                                },
                                      'Name' => 'struct evwatch_prepare_cb_info',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '8023' => {
                                      'BaseType' => '7998',
                                      'Name' => 'struct evwatch_prepare_cb_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '8028' => {
                                      'BaseType' => '8039',
                                      'Header' => 'watch.h',
                                      'Line' => '69',
                                      'Name' => 'evwatch_check_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8039' => {
                                      'Name' => 'void(*)(struct evwatch*, struct evwatch_check_cb_info const*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7913'
                                                          },
                                                   '1' => {
                                                            'type' => '8066'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8066' => {
                                      'BaseType' => '8097',
                                      'Name' => 'struct evwatch_check_cb_info const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8072' => {
                                      'Header' => 'event-internal.h',
                                      'Line' => '221',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'unused',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'struct evwatch_check_cb_info',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '8097' => {
                                      'BaseType' => '8072',
                                      'Name' => 'struct evwatch_check_cb_info const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '8102' => {
                                      'Header' => 'minheap-internal.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'p',
                                                           'offset' => '0',
                                                           'type' => '6349'
                                                         },
                                                  '1' => {
                                                           'name' => 'n',
                                                           'offset' => '8',
                                                           'type' => '421'
                                                         },
                                                  '2' => {
                                                           'name' => 'a',
                                                           'offset' => '16',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'struct min_heap',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8145' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '56',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_pid',
                                                           'offset' => '0',
                                                           'type' => '259'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_uid',
                                                           'offset' => '4',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-56',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '8178' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '63',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_tid',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_overrun',
                                                           'offset' => '4',
                                                           'type' => '119'
                                                         },
                                                  '2' => {
                                                           'name' => 'si_sigval',
                                                           'offset' => '8',
                                                           'type' => '3942'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-63',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8223' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '71',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_pid',
                                                           'offset' => '0',
                                                           'type' => '259'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_uid',
                                                           'offset' => '4',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'si_sigval',
                                                           'offset' => '8',
                                                           'type' => '3942'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-71',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8268' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '79',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_pid',
                                                           'offset' => '0',
                                                           'type' => '259'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_uid',
                                                           'offset' => '4',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'si_status',
                                                           'offset' => '8',
                                                           'type' => '119'
                                                         },
                                                  '3' => {
                                                           'name' => 'si_utime',
                                                           'offset' => '16',
                                                           'type' => '286'
                                                         },
                                                  '4' => {
                                                           'name' => 'si_stime',
                                                           'offset' => '24',
                                                           'type' => '286'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-79',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '83' => {
                                    'Name' => 'signed char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '8337' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '97',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_lower',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => '_upper',
                                                           'offset' => '8',
                                                           'type' => '319'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-97',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8370' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_addr_bnd',
                                                           'offset' => '0',
                                                           'type' => '8337'
                                                         },
                                                  '1' => {
                                                           'name' => '_pkey',
                                                           'offset' => '0',
                                                           'type' => '131'
                                                         }
                                                },
                                      'Name' => 'anon-union-siginfo_t.h-94',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '8401' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '89',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_addr',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_addr_lsb',
                                                           'offset' => '8',
                                                           'type' => '101'
                                                         },
                                                  '2' => {
                                                           'name' => '_bounds',
                                                           'offset' => '16',
                                                           'type' => '8370'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-89',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '8446' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_band',
                                                           'offset' => '0',
                                                           'type' => '153'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_fd',
                                                           'offset' => '8',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-108',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8479' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '116',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_call_addr',
                                                           'offset' => '0',
                                                           'type' => '319'
                                                         },
                                                  '1' => {
                                                           'name' => '_syscall',
                                                           'offset' => '8',
                                                           'type' => '119'
                                                         },
                                                  '2' => {
                                                           'name' => '_arch',
                                                           'offset' => '12',
                                                           'type' => '64'
                                                         }
                                                },
                                      'Name' => 'anon-struct-siginfo_t.h-116',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '849' => {
                                     'Header' => 'in.h',
                                     'Line' => '237',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'sin_family',
                                                          'offset' => '0',
                                                          'type' => '679'
                                                        },
                                                 '1' => {
                                                          'name' => 'sin_port',
                                                          'offset' => '2',
                                                          'type' => '3754'
                                                        },
                                                 '2' => {
                                                          'name' => 'sin_addr',
                                                          'offset' => '4',
                                                          'type' => '3729'
                                                        },
                                                 '3' => {
                                                          'name' => 'sin_zero',
                                                          'offset' => '8',
                                                          'type' => '1287'
                                                        }
                                               },
                                     'Name' => 'struct sockaddr_in',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '8524' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '51',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_pad',
                                                           'offset' => '0',
                                                           'type' => '8621'
                                                         },
                                                  '1' => {
                                                           'name' => '_kill',
                                                           'offset' => '0',
                                                           'type' => '8145'
                                                         },
                                                  '2' => {
                                                           'name' => '_timer',
                                                           'offset' => '0',
                                                           'type' => '8178'
                                                         },
                                                  '3' => {
                                                           'name' => '_rt',
                                                           'offset' => '0',
                                                           'type' => '8223'
                                                         },
                                                  '4' => {
                                                           'name' => '_sigchld',
                                                           'offset' => '0',
                                                           'type' => '8268'
                                                         },
                                                  '5' => {
                                                           'name' => '_sigfault',
                                                           'offset' => '0',
                                                           'type' => '8401'
                                                         },
                                                  '6' => {
                                                           'name' => '_sigpoll',
                                                           'offset' => '0',
                                                           'type' => '8446'
                                                         },
                                                  '7' => {
                                                           'name' => '_sigsys',
                                                           'offset' => '0',
                                                           'type' => '8479'
                                                         }
                                                },
                                      'Name' => 'anon-union-siginfo_t.h-51',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Union'
                                    },
                          '8621' => {
                                      'BaseType' => '119',
                                      'Name' => 'int[28]',
                                      'Size' => '112',
                                      'Type' => 'Array'
                                    },
                          '8706' => {
                                      'Header' => 'siginfo_t.h',
                                      'Line' => '124',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'si_signo',
                                                           'offset' => '0',
                                                           'type' => '119'
                                                         },
                                                  '1' => {
                                                           'name' => 'si_errno',
                                                           'offset' => '4',
                                                           'type' => '119'
                                                         },
                                                  '2' => {
                                                           'name' => 'si_code',
                                                           'offset' => '8',
                                                           'type' => '119'
                                                         },
                                                  '3' => {
                                                           'name' => '__pad0',
                                                           'offset' => '12',
                                                           'type' => '119'
                                                         },
                                                  '4' => {
                                                           'name' => '_sifields',
                                                           'offset' => '16',
                                                           'type' => '8524'
                                                         }
                                                },
                                      'Name' => 'struct siginfo_t',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '8717' => {
                                      'BaseType' => '4151',
                                      'Header' => 'signal.h',
                                      'Line' => '72',
                                      'Name' => '__sighandler_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8728' => {
                                      'Header' => 'sigaction.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_handler',
                                                           'offset' => '0',
                                                           'type' => '8717'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_sigaction',
                                                           'offset' => '0',
                                                           'type' => '8786'
                                                         }
                                                },
                                      'Name' => 'anon-union-sigaction.h-28',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '8780' => {
                                      'BaseType' => '8706',
                                      'Name' => 'siginfo_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8786' => {
                                      'Name' => 'void(*)(int, siginfo_t*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '119'
                                                          },
                                                   '1' => {
                                                            'type' => '8780'
                                                          },
                                                   '2' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8792' => {
                                      'Header' => 'sigaction.h',
                                      'Line' => '24',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__sigaction_handler',
                                                           'offset' => '0',
                                                           'type' => '8728'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_mask',
                                                           'offset' => '8',
                                                           'type' => '490'
                                                         },
                                                  '2' => {
                                                           'name' => 'sa_flags',
                                                           'offset' => '136',
                                                           'type' => '119'
                                                         },
                                                  '3' => {
                                                           'name' => 'sa_restorer',
                                                           'offset' => '144',
                                                           'type' => '8854'
                                                         }
                                                },
                                      'Name' => 'struct sigaction',
                                      'PrivateABI' => 1,
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '8854' => {
                                      'Name' => 'void(*)()',
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '88722' => {
                                       'BaseType' => '5825',
                                       'Name' => 'struct bufferevent**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8905' => {
                                      'Header' => 'evsignal-internal.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_signal',
                                                           'offset' => '0',
                                                           'type' => '4223'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_signal_pair',
                                                           'offset' => '120',
                                                           'type' => '270'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_signal_added',
                                                           'offset' => '128',
                                                           'type' => '119'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_n_signals_added',
                                                           'offset' => '132',
                                                           'type' => '119'
                                                         },
                                                  '4' => {
                                                           'name' => 'sh_old',
                                                           'offset' => '136',
                                                           'type' => '8990'
                                                         },
                                                  '5' => {
                                                           'name' => 'sh_old_max',
                                                           'offset' => '144',
                                                           'type' => '119'
                                                         }
                                                },
                                      'Name' => 'struct evsig_info',
                                      'PrivateABI' => 1,
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '8990' => {
                                      'BaseType' => '8996',
                                      'Name' => 'struct sigaction**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8996' => {
                                      'BaseType' => '8792',
                                      'Name' => 'struct sigaction*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '90' => {
                                    'BaseType' => '45',
                                    'Header' => 'types.h',
                                    'Line' => '37',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '9002' => {
                                      'Header' => 'event-internal.h',
                                      'Line' => '87',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '2162'
                                                         },
                                                  '1' => {
                                                           'name' => 'init',
                                                           'offset' => '8',
                                                           'type' => '9143'
                                                         },
                                                  '2' => {
                                                           'name' => 'add',
                                                           'offset' => '16',
                                                           'type' => '9184'
                                                         },
                                                  '3' => {
                                                           'name' => 'del',
                                                           'offset' => '24',
                                                           'type' => '9184'
                                                         },
                                                  '4' => {
                                                           'name' => 'dispatch',
                                                           'offset' => '32',
                                                           'type' => '9216'
                                                         },
                                                  '5' => {
                                                           'name' => 'dealloc',
                                                           'offset' => '40',
                                                           'type' => '9233'
                                                         },
                                                  '6' => {
                                                           'name' => 'need_reinit',
                                                           'offset' => '48',
                                                           'type' => '119'
                                                         },
                                                  '7' => {
                                                           'name' => 'features',
                                                           'offset' => '52',
                                                           'type' => '4047'
                                                         },
                                                  '8' => {
                                                           'name' => 'fdinfo_len',
                                                           'offset' => '56',
                                                           'type' => '421'
                                                         }
                                                },
                                      'Name' => 'struct eventop',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '9123' => {
                                      'BaseType' => '9002',
                                      'Name' => 'struct eventop const',
                                      'Size' => '64',
                                      'Type' => 'Const'
                                    },
                          '9143' => {
                                      'Name' => 'void*(*)(struct event_base*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6567'
                                                          }
                                                 },
                                      'Return' => '319',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9184' => {
                                      'Name' => 'int(*)(struct event_base*, int, short, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6567'
                                                          },
                                                   '1' => {
                                                            'type' => '119'
                                                          },
                                                   '2' => {
                                                            'type' => '101'
                                                          },
                                                   '3' => {
                                                            'type' => '101'
                                                          },
                                                   '4' => {
                                                            'type' => '319'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9210' => {
                                      'BaseType' => '501',
                                      'Name' => 'struct timeval*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9216' => {
                                      'Name' => 'int(*)(struct event_base*, struct timeval*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6567'
                                                          },
                                                   '1' => {
                                                            'type' => '9210'
                                                          }
                                                 },
                                      'Return' => '119',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9233' => {
                                      'Name' => 'void(*)(struct event_base*)',
                                      'Param' => {
                                                   '0' => {
