$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.5.0',
          'Headers' => {
                         'bufferevent.h' => 1,
                         'bufferevent_struct.h' => 1,
                         'dns.h' => 1,
                         'dns_compat.h' => 1,
                         'dns_struct.h' => 1,
                         'event_struct.h' => 1,
                         'http.h' => 1,
                         'http_compat.h' => 1,
                         'http_struct.h' => 1,
                         'keyvalq_struct.h' => 1,
                         'rpc.h' => 1,
                         'rpc_struct.h' => 1,
                         'tag.h' => 1,
                         'ws.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libevent_extra-2.2.so.1.0.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'evdns.c' => 1,
                         'event_tagging.c' => 1,
                         'evrpc.c' => 1,
                         'http.c' => 1,
                         'ws.c' => 1
                       },
          'SymbolInfo' => {
                            '101628' => {

                                                            'evrpc_resume_request' => 1,
                                                            'evrpc_send_request_generic' => 1,
                                                            'evrpc_unregister_rpc' => 1,
                                                            'evtag_consume' => 1,
                                                            'evtag_decode_int' => 1,
                                                            'evtag_decode_int64' => 1,
                                                            'evtag_decode_tag' => 1,
                                                            'evtag_encode_int' => 1,
                                                            'evtag_encode_int64' => 1,
                                                            'evtag_encode_tag' => 1,
                                                            'evtag_init' => 1,
                                                            'evtag_marshal' => 1,
                                                            'evtag_marshal_buffer' => 1,
                                                            'evtag_marshal_int' => 1,
                                                            'evtag_marshal_int64' => 1,
                                                            'evtag_marshal_string' => 1,
                                                            'evtag_marshal_timeval' => 1,
                                                            'evtag_payload_length' => 1,
                                                            'evtag_peek' => 1,
                                                            'evtag_peek_length' => 1,
                                                            'evtag_unmarshal' => 1,
                                                            'evtag_unmarshal_fixed' => 1,
                                                            'evtag_unmarshal_header' => 1,
                                                            'evtag_unmarshal_int' => 1,
                                                            'evtag_unmarshal_int64' => 1,
                                                            'evtag_unmarshal_string' => 1,
                                                            'evtag_unmarshal_timeval' => 1,
                                                            'evws_close' => 1,
                                                            'evws_connection_free' => 1,
                                                            'evws_connection_get_bufferevent' => 1,
                                                            'evws_connection_set_closecb' => 1,
                                                            'evws_new_session' => 1,
                                                            'evws_send' => 1
                                                          }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101059' => {
                                        'Header' => 'bufferevent_struct.h',
                                        'Line' => '57',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'low',
                                                             'offset' => '0',
                                                             'type' => '257'
                                                           },
                                                    '1' => {
                                                             'name' => 'high',
                                                             'offset' => '8',
                                                             'type' => '257'
                                                           }
                                                  },
                                        'Name' => 'struct event_watermark',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '101096' => {
                                        'Header' => 'bufferevent-internal.h',
                                        'Line' => '253',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '345'
                                                           },
                                                    '1' => {
                                                             'name' => 'mem_offset',
                                                             'offset' => '8',
                                                             'type' => '235'
                                                           },
                                                    '2' => {
                                                             'name' => 'enable',
                                                             'offset' => '16',
                                                             'type' => '101332'
                                                           },
                                                    '3' => {
                                                             'name' => 'disable',
                                                             'offset' => '24',
                                                             'type' => '101332'
                                                           },
                                                    '4' => {
                                                             'name' => 'unlink',
                                                             'offset' => '32',
                                                             'type' => '101349'
                                                           },
                                                    '5' => {
                                                             'name' => 'destruct',
                                                             'offset' => '40',
                                                             'type' => '101349'
                                                           },
                                                    '6' => {
                                                             'name' => 'adj_timeouts',
                                                             'offset' => '48',
                                                             'type' => '101370'
                                                           },
                                                    '7' => {
                                                             'name' => 'flush',
                                                             'offset' => '56',
                                                             'type' => '101401'
                                                           },
                                                    '8' => {
                                                             'name' => 'ctrl',
                                                             'offset' => '64',
                                                             'type' => '101438'
                                                           }
                                                  },
                                        'Name' => 'struct bufferevent_ops',
                                        'PrivateABI' => 1,
                                        'Size' => '72',
                                        'Type' => 'Struct'
                                      },
                          '101225' => {
                                        'BaseType' => '101096',
                                        'Name' => 'struct bufferevent_ops const',
                                        'Size' => '72',
                                        'Type' => 'Const'
                                      },
                          '101230' => {
                                        'BaseType' => '101225',
                                        'Name' => 'struct bufferevent_ops const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101236' => {
                                        'Header' => 'bufferevent-internal.h',
                                        'Line' => '236',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'BEV_CTRL_SET_FD',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'BEV_CTRL_GET_FD',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'BEV_CTRL_GET_UNDERLYING',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'BEV_CTRL_CANCEL_ALL',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum bufferevent_ctrl_op',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '101278' => {
                                        'Header' => 'bufferevent-internal.h',
                                        'Line' => '244',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ptr',
                                                             'offset' => '0',
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '109'
                                                           }
                                                  },
                                        'Name' => 'union bufferevent_ctrl_data',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '101332' => {
                                        'Name' => 'int(*)(struct bufferevent*, short)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '91'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101349' => {
                                        'Name' => 'void(*)(struct bufferevent*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101370' => {
                                        'Name' => 'int(*)(struct bufferevent*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101401' => {
                                        'Name' => 'int(*)(struct bufferevent*, short, enum bufferevent_flush_mode)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '91'
                                                            },
                                                     '2' => {
                                                              'type' => '97339'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101432' => {
                                        'BaseType' => '101278',
                                        'Name' => 'union bufferevent_ctrl_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '101438' => {
                                        'Name' => 'int(*)(struct bufferevent*, enum bufferevent_ctrl_op, union bufferevent_ctrl_data*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '101236'
                                                            },
                                                     '2' => {
                                                              'type' => '101432'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '101480' => {
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tqe_next',
                                                             'offset' => '0',
                                                             'type' => '80346'
                                                           },
                                                    '1' => {
                                                             'name' => 'tqe_prev',
                                                             'offset' => '8',
                                                             'type' => '80352'
                                                           }
                                                  },
                                        'Name' => 'anon-struct-ws.c-42',
                                        'PrivateABI' => 1,
                                        'Size' => '16',
                                        'Source' => 'ws.c',
                                        'Type' => 'Struct'
                                      },
                          '101513' => {
                                        'Name' => '_Bool',
                                        'Size' => '1',
                                        'Type' => 'Intrinsic'
                                      },
                          '104750' => {
                                        'BaseType' => '420',
                                        'Name' => 'uint16_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108347' => {
                                        'BaseType' => '108358',
                                        'Header' => 'http.h',
                                        'Line' => '183',
                                        'Name' => 'evhttp_bound_socket_foreach_fn',
                                        'Type' => 'Typedef'
                                      },
                          '108358' => {
                                        'Name' => 'void(struct evhttp_bound_socket*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '78828'
                                                            },
                                                     '1' => {
                                                              'type' => '183'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'Func'
                                      },
                          '109' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '109755' => {
                                        'BaseType' => '77948',
                                        'Name' => 'struct evhttp_request const',
                                        'Size' => '216',
                                        'Type' => 'Const'
                                      },
                          '110191' => {
                                        'BaseType' => '77344',
                                        'Name' => 'struct evkeyvalq const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '110333' => {
                                        'BaseType' => '81779',
                                        'Name' => 'struct evhttp_uri const',
                                        'Size' => '72',
                                        'Type' => 'Const'
                                      },
                          '1116' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '113195' => {
                                        'BaseType' => '345',
                                        'Name' => 'char const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115050' => {
                                        'BaseType' => '110333',
                                        'Name' => 'struct evhttp_uri const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116' => {
                                     'BaseType' => '109',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '121' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '123466' => {
                                        'BaseType' => '109755',
                                        'Name' => 'struct evhttp_request const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '129069' => {
                                        'BaseType' => '108347',
                                        'Name' => 'evhttp_bound_socket_foreach_fn*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1382' => {
                                      'BaseType' => '52',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '139' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '140',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1393' => {
                                      'Header' => 'socket.h',
                                      'Line' => '175',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_data',
                                                           'offset' => '2',
                                                           'type' => '1435'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1430' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '1435' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[14]',
                                      'Size' => '14',
                                      'Type' => 'Array'
                                    },
                          '1451' => {
                                      'Header' => 'socket.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1500'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '146056' => {
                                        'BaseType' => '110191',
                                        'Name' => 'struct evkeyvalq const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1500' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '1516' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '161' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '148',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1611' => {
                                      'Header' => 'in.h',
                                      'Line' => '237',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin_addr',
                                                           'offset' => '4',
                                                           'type' => '2223'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin_zero',
                                                           'offset' => '8',
                                                           'type' => '2406'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1688' => {
                                      'Header' => 'in.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin6_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin6_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6_flowinfo',
                                                           'offset' => '4',
                                                           'type' => '436'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin6_addr',
                                                           'offset' => '8',
                                                           'type' => '2354'
                                                         },
                                                  '4' => {
                                                           'name' => 'sin6_scope_id',
                                                           'offset' => '24',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in6',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '172' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '150',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '183' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '190' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '201' => {
                                     'BaseType' => '212',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2069' => {
                                      'BaseType' => '1430',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20823' => {
                                       'BaseType' => '273',
                                       'Name' => 'struct timeval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '212' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '219' => {
                                     'BaseType' => '212',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2212' => {
                                      'BaseType' => '436',
                                      'Header' => 'in.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2223' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '2212'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '224' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '197',
                                     'Name' => '__socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2248' => {
                                      'BaseType' => '2223',
                                      'Name' => 'struct in_addr const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '2253' => {
                                      'BaseType' => '420',
                                      'Header' => 'in.h',
                                      'Line' => '119',
                                      'Name' => 'in_port_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2264' => {
                                      'Header' => 'in.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '2306'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '2322'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '2338'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-213',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '2306' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2322' => {
                                      'BaseType' => '420',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2338' => {
                                      'BaseType' => '436',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '235' => {
                                     'BaseType' => '139',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2354' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '2264'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2379' => {
                                      'BaseType' => '2354',
                                      'Name' => 'struct in6_addr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '2406' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '2422' => {
                                      'Header' => 'netdb.h',
                                      'Line' => '565',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ai_flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ai_family',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'ai_socktype',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ai_protocol',
                                                           'offset' => '12',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'ai_addrlen',
                                                           'offset' => '16',
                                                           'type' => '481'
                                                         },
                                                  '5' => {
                                                           'name' => 'ai_addr',
                                                           'offset' => '24',
                                                           'type' => '1516'
                                                         },
                                                  '6' => {
                                                           'name' => 'ai_canonname',
                                                           'offset' => '32',
                                                           'type' => '201'
                                                         },
                                                  '7' => {
                                                           'name' => 'ai_next',
                                                           'offset' => '40',
                                                           'type' => '2545'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '246' => {
                                     'BaseType' => '190',
                                     'Header' => 'types.h',
                                     'Line' => '109',
                                     'Name' => 'ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2540' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '25409' => {
                                       'BaseType' => '2379',
                                       'Name' => 'struct in6_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2545' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2551' => {
                                      'BaseType' => '2540',
                                      'Name' => 'struct addrinfo const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '257' => {
                                     'BaseType' => '66',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '26264' => {
                                       'BaseType' => '2248',
                                       'Name' => 'struct in_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2651' => {
                                      'BaseType' => '2657',
                                      'Name' => 'struct evbuffer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2657' => {
                                      'Header' => 'buffer.h',
                                      'Name' => 'struct evbuffer',
                                      'Type' => 'Struct'
                                    },
                          '2662' => {
                                      'BaseType' => '2668',
                                      'Name' => 'struct bufferevent*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2668' => {
                                      'Header' => 'bufferevent_struct.h',
                                      'Line' => '70',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '0',
                                                           'type' => '3647'
                                                         },
                                                  '1' => {
                                                           'name' => 'be_ops',
                                                           'offset' => '8',
                                                           'type' => '101230'
                                                         },
                                                  '10' => {
                                                            'name' => 'errorcb',
                                                            'offset' => '320',
                                                            'type' => '97259'
                                                          },
                                                  '11' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '328',
                                                            'type' => '183'
                                                          },
                                                  '12' => {
                                                            'name' => 'timeout_read',
                                                            'offset' => '336',
                                                            'type' => '273'
                                                          },
                                                  '13' => {
                                                            'name' => 'timeout_write',
                                                            'offset' => '352',
                                                            'type' => '273'
                                                          },
                                                  '14' => {
                                                            'name' => 'enabled',
                                                            'offset' => '368',
                                                            'type' => '91'
                                                          },
                                                  '2' => {
                                                           'name' => 'ev_read',
                                                           'offset' => '16',
                                                           'type' => '3077'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_write',
                                                           'offset' => '136',
                                                           'type' => '3077'
                                                         },
                                                  '4' => {
                                                           'name' => 'input',
                                                           'offset' => '256',
                                                           'type' => '2651'
                                                         },
                                                  '5' => {
                                                           'name' => 'output',
                                                           'offset' => '264',
                                                           'type' => '2651'
                                                         },
                                                  '6' => {
                                                           'name' => 'wm_read',
                                                           'offset' => '272',
                                                           'type' => '101059'
                                                         },
                                                  '7' => {
                                                           'name' => 'wm_write',
                                                           'offset' => '288',
                                                           'type' => '101059'
                                                         },
                                                  '8' => {
                                                           'name' => 'readcb',
                                                           'offset' => '304',
                                                           'type' => '97015'
                                                         },
                                                  '9' => {
                                                           'name' => 'writecb',
                                                           'offset' => '312',
                                                           'type' => '97015'
                                                         }
                                                },
                                      'Name' => 'struct bufferevent',
                                      'Size' => '376',
                                      'Type' => 'Struct'
                                    },
                          '2715' => {
                                      'BaseType' => '2726',
                                      'Header' => 'dns.h',
                                      'Line' => '249',
                                      'Name' => 'evdns_callback_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2726' => {
                                      'Name' => 'void(*)(int, char, int, int, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '212'
                                                          },
                                                   '2' => {
                                                            'type' => '109'
                                                          },
                                                   '3' => {
                                                            'type' => '109'
                                                          },
                                                   '4' => {
                                                            'type' => '183'
                                                          },
                                                   '5' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '273' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '161'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '172'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '2768' => {
                                      'BaseType' => '2780',
                                      'Header' => 'dns.h',
                                      'Line' => '614',
                                      'Name' => 'evdns_debug_log_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2780' => {
                                      'Name' => 'void(*)(int, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '345'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2802' => {
                                      'BaseType' => '2814',
                                      'Header' => 'dns.h',
                                      'Line' => '645',
                                      'Name' => 'evdns_request_callback_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2814' => {
                                      'Name' => 'void(*)(struct evdns_server_request*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2836'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2836' => {
                                      'BaseType' => '2842',
                                      'Name' => 'struct evdns_server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2842' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '56',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'nquestions',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'questions',
                                                           'offset' => '8',
                                                           'type' => '3010'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_request',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2891' => {
                                      'Header' => 'dns.h',
                                      'Line' => '709',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EVDNS_SOPT_TCP_MAX_CLIENTS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'EVDNS_SOPT_TCP_IDLE_TIMEOUT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum evdns_server_option',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2922' => {
                                      'BaseType' => '2934',
                                      'Header' => 'dns.h',
                                      'Line' => '772',
                                      'Name' => 'evdns_getaddrinfo_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2934' => {
                                      'Name' => 'void(*)(int, struct addrinfo*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '2545'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2961' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '61',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'class',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_question',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '3010' => {
                                      'BaseType' => '3016',
                                      'Name' => 'struct evdns_server_question**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3016' => {
                                      'BaseType' => '2961',
                                      'Name' => 'struct evdns_server_question*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3022' => {
                                      'Name' => 'void(*)(int, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '91'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3049' => {
                                      'Name' => 'void(*)(struct event*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3071'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3071' => {
                                      'BaseType' => '3077',
                                      'Name' => 'struct event*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3077' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '123',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_evcallback',
                                                           'offset' => '0',
                                                           'type' => '3224'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout_pos',
                                                           'offset' => '40',
                                                           'type' => '3435'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_fd',
                                                           'offset' => '56',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_events',
                                                           'offset' => '60',
                                                           'type' => '91'
                                                         },
                                                  '4' => {
                                                           'name' => 'ev_res',
                                                           'offset' => '62',
                                                           'type' => '91'
                                                         },
                                                  '5' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '64',
                                                           'type' => '3647'
                                                         },
                                                  '6' => {
                                                           'name' => 'ev_',
                                                           'offset' => '72',
                                                           'type' => '3616'
                                                         },
                                                  '7' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '104',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct event',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '310' => {
                                     'BaseType' => '273',
                                     'Name' => 'struct timeval const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '3186' => {
                                      'Header' => 'event.h',
                                      'Name' => 'struct event_base',
                                      'Type' => 'Struct'
                                    },
                          '3191' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '3309'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3315'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-108',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3224' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '107',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_active_next',
                                                           'offset' => '0',
                                                           'type' => '3191'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_flags',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_pri',
                                                           'offset' => '18',
                                                           'type' => '404'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_closure',
                                                           'offset' => '19',
                                                           'type' => '404'
                                                         },
                                                  '4' => {
                                                           'name' => 'evcb_cb_union',
                                                           'offset' => '24',
                                                           'type' => '3321'
                                                         },
                                                  '5' => {
                                                           'name' => 'evcb_arg',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct event_callback',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3309' => {
                                      'BaseType' => '3224',
                                      'Name' => 'struct event_callback*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3315' => {
                                      'BaseType' => '3309',
                                      'Name' => 'struct event_callback**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3321' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_callback',
                                                           'offset' => '0',
                                                           'type' => '3022'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_selfcb',
                                                           'offset' => '0',
                                                           'type' => '3390'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_evfinalize',
                                                           'offset' => '0',
                                                           'type' => '3049'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_cbfinalize',
                                                           'offset' => '0',
                                                           'type' => '3390'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-113',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3390' => {
                                      'Name' => 'void(*)(struct event_callback*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3309'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3396' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-128',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3429' => {
                                      'BaseType' => '3071',
                                      'Name' => 'struct event**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3435' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '127',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_next_with_common_timeout',
                                                           'offset' => '0',
                                                           'type' => '3396'
                                                         },
                                                  '1' => {
                                                           'name' => 'min_heap_idx',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-127',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '345' => {
                                     'BaseType' => '219',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3466' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '141',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-141',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3499' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '140',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io_next',
                                                           'offset' => '0',
                                                           'type' => '3466'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '16',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-140',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '351' => {
                                     'BaseType' => '345',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '3532' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '147',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-147',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3565' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_signal_next',
                                                           'offset' => '0',
                                                           'type' => '3532'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_ncalls',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_pncalls',
                                                           'offset' => '24',
                                                           'type' => '3610'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-146',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3610' => {
                                      'BaseType' => '91',
                                      'Name' => 'short*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3616' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '138',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io',
                                                           'offset' => '0',
                                                           'type' => '3499'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_signal',
                                                           'offset' => '0',
                                                           'type' => '3565'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-138',
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '3647' => {
                                      'BaseType' => '3186',
                                      'Name' => 'struct event_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3653' => {
                                      'BaseType' => '3659',
                                      'Name' => 'struct evconnlistener*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3659' => {
                                      'Name' => 'struct evconnlistener',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '3902' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3959' => {
                                      'BaseType' => '310',
                                      'Name' => 'struct timeval const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3982' => {
                                      'Line' => '5162',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evdns_base',
                                                           'offset' => '0',
                                                           'type' => '4178'
                                                         },
                                                  '1' => {
                                                           'name' => 'hints',
                                                           'offset' => '8',
                                                           'type' => '2422'
                                                         },
                                                  '10' => {
                                                            'name' => 'pending_error',
                                                            'offset' => '248',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'user_canceled',
                                                            'offset' => '252',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_done',
                                                            'offset' => '252',
                                                            'type' => '59'
                                                          },
                                                  '2' => {
                                                           'name' => 'user_cb',
                                                           'offset' => '56',
                                                           'type' => '2922'
                                                         },
                                                  '3' => {
                                                           'name' => 'user_data',
                                                           'offset' => '64',
                                                           'type' => '183'
                                                         },
                                                  '4' => {
                                                           'name' => 'port',
                                                           'offset' => '72',
                                                           'type' => '420'
                                                         },
                                                  '5' => {
                                                           'name' => 'ipv4_request',
                                                           'offset' => '80',
                                                           'type' => '6828'
                                                         },
                                                  '6' => {
                                                           'name' => 'ipv6_request',
                                                           'offset' => '96',
                                                           'type' => '6828'
                                                         },
                                                  '7' => {
                                                           'name' => 'cname_result',
                                                           'offset' => '112',
                                                           'type' => '201'
                                                         },
                                                  '8' => {
                                                           'name' => 'pending_result',
                                                           'offset' => '120',
                                                           'type' => '2545'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout',
                                                           'offset' => '128',
                                                           'type' => '3077'
                                                         }
                                                },
                                      'Name' => 'struct evdns_getaddrinfo_request',
                                      'PrivateABI' => 1,
                                      'Size' => '256',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '404' => {
                                     'BaseType' => '80',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '4172' => {
                                      'BaseType' => '3982',
                                      'Name' => 'struct evdns_getaddrinfo_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4178' => {
                                      'BaseType' => '4184',
                                      'Name' => 'struct evdns_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4184' => {
                                      'Line' => '360',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'req_heads',
                                                           'offset' => '0',
                                                           'type' => '6551'
                                                         },
                                                  '1' => {
                                                           'name' => 'req_waiting_head',
                                                           'offset' => '8',
                                                           'type' => '5271'
                                                         },
                                                  '10' => {
                                                            'name' => 'global_max_reissues',
                                                            'offset' => '72',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'global_max_retransmits',
                                                            'offset' => '76',
                                                            'type' => '109'
                                                          },
                                                  '12' => {
                                                            'name' => 'global_max_nameserver_timeout',
                                                            'offset' => '80',
                                                            'type' => '109'
                                                          },
                                                  '13' => {
                                                            'name' => 'global_randomize_case',
                                                            'offset' => '84',
                                                            'type' => '109'
                                                          },
                                                  '14' => {
                                                            'name' => 'global_max_udp_size',
                                                            'offset' => '88',
                                                            'type' => '420'
                                                          },
                                                  '15' => {
                                                            'name' => 'global_nameserver_probe_initial_timeout',
                                                            'offset' => '96',
                                                            'type' => '273'
                                                          },
                                                  '16' => {
                                                            'name' => 'global_tcp_flags',
                                                            'offset' => '112',
                                                            'type' => '420'
                                                          },
                                                  '17' => {
                                                            'name' => 'global_tcp_idle_timeout',
                                                            'offset' => '120',
                                                            'type' => '273'
                                                          },
                                                  '18' => {
                                                            'name' => 'global_outgoing_address',
                                                            'offset' => '136',
                                                            'type' => '1451'
                                                          },
                                                  '19' => {
                                                            'name' => 'global_outgoing_addrlen',
                                                            'offset' => '264',
                                                            'type' => '481'
                                                          },
                                                  '2' => {
                                                           'name' => 'server_head',
                                                           'offset' => '16',
                                                           'type' => '5612'
                                                         },
                                                  '20' => {
                                                            'name' => 'global_getaddrinfo_allow_skew',
                                                            'offset' => '272',
                                                            'type' => '273'
                                                          },
                                                  '21' => {
                                                            'name' => 'so_rcvbuf',
                                                            'offset' => '288',
                                                            'type' => '109'
                                                          },
                                                  '22' => {
                                                            'name' => 'so_sndbuf',
                                                            'offset' => '292',
                                                            'type' => '109'
                                                          },
                                                  '23' => {
                                                            'name' => 'getaddrinfo_ipv4_timeouts',
                                                            'offset' => '296',
                                                            'type' => '109'
                                                          },
                                                  '24' => {
                                                            'name' => 'getaddrinfo_ipv6_timeouts',
                                                            'offset' => '300',
                                                            'type' => '109'
                                                          },
                                                  '25' => {
                                                            'name' => 'getaddrinfo_ipv4_answered',
                                                            'offset' => '304',
                                                            'type' => '109'
                                                          },
                                                  '26' => {
                                                            'name' => 'getaddrinfo_ipv6_answered',
                                                            'offset' => '308',
                                                            'type' => '109'
                                                          },
                                                  '27' => {
                                                            'name' => 'global_search_state',
                                                            'offset' => '312',
                                                            'type' => '5353'
                                                          },
                                                  '28' => {
                                                            'name' => 'hostsdb',
                                                            'offset' => '320',
                                                            'type' => '6433'
                                                          },
                                                  '29' => {
                                                            'name' => 'lock',
                                                            'offset' => '336',
                                                            'type' => '183'
                                                          },
                                                  '3' => {
                                                           'name' => 'n_req_heads',
                                                           'offset' => '24',
                                                           'type' => '109'
                                                         },
                                                  '30' => {
                                                            'name' => 'disable_when_inactive',
                                                            'offset' => '344',
                                                            'type' => '109'
                                                          },
                                                  '31' => {
                                                            'name' => 'ns_max_probe_timeout',
                                                            'offset' => '348',
                                                            'type' => '109'
                                                          },
                                                  '32' => {
                                                            'name' => 'ns_timeout_backoff_factor',
                                                            'offset' => '352',
                                                            'type' => '109'
                                                          },
                                                  '4' => {
                                                           'name' => 'event_base',
                                                           'offset' => '32',
                                                           'type' => '3647'
                                                         },
                                                  '5' => {
                                                           'name' => 'global_good_nameservers',
                                                           'offset' => '40',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'global_requests_inflight',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'global_requests_waiting',
                                                           'offset' => '48',
                                                           'type' => '109'
                                                         },
                                                  '8' => {
                                                           'name' => 'global_max_requests_inflight',
                                                           'offset' => '52',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'global_timeout',
                                                           'offset' => '56',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct evdns_base',
                                      'PrivateABI' => 1,
                                      'Size' => '360',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '420' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '436' => {
                                     'BaseType' => '121',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '43674' => {
                                       'BaseType' => '2223',
                                       'Name' => 'struct in_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '447' => {
                                     'BaseType' => '458',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '458' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '4702' => {
                                      'Line' => '177',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'a',
                                                           'offset' => '0',
                                                           'type' => '4753'
                                                         },
                                                  '1' => {
                                                           'name' => 'aaaa',
                                                           'offset' => '0',
                                                           'type' => '4759'
                                                         },
                                                  '2' => {
                                                           'name' => 'ptr_name',
                                                           'offset' => '0',
                                                           'type' => '201'
                                                         },
                                                  '3' => {
                                                           'name' => 'raw',
                                                           'offset' => '0',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'anon-union-evdns.c-177',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Union'
                                    },
                          '4753' => {
                                      'BaseType' => '436',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4759' => {
                                      'BaseType' => '2354',
                                      'Name' => 'struct in6_addr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4765' => {
                                      'Line' => '173',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '59'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'have_answer',
                                                           'offset' => '4',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'rr_count',
                                                           'offset' => '8',
                                                           'type' => '436'
                                                         },
                                                  '3' => {
                                                           'name' => 'data',
                                                           'offset' => '16',
                                                           'type' => '4702'
                                                         },
                                                  '4' => {
                                                           'name' => 'cname',
                                                           'offset' => '24',
                                                           'type' => '201'
                                                         }
                                                },
                                      'Name' => 'struct reply',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '481' => {
                                     'BaseType' => '224',
                                     'Header' => 'unistd.h',
                                     'Line' => '277',
                                     'Name' => 'socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4841' => {
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'current_req',
                                                           'offset' => '0',
                                                           'type' => '5271'
                                                         },
                                                  '1' => {
                                                           'name' => 'base',
                                                           'offset' => '8',
                                                           'type' => '4178'
                                                         },
                                                  '10' => {
                                                            'name' => 'reply',
                                                            'offset' => '96',
                                                            'type' => '4765'
                                                          },
                                                  '11' => {
                                                            'name' => 'search_index',
                                                            'offset' => '128',
                                                            'type' => '109'
                                                          },
                                                  '12' => {
                                                            'name' => 'search_state',
                                                            'offset' => '136',
                                                            'type' => '5353'
                                                          },
                                                  '13' => {
                                                            'name' => 'search_origname',
                                                            'offset' => '144',
                                                            'type' => '201'
                                                          },
                                                  '14' => {
                                                            'name' => 'search_flags',
                                                            'offset' => '152',
                                                            'type' => '109'
                                                          },
                                                  '15' => {
                                                            'name' => 'tcp_flags',
                                                            'offset' => '156',
                                                            'type' => '420'
                                                          },
                                                  '2' => {
                                                           'name' => 'pending_cb',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'deferred',
                                                           'offset' => '24',
                                                           'type' => '3224'
                                                         },
                                                  '4' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '64',
                                                           'type' => '2715'
                                                         },
                                                  '5' => {
                                                           'name' => 'user_pointer',
                                                           'offset' => '72',
                                                           'type' => '183'
                                                         },
                                                  '6' => {
                                                           'name' => 'request_type',
                                                           'offset' => '80',
                                                           'type' => '404'
                                                         },
                                                  '7' => {
                                                           'name' => 'have_reply',
                                                           'offset' => '81',
                                                           'type' => '404'
                                                         },
                                                  '8' => {
                                                           'name' => 'ttl',
                                                           'offset' => '84',
                                                           'type' => '436'
                                                         },
                                                  '9' => {
                                                           'name' => 'err',
                                                           'offset' => '88',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct evdns_request',
                                      'PrivateABI' => 1,
                                      'Size' => '160',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5046' => {
                                      'Line' => '216',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'request',
                                                           'offset' => '0',
                                                           'type' => '5364'
                                                         },
                                                  '1' => {
                                                           'name' => 'request_size',
                                                           'offset' => '8',
                                                           'type' => '420'
                                                         },
                                                  '10' => {
                                                            'name' => 'trans_id',
                                                            'offset' => '168',
                                                            'type' => '420'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_appended',
                                                            'offset' => '168',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'transmit_me',
                                                            'offset' => '168',
                                                            'type' => '59'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'need_cname',
                                                            'offset' => '168',
                                                            'type' => '59'
                                                          },
                                                  '14' => {
                                                            'name' => 'put_cname_in_ptr',
                                                            'offset' => '176',
                                                            'type' => '505'
                                                          },
                                                  '15' => {
                                                            'name' => 'base',
                                                            'offset' => '184',
                                                            'type' => '4178'
                                                          },
                                                  '16' => {
                                                            'name' => 'handle',
                                                            'offset' => '192',
                                                            'type' => '5623'
                                                          },
                                                  '2' => {
                                                           'name' => 'request_type',
                                                           'offset' => '10',
                                                           'type' => '404'
                                                         },
                                                  '3' => {
                                                           'name' => 'request_len',
                                                           'offset' => '12',
                                                           'type' => '59'
                                                         },
                                                  '4' => {
                                                           'name' => 'reissue_count',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'tx_count',
                                                           'offset' => '20',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'ns',
                                                           'offset' => '24',
                                                           'type' => '5612'
                                                         },
                                                  '7' => {
                                                           'name' => 'next',
                                                           'offset' => '32',
                                                           'type' => '5271'
                                                         },
                                                  '8' => {
                                                           'name' => 'prev',
                                                           'offset' => '40',
                                                           'type' => '5271'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout_event',
                                                           'offset' => '48',
                                                           'type' => '3077'
                                                         }
                                                },
                                      'Name' => 'struct request',
                                      'PrivateABI' => 1,
                                      'Size' => '200',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '505' => {
                                     'BaseType' => '201',
                                     'Name' => 'char**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '5271' => {
                                      'BaseType' => '5046',
                                      'Name' => 'struct request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5282' => {
                                      'Line' => '3852',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'refcount',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ndots',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'num_domains',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'head',
                                                           'offset' => '16',
                                                           'type' => '6822'
                                                         }
                                                },
                                      'Name' => 'struct search_state',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5353' => {
                                      'BaseType' => '5282',
                                      'Name' => 'struct search_state*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5364' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5375' => {
                                      'Line' => '264',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'connection',
                                                           'offset' => '8',
                                                           'type' => '6035'
                                                         },
                                                  '10' => {
                                                            'name' => 'probe_request',
                                                            'offset' => '416',
                                                            'type' => '5623'
                                                          },
                                                  '11' => {
                                                            'name' => 'state',
                                                            'offset' => '424',
                                                            'type' => '212'
                                                          },
                                                  '12' => {
                                                            'name' => 'choked',
                                                            'offset' => '425',
                                                            'type' => '212'
                                                          },
                                                  '13' => {
                                                            'name' => 'write_waiting',
                                                            'offset' => '426',
                                                            'type' => '212'
                                                          },
                                                  '14' => {
                                                            'name' => 'base',
                                                            'offset' => '432',
                                                            'type' => '4178'
                                                          },
                                                  '15' => {
                                                            'name' => 'requests_inflight',
                                                            'offset' => '440',
                                                            'type' => '109'
                                                          },
                                                  '2' => {
                                                           'name' => 'address',
                                                           'offset' => '16',
                                                           'type' => '1451'
                                                         },
                                                  '3' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '144',
                                                           'type' => '481'
                                                         },
                                                  '4' => {
                                                           'name' => 'failed_times',
                                                           'offset' => '148',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'timedout',
                                                           'offset' => '152',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'event',
                                                           'offset' => '160',
                                                           'type' => '3077'
                                                         },
                                                  '7' => {
                                                           'name' => 'next',
                                                           'offset' => '280',
                                                           'type' => '5612'
                                                         },
                                                  '8' => {
                                                           'name' => 'prev',
                                                           'offset' => '288',
                                                           'type' => '5612'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout_event',
                                                           'offset' => '296',
                                                           'type' => '3077'
                                                         }
                                                },
                                      'Name' => 'struct nameserver',
                                      'PrivateABI' => 1,
                                      'Size' => '448',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5612' => {
                                      'BaseType' => '5375',
                                      'Name' => 'struct nameserver*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5623' => {
                                      'BaseType' => '4841',
                                      'Name' => 'struct evdns_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5634' => {
                                      'Line' => '244',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'TS_DISCONNECTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'TS_CONNECTING',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'TS_CONNECTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum tcp_state',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Enum'
                                    },
                          '5670' => {
                                      'Line' => '250',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bev',
                                                           'offset' => '0',
                                                           'type' => '2662'
                                                         },
                                                  '1' => {
                                                           'name' => 'state',
                                                           'offset' => '8',
                                                           'type' => '5634'
                                                         },
                                                  '2' => {
                                                           'name' => 'awaiting_packet_size',
                                                           'offset' => '12',
                                                           'type' => '420'
                                                         }
                                                },
                                      'Name' => 'struct tcp_connection',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5719' => {
                                      'Line' => '259',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '5808'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '5814'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evdns.c-259',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5755' => {
                                      'Line' => '258',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '5719'
                                                         },
                                                  '1' => {
                                                           'name' => 'connection',
                                                           'offset' => '16',
                                                           'type' => '5670'
                                                         },
                                                  '2' => {
                                                           'name' => 'port',
                                                           'offset' => '32',
                                                           'type' => '6029'
                                                         }
                                                },
                                      'Name' => 'struct client_tcp_connection',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5808' => {
                                      'BaseType' => '5755',
                                      'Name' => 'struct client_tcp_connection*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5814' => {
                                      'BaseType' => '5808',
                                      'Name' => 'struct client_tcp_connection**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5820' => {
                                      'Line' => '291',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '10' => {
                                                            'name' => 'client_connections',
                                                            'offset' => '176',
                                                            'type' => '6041'
                                                          },
                                                  '11' => {
                                                            'name' => 'client_connections_count',
                                                            'offset' => '184',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_client_connections',
                                                            'offset' => '188',
                                                            'type' => '59'
                                                          },
                                                  '13' => {
                                                            'name' => 'tcp_idle_timeout',
                                                            'offset' => '192',
                                                            'type' => '273'
                                                          },
                                                  '14' => {
                                                            'name' => 'lock',
                                                            'offset' => '208',
                                                            'type' => '183'
                                                          },
                                                  '2' => {
                                                           'name' => 'choked',
                                                           'offset' => '8',
                                                           'type' => '212'
                                                         },
                                                  '3' => {
                                                           'name' => 'closing',
                                                           'offset' => '9',
                                                           'type' => '212'
                                                         },
                                                  '4' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '16',
                                                           'type' => '2802'
                                                         },
                                                  '5' => {
                                                           'name' => 'user_data',
                                                           'offset' => '24',
                                                           'type' => '183'
                                                         },
                                                  '6' => {
                                                           'name' => 'event',
                                                           'offset' => '32',
                                                           'type' => '3077'
                                                         },
                                                  '7' => {
                                                           'name' => 'pending_replies',
                                                           'offset' => '152',
                                                           'type' => '6303'
                                                         },
                                                  '8' => {
                                                           'name' => 'event_base',
                                                           'offset' => '160',
                                                           'type' => '3647'
                                                         },
                                                  '9' => {
                                                           'name' => 'listener',
                                                           'offset' => '168',
                                                           'type' => '3653'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_port',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6029' => {
                                      'BaseType' => '5820',
                                      'Name' => 'struct evdns_server_port*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6035' => {
                                      'BaseType' => '5670',
                                      'Name' => 'struct tcp_connection*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6041' => {
                                      'Line' => '305',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lh_first',
                                                           'offset' => '0',
                                                           'type' => '5808'
                                                         }
                                                },
                                      'Name' => 'struct client_list',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6068' => {
                                      'Line' => '329',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_pending',
                                                           'offset' => '0',
                                                           'type' => '6303'
                                                         },
                                                  '1' => {
                                                           'name' => 'prev_pending',
                                                           'offset' => '8',
                                                           'type' => '6303'
                                                         },
                                                  '10' => {
                                                            'name' => 'n_additional',
                                                            'offset' => '184',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'answer',
                                                            'offset' => '192',
                                                            'type' => '6427'
                                                          },
                                                  '12' => {
                                                            'name' => 'authority',
                                                            'offset' => '200',
                                                            'type' => '6427'
                                                          },
                                                  '13' => {
                                                            'name' => 'additional',
                                                            'offset' => '208',
                                                            'type' => '6427'
                                                          },
                                                  '14' => {
                                                            'name' => 'response',
                                                            'offset' => '216',
                                                            'type' => '201'
                                                          },
                                                  '15' => {
                                                            'name' => 'response_len',
                                                            'offset' => '224',
                                                            'type' => '257'
                                                          },
                                                  '16' => {
                                                            'name' => 'base',
                                                            'offset' => '232',
                                                            'type' => '2842'
                                                          },
                                                  '2' => {
                                                           'name' => 'trans_id',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'port',
                                                           'offset' => '24',
                                                           'type' => '6029'
                                                         },
                                                  '4' => {
                                                           'name' => 'client',
                                                           'offset' => '32',
                                                           'type' => '5808'
                                                         },
                                                  '5' => {
                                                           'name' => 'addr',
                                                           'offset' => '40',
                                                           'type' => '1451'
                                                         },
                                                  '6' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '168',
                                                           'type' => '481'
                                                         },
                                                  '7' => {
                                                           'name' => 'max_udp_reply_size',
                                                           'offset' => '172',
                                                           'type' => '420'
                                                         },
                                                  '8' => {
                                                           'name' => 'n_answer',
                                                           'offset' => '176',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'n_authority',
                                                           'offset' => '180',
                                                           'type' => '109'
                                                         }
                                                },
                                      'Name' => 'struct server_request',
                                      'PrivateABI' => 1,
                                      'Size' => '248',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6303' => {
                                      'BaseType' => '6068',
                                      'Name' => 'struct server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6309' => {
                                      'Line' => '316',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '6427'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '201'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'class',
                                                           'offset' => '18',
                                                           'type' => '420'
                                                         },
                                                  '4' => {
                                                           'name' => 'ttl',
                                                           'offset' => '20',
                                                           'type' => '436'
                                                         },
                                                  '5' => {
                                                           'name' => 'is_name',
                                                           'offset' => '24',
                                                           'type' => '212'
                                                         },
                                                  '6' => {
                                                           'name' => 'datalen',
                                                           'offset' => '26',
                                                           'type' => '420'
                                                         },
                                                  '7' => {
                                                           'name' => 'data',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct server_reply_item',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6427' => {
                                      'BaseType' => '6309',
                                      'Name' => 'struct server_reply_item*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6433' => {
                                      'Line' => '423',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqh_first',
                                                           'offset' => '0',
                                                           'type' => '6539'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqh_last',
                                                           'offset' => '8',
                                                           'type' => '6545'
                                                         }
                                                },
                                      'Name' => 'struct hosts_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6473' => {
                                      'Line' => '439',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '6557'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '6593'
                                                         },
                                                  '2' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'hostname',
                                                           'offset' => '48',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct hosts_entry',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6539' => {
                                      'BaseType' => '6473',
                                      'Name' => 'struct hosts_entry*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6545' => {
                                      'BaseType' => '6539',
                                      'Name' => 'struct hosts_entry**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6551' => {
                                      'BaseType' => '5271',
                                      'Name' => 'struct request**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6557' => {
                                      'Line' => '440',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '6539'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '6545'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evdns.c-440',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6593' => {
                                      'Line' => '441',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa',
                                                           'offset' => '0',
                                                           'type' => '1393'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin',
                                                           'offset' => '0',
                                                           'type' => '1611'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6',
                                                           'offset' => '0',
                                                           'type' => '1688'
                                                         }
                                                },
                                      'Name' => 'anon-union-evdns.c-441',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Union'
                                    },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '66830' => {
                                       'BaseType' => '66',
                                       'Header' => 'types.h',
                                       'Line' => '44',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '6782' => {
                                      'Line' => '3846',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'len',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '6822'
                                                         }
                                                },
                                      'Name' => 'struct search_domain',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '67869' => {
                                       'BaseType' => '66830',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '6822' => {
                                      'BaseType' => '6782',
                                      'Name' => 'struct search_domain*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6828' => {
                                      'Line' => '5156',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'r',
                                                           'offset' => '0',
                                                           'type' => '5623'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct getaddrinfo_subrequest',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '69943' => {
                                       'BaseType' => '67869',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75107' => {
                                       'BaseType' => '132',
                                       'Header' => 'types.h',
                                       'Line' => '43',
                                       'Name' => '__int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '75216' => {
                                       'BaseType' => '75107',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '27',
                                       'Name' => 'int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '77250' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '77332'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '77338'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-keyvalq_struct.h-59',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '77283' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '77250'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '24',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyval',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '77332' => {
                                       'BaseType' => '77283',
                                       'Name' => 'struct evkeyval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77338' => {
                                       'BaseType' => '77332',
                                       'Name' => 'struct evkeyval**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77344' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '77332'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '77338'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyvalq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '77843' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '472',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_INPUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_OUTPUT',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_TYPE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '77874' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '490',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_TERMINATE',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_CONTINUE',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVRPC_PAUSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_RESULT',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '77911' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'error',
                                                            'offset' => '0',
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_req',
                                                            'offset' => '8',
                                                            'type' => '78326'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_status',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '77948' => {
                                       'Header' => 'http_struct.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '81740'
                                                          },
                                                   '1' => {
                                                            'name' => 'evcon',
                                                            'offset' => '16',
                                                            'type' => '79705'
                                                          },
                                                   '10' => {
                                                             'name' => 'headers_size',
                                                             'offset' => '80',
                                                             'type' => '257'
                                                           },
                                                   '11' => {
                                                             'name' => 'body_size',
                                                             'offset' => '88',
                                                             'type' => '257'
                                                           },
                                                   '12' => {
                                                             'name' => 'uri',
                                                             'offset' => '96',
                                                             'type' => '201'
                                                           },
                                                   '13' => {
                                                             'name' => 'uri_elems',
                                                             'offset' => '104',
                                                             'type' => '81784'
                                                           },
                                                   '14' => {
                                                             'name' => 'major',
                                                             'offset' => '112',
                                                             'type' => '212'
                                                           },
                                                   '15' => {
                                                             'name' => 'minor',
                                                             'offset' => '113',
                                                             'type' => '212'
                                                           },
                                                   '16' => {
                                                             'name' => 'response_code',
                                                             'offset' => '116',
                                                             'type' => '109'
                                                           },
                                                   '17' => {
                                                             'name' => 'response_code_line',
                                                             'offset' => '120',
                                                             'type' => '201'
                                                           },
                                                   '18' => {
                                                             'name' => 'input_buffer',
                                                             'offset' => '128',
                                                             'type' => '2651'
                                                           },
                                                   '19' => {
                                                             'name' => 'ntoread',
                                                             'offset' => '136',
                                                             'type' => '75216'
                                                           },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '24',
                                                            'type' => '109'
                                                          },
                                                   '20' => {
                                                             'bitfield' => '1',
                                                             'name' => 'chunked',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '21' => {
                                                             'bitfield' => '1',
                                                             'name' => 'userdone',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '22' => {
                                                             'name' => 'output_buffer',
                                                             'offset' => '152',
                                                             'type' => '2651'
                                                           },
                                                   '23' => {
                                                             'name' => 'cb',
                                                             'offset' => '160',
                                                             'type' => '80261'
                                                           },
                                                   '24' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '168',
                                                             'type' => '183'
                                                           },
                                                   '25' => {
                                                             'name' => 'chunk_cb',
                                                             'offset' => '176',
                                                             'type' => '80261'
                                                           },
                                                   '26' => {
                                                             'name' => 'header_cb',
                                                             'offset' => '184',
                                                             'type' => '80723'
                                                           },
                                                   '27' => {
                                                             'name' => 'error_cb',
                                                             'offset' => '192',
                                                             'type' => '81806'
                                                           },
                                                   '28' => {
                                                             'name' => 'on_complete_cb',
                                                             'offset' => '200',
                                                             'type' => '80261'
                                                           },
                                                   '29' => {
                                                             'name' => 'on_complete_cb_arg',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '3' => {
                                                            'name' => 'input_headers',
                                                            'offset' => '32',
                                                            'type' => '81773'
                                                          },
                                                   '4' => {
                                                            'name' => 'output_headers',
                                                            'offset' => '40',
                                                            'type' => '81773'
                                                          },
                                                   '5' => {
                                                            'name' => 'remote_host',
                                                            'offset' => '48',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'remote_port',
                                                            'offset' => '56',
                                                            'type' => '420'
                                                          },
                                                   '7' => {
                                                            'name' => 'host_cache',
                                                            'offset' => '64',
                                                            'type' => '201'
                                                          },
                                                   '8' => {
                                                            'name' => 'kind',
                                                            'offset' => '72',
                                                            'type' => '79122'
                                                          },
                                                   '9' => {
                                                            'name' => 'type',
                                                            'offset' => '76',
                                                            'type' => '78999'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_request',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '78326' => {
                                       'BaseType' => '77948',
                                       'Name' => 'struct evhttp_request*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78332' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '78545'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '78551'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-rpc_struct.h-70',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '78365' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '78332'
                                                          },
                                                   '1' => {
                                                            'name' => 'uri',
                                                            'offset' => '16',
                                                            'type' => '345'
                                                          },
                                                   '10' => {
                                                             'name' => 'reply_marshal',
                                                             'offset' => '88',
                                                             'type' => '78654'
                                                           },
                                                   '11' => {
                                                             'name' => 'cb',
                                                             'offset' => '96',
                                                             'type' => '78767'
                                                           },
                                                   '12' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '104',
                                                             'type' => '183'
                                                           },
                                                   '13' => {
                                                             'name' => 'base',
                                                             'offset' => '112',
                                                             'type' => '78822'
                                                           },
                                                   '2' => {
                                                            'name' => 'request_new',
                                                            'offset' => '24',
                                                            'type' => '78572'
                                                          },
                                                   '3' => {
                                                            'name' => 'request_new_arg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          },
                                                   '4' => {
                                                            'name' => 'request_free',
                                                            'offset' => '40',
                                                            'type' => '3902'
                                                          },
                                                   '5' => {
                                                            'name' => 'request_unmarshal',
                                                            'offset' => '48',
                                                            'type' => '78626'
                                                          },
                                                   '6' => {
                                                            'name' => 'reply_new',
                                                            'offset' => '56',
                                                            'type' => '78572'
                                                          },
                                                   '7' => {
                                                            'name' => 'reply_new_arg',
                                                            'offset' => '64',
                                                            'type' => '183'
                                                          },
                                                   '8' => {
                                                            'name' => 'reply_free',
                                                            'offset' => '72',
                                                            'type' => '3902'
                                                          },
                                                   '9' => {
                                                            'name' => 'reply_complete',
                                                            'offset' => '80',
                                                            'type' => '78632'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '78545' => {
                                       'BaseType' => '78365',
                                       'Name' => 'struct evrpc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78551' => {
                                       'BaseType' => '78545',
                                       'Name' => 'struct evrpc**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78572' => {
                                       'Name' => 'void*(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '183',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78626' => {
                                       'Name' => 'int(*)(void*, struct evbuffer*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '2651'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78632' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78654' => {
                                       'Name' => 'void(*)(struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2651'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78676' => {
                                       'BaseType' => '78682',
                                       'Name' => 'struct evrpc_req_generic*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78682' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hook_meta',
                                                            'offset' => '0',
                                                            'type' => '81657'
                                                          },
                                                   '1' => {
                                                            'name' => 'request',
                                                            'offset' => '8',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'reply',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '3' => {
                                                            'name' => 'rpc',
                                                            'offset' => '24',
                                                            'type' => '78545'
                                                          },
                                                   '4' => {
                                                            'name' => 'http_req',
                                                            'offset' => '32',
                                                            'type' => '78326'
                                                          },
                                                   '5' => {
                                                            'name' => 'rpc_data',
                                                            'offset' => '40',
                                                            'type' => '2651'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_req_generic',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '78767' => {
                                       'Name' => 'void(*)(struct evrpc_req_generic*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78676'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78773' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '72',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'common',
                                                            'offset' => '0',
                                                            'type' => '81034'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_server',
                                                            'offset' => '48',
                                                            'type' => '80112'
                                                          },
                                                   '2' => {
                                                            'name' => 'registered_rpcs',
                                                            'offset' => '56',
                                                            'type' => '81083'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_base',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '78822' => {
                                       'BaseType' => '78773',
                                       'Name' => 'struct evrpc_base*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78828' => {
                                       'BaseType' => '78834',
                                       'Name' => 'struct evhttp_bound_socket*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78834' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '131',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80358'
                                                          },
                                                   '1' => {
                                                            'name' => 'http',
                                                            'offset' => '16',
                                                            'type' => '80112'
                                                          },
                                                   '2' => {
                                                            'name' => 'bevcb',
                                                            'offset' => '24',
                                                            'type' => '80417'
                                                          },
                                                   '3' => {
                                                            'name' => 'bevcbarg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          },
                                                   '4' => {
                                                            'name' => 'listener',
                                                            'offset' => '40',
                                                            'type' => '3653'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_bound_socket',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '78907' => {
                                       'BaseType' => '78919',
                                       'Header' => 'http.h',
                                       'Line' => '289',
                                       'Name' => 'evhttp_ext_method_cb',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '78919' => {
                                       'Name' => 'int(*)(struct evhttp_ext_method*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78940'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78940' => {
                                       'BaseType' => '78946',
                                       'Name' => 'struct evhttp_ext_method*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78946' => {
                                       'Header' => 'http.h',
                                       'Line' => '651',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'method',
                                                            'offset' => '0',
                                                            'type' => '345'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '436'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '420'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_ext_method',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '78999' => {
                                       'Header' => 'http.h',
                                       'Line' => '623',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQ_GET',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_REQ_POST',
                                                            'value' => '2'
                                                          },
                                                   '10' => {
                                                             'name' => 'EVHTTP_REQ_PROPPATCH',
                                                             'value' => '1024'
                                                           },
                                                   '11' => {
                                                             'name' => 'EVHTTP_REQ_MKCOL',
                                                             'value' => '2048'
                                                           },
                                                   '12' => {
                                                             'name' => 'EVHTTP_REQ_LOCK',
                                                             'value' => '4096'
                                                           },
                                                   '13' => {
                                                             'name' => 'EVHTTP_REQ_UNLOCK',
                                                             'value' => '8192'
                                                           },
                                                   '14' => {
                                                             'name' => 'EVHTTP_REQ_COPY',
                                                             'value' => '16384'
                                                           },
                                                   '15' => {
                                                             'name' => 'EVHTTP_REQ_MOVE',
                                                             'value' => '32768'
                                                           },
                                                   '2' => {
                                                            'name' => 'EVHTTP_REQ_HEAD',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVHTTP_REQ_PUT',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVHTTP_REQ_DELETE',
                                                            'value' => '16'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVHTTP_REQ_OPTIONS',
                                                            'value' => '32'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVHTTP_REQ_TRACE',
                                                            'value' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVHTTP_REQ_CONNECT',
                                                            'value' => '128'
                                                          },
                                                   '8' => {
                                                            'name' => 'EVHTTP_REQ_PATCH',
                                                            'value' => '256'
                                                          },
                                                   '9' => {
                                                            'name' => 'EVHTTP_REQ_PROPFIND',
                                                            'value' => '512'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_cmd_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79122' => {
                                       'Header' => 'http.h',
                                       'Line' => '660',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQUEST',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_RESPONSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_kind',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79153' => {
                                       'Header' => 'http.h',
                                       'Line' => '749',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVREQ_HTTP_TIMEOUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVREQ_HTTP_EOF',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVREQ_HTTP_INVALID_HEADER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVREQ_HTTP_BUFFER_ERROR',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVREQ_HTTP_REQUEST_CANCEL',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVREQ_HTTP_DATA_TOO_LONG',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_error',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79230' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '34',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVCON_DISCONNECTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVCON_CONNECTING',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVCON_IDLE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVCON_READING_FIRSTLINE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVCON_READING_HEADERS',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVCON_READING_BODY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVCON_READING_TRAILER',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVCON_WRITING',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_connection_state',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79296' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '52',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '79705'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '79711'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-52',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79329' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '79296'
                                                          },
                                                   '1' => {
                                                            'name' => 'bufev',
                                                            'offset' => '16',
                                                            'type' => '2662'
                                                          },
                                                   '10' => {
                                                             'name' => 'flags',
                                                             'offset' => '200',
                                                             'type' => '109'
                                                           },
                                                   '11' => {
                                                             'name' => 'timeout_connect',
                                                             'offset' => '208',
                                                             'type' => '273'
                                                           },
                                                   '12' => {
                                                             'name' => 'timeout_read',
                                                             'offset' => '224',
                                                             'type' => '273'
                                                           },
                                                   '13' => {
                                                             'name' => 'timeout_write',
                                                             'offset' => '240',
                                                             'type' => '273'
                                                           },
                                                   '14' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '256',
                                                             'type' => '109'
                                                           },
                                                   '15' => {
                                                             'name' => 'retry_max',
                                                             'offset' => '260',
                                                             'type' => '109'
                                                           },
                                                   '16' => {
                                                             'name' => 'initial_retry_timeout',
                                                             'offset' => '264',
                                                             'type' => '273'
                                                           },
                                                   '17' => {
                                                             'name' => 'state',
                                                             'offset' => '280',
                                                             'type' => '79230'
                                                           },
                                                   '18' => {
                                                             'name' => 'http_server',
                                                             'offset' => '288',
                                                             'type' => '80112'
                                                           },
                                                   '19' => {
                                                             'name' => 'requests',
                                                             'offset' => '296',
                                                             'type' => '79717'
                                                           },
                                                   '2' => {
                                                            'name' => 'retry_ev',
                                                            'offset' => '24',
                                                            'type' => '3077'
                                                          },
                                                   '20' => {
                                                             'name' => 'cb',
                                                             'offset' => '312',
                                                             'type' => '80134'
                                                           },
                                                   '21' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '320',
                                                             'type' => '183'
                                                           },
                                                   '22' => {
                                                             'name' => 'closecb',
                                                             'offset' => '328',
                                                             'type' => '80134'
                                                           },
                                                   '23' => {
                                                             'name' => 'closecb_arg',
                                                             'offset' => '336',
                                                             'type' => '183'
                                                           },
                                                   '24' => {
                                                             'name' => 'read_more_deferred_cb',
                                                             'offset' => '344',
                                                             'type' => '3224'
                                                           },
                                                   '25' => {
                                                             'name' => 'base',
                                                             'offset' => '384',
                                                             'type' => '3647'
                                                           },
                                                   '26' => {
                                                             'name' => 'dns_base',
                                                             'offset' => '392',
                                                             'type' => '4178'
                                                           },
                                                   '27' => {
                                                             'name' => 'ai_family',
                                                             'offset' => '400',
                                                             'type' => '109'
                                                           },
                                                   '28' => {
                                                             'name' => 'ext_method_cmp',
                                                             'offset' => '408',
                                                             'type' => '78907'
                                                           },
                                                   '3' => {
                                                            'name' => 'bind_address',
                                                            'offset' => '144',
                                                            'type' => '201'
                                                          },
                                                   '4' => {
                                                            'name' => 'bind_port',
                                                            'offset' => '152',
                                                            'type' => '420'
                                                          },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '160',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'port',
                                                            'offset' => '168',
                                                            'type' => '420'
                                                          },
                                                   '7' => {
                                                            'name' => 'unixsocket',
                                                            'offset' => '176',
                                                            'type' => '201'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_headers_size',
                                                            'offset' => '184',
                                                            'type' => '257'
                                                          },
                                                   '9' => {
                                                            'name' => 'max_body_size',
                                                            'offset' => '192',
                                                            'type' => '67869'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_connection',
                                       'PrivateABI' => 1,
                                       'Size' => '416',
                                       'Type' => 'Struct'
                                     },
                          '79705' => {
                                       'BaseType' => '79329',
                                       'Name' => 'struct evhttp_connection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79711' => {
                                       'BaseType' => '79705',
                                       'Name' => 'struct evhttp_connection**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79717' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '97',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78326'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '79754'
                                                          }
                                                 },
                                       'Name' => 'struct evcon_requestq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79754' => {
                                       'BaseType' => '78326',
                                       'Name' => 'struct evhttp_request**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79771' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '148',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_vhost',
                                                            'offset' => '0',
                                                            'type' => '80516'
                                                          },
                                                   '1' => {
                                                            'name' => 'sockets',
                                                            'offset' => '16',
                                                            'type' => '80555'
                                                          },
                                                   '10' => {
                                                             'name' => 'timeout_read',
                                                             'offset' => '128',
                                                             'type' => '273'
                                                           },
                                                   '11' => {
                                                             'name' => 'timeout_write',
                                                             'offset' => '144',
                                                             'type' => '273'
                                                           },
                                                   '12' => {
                                                             'name' => 'default_max_headers_size',
                                                             'offset' => '160',
                                                             'type' => '257'
                                                           },
                                                   '13' => {
                                                             'name' => 'default_max_body_size',
                                                             'offset' => '168',
                                                             'type' => '67869'
                                                           },
                                                   '14' => {
                                                             'name' => 'flags',
                                                             'offset' => '176',
                                                             'type' => '109'
                                                           },
                                                   '15' => {
                                                             'name' => 'default_content_type',
                                                             'offset' => '184',
                                                             'type' => '345'
                                                           },
                                                   '16' => {
                                                             'name' => 'allowed_methods',
                                                             'offset' => '192',
                                                             'type' => '436'
                                                           },
                                                   '17' => {
                                                             'name' => 'gencb',
                                                             'offset' => '200',
                                                             'type' => '80261'
                                                           },
                                                   '18' => {
                                                             'name' => 'gencbarg',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '19' => {
                                                             'name' => 'bevcb',
                                                             'offset' => '216',
                                                             'type' => '80417'
                                                           },
                                                   '2' => {
                                                            'name' => 'callbacks',
                                                            'offset' => '32',
                                                            'type' => '80592'
                                                          },
                                                   '20' => {
                                                             'name' => 'bevcbarg',
                                                             'offset' => '224',
                                                             'type' => '183'
                                                           },
                                                   '21' => {
                                                             'name' => 'newreqcb',
                                                             'offset' => '232',
                                                             'type' => '80723'
                                                           },
                                                   '22' => {
                                                             'name' => 'newreqcbarg',
                                                             'offset' => '240',
                                                             'type' => '183'
                                                           },
                                                   '23' => {
                                                             'name' => 'errorcb',
                                                             'offset' => '248',
                                                             'type' => '80764'
                                                           },
                                                   '24' => {
                                                             'name' => 'errorcbarg',
                                                             'offset' => '256',
                                                             'type' => '183'
                                                           },
                                                   '25' => {
                                                             'name' => 'base',
                                                             'offset' => '264',
                                                             'type' => '3647'
                                                           },
                                                   '26' => {
                                                             'name' => 'ext_method_cmp',
                                                             'offset' => '272',
                                                             'type' => '78907'
                                                           },
                                                   '3' => {
                                                            'name' => 'connections',
                                                            'offset' => '48',
                                                            'type' => '80267'
                                                          },
                                                   '4' => {
                                                            'name' => 'ws_sessions',
                                                            'offset' => '64',
                                                            'type' => '80304'
                                                          },
                                                   '5' => {
                                                            'name' => 'connection_max',
                                                            'offset' => '80',
                                                            'type' => '109'
                                                          },
                                                   '6' => {
                                                            'name' => 'connection_cnt',
                                                            'offset' => '84',
                                                            'type' => '109'
                                                          },
                                                   '7' => {
                                                            'name' => 'virtualhosts',
                                                            'offset' => '88',
                                                            'type' => '80629'
                                                          },
                                                   '8' => {
                                                            'name' => 'aliases',
                                                            'offset' => '104',
                                                            'type' => '80666'
                                                          },
                                                   '9' => {
                                                            'name' => 'vhost_pattern',
                                                            'offset' => '120',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp',
                                       'PrivateABI' => 1,
                                       'Size' => '280',
                                       'Type' => 'Struct'
                                     },
                          '80' => {
                                    'BaseType' => '45',
                                    'Header' => 'types.h',
                                    'Line' => '37',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '80112' => {
                                       'BaseType' => '79771',
                                       'Name' => 'struct evhttp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80134' => {
                                       'Name' => 'void(*)(struct evhttp_connection*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '79705'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80140' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '116',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80233'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80239'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-116',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80173' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '115',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80140'
                                                          },
                                                   '1' => {
                                                            'name' => 'what',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '80261'
                                                          },
                                                   '3' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_cb',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '80233' => {
                                       'BaseType' => '80173',
                                       'Name' => 'struct evhttp_cb*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80239' => {
                                       'BaseType' => '80233',
                                       'Name' => 'struct evhttp_cb**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80261' => {
                                       'Name' => 'void(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78326'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80267' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '79705'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '79711'
                                                          }
                                                 },
                                       'Name' => 'struct evconq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80304' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '128',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80346'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80352'
                                                          }
                                                 },
                                       'Name' => 'struct evwsq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80341' => {
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '101480'
                                                          },
                                                   '1' => {
                                                            'name' => 'bufev',
                                                            'offset' => '16',
                                                            'type' => '2662'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '98340'
                                                          },
                                                   '3' => {
                                                            'name' => 'cb_arg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          },
                                                   '4' => {
                                                            'name' => 'cbclose',
                                                            'offset' => '40',
                                                            'type' => '98520'
                                                          },
                                                   '5' => {
                                                            'name' => 'cbclose_arg',
                                                            'offset' => '48',
                                                            'type' => '183'
                                                          },
                                                   '6' => {
                                                            'name' => 'http_server',
                                                            'offset' => '56',
                                                            'type' => '80112'
                                                          },
                                                   '7' => {
                                                            'name' => 'incomplete_frames',
                                                            'offset' => '64',
                                                            'type' => '2651'
                                                          },
                                                   '8' => {
                                                            'name' => 'closed',
                                                            'offset' => '72',
                                                            'type' => '101513'
                                                          }
                                                 },
                                       'Name' => 'struct evws_connection',
                                       'PrivateABI' => 1,
                                       'Size' => '80',
                                       'Source' => 'ws.c',
                                       'Type' => 'Struct'
                                     },
                          '80346' => {
                                       'BaseType' => '80341',
                                       'Name' => 'struct evws_connection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80352' => {
                                       'BaseType' => '80346',
                                       'Name' => 'struct evws_connection**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80358' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '78828'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80391'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-132',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80391' => {
                                       'BaseType' => '78828',
                                       'Name' => 'struct evhttp_bound_socket**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80417' => {
                                       'Name' => 'struct bufferevent*(*)(struct event_base*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3647'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '2662',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80434' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80504'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80510'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-143',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80467' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '142',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80434'
                                                          },
                                                   '1' => {
                                                            'name' => 'alias',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_server_alias',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '80504' => {
                                       'BaseType' => '80467',
                                       'Name' => 'struct evhttp_server_alias*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80510' => {
                                       'BaseType' => '80504',
                                       'Name' => 'struct evhttp_server_alias**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80516' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '150',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80112'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80549'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-150',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80549' => {
                                       'BaseType' => '80112',
                                       'Name' => 'struct evhttp**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80555' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '153',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78828'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80391'
                                                          }
                                                 },
                                       'Name' => 'struct boundq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80592' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '155',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80233'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80239'
                                                          }
                                                 },
                                       'Name' => 'struct httpcbq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80629' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80112'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80549'
                                                          }
                                                 },
                                       'Name' => 'struct vhostsq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80666' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '166',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80504'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80510'
                                                          }
                                                 },
                                       'Name' => 'struct aliasq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80723' => {
                                       'Name' => 'int(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78326'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80764' => {
                                       'Name' => 'int(*)(struct evhttp_request*, struct evbuffer*, int, char const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78326'
                                                           },
                                                    '1' => {
                                                             'type' => '2651'
                                                           },
                                                    '2' => {
                                                             'type' => '109'
                                                           },
                                                    '3' => {
                                                             'type' => '345'
                                                           },
                                                    '4' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80770' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80852'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80858'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-39',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80803' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80770'
                                                          },
                                                   '1' => {
                                                            'name' => 'process',
                                                            'offset' => '16',
                                                            'type' => '80894'
                                                          },
                                                   '2' => {
                                                            'name' => 'process_arg',
                                                            'offset' => '24',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '80852' => {
                                       'BaseType' => '80803',
                                       'Name' => 'struct evrpc_hook*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80858' => {
                                       'BaseType' => '80852',
                                       'Name' => 'struct evrpc_hook**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80894' => {
                                       'Name' => 'int(*)(void*, struct evhttp_request*, struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '78326'
                                                           },
                                                    '2' => {
                                                             'type' => '2651'
                                                           },
                                                    '3' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80900' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80852'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80858'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80937' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '81022'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '81028'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_pause_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80974' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '98',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '81422'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '81471'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_ctx',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '81022' => {
                                       'BaseType' => '80974',
                                       'Name' => 'struct evrpc_hook_ctx*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81028' => {
                                       'BaseType' => '81022',
                                       'Name' => 'struct evrpc_hook_ctx**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81034' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '60',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_hooks',
                                                            'offset' => '0',
                                                            'type' => '80900'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_hooks',
                                                            'offset' => '16',
                                                            'type' => '80900'
                                                          },
                                                   '2' => {
                                                            'name' => 'pause_requests',
                                                            'offset' => '32',
                                                            'type' => '80937'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hooks_',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '81083' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78545'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
