$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.5.0',
          'Headers' => {
                         'bufferevent.h' => 1,
                         'bufferevent_struct.h' => 1,
                         'dns.h' => 1,
                         'dns_compat.h' => 1,
                         'dns_struct.h' => 1,
                         'event_struct.h' => 1,
                         'http.h' => 1,
                         'http_compat.h' => 1,
                         'http_struct.h' => 1,
                         'keyvalq_struct.h' => 1,
                         'rpc.h' => 1,
                         'rpc_struct.h' => 1,
                         'tag.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libevent_extra-2.2.so.1.0.0',
          'LibraryVersion' => 'current',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libpthread.so.0' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'evdns.c' => 1,
                         'event_tagging.c' => 1,
                         'evrpc.c' => 1,
                         'http.c' => 1
                       },
          'SymbolInfo' => {
                            '100679' => {
                                          'Header' => 'http.h',

                                                            'evrpc_remove_hook' => 1,
                                                            'evrpc_reqstate_free_' => 1,
                                                            'evrpc_request_done' => 1,
                                                            'evrpc_request_get_pool' => 1,
                                                            'evrpc_request_set_cb' => 1,
                                                            'evrpc_request_set_pool' => 1,
                                                            'evrpc_resume_request' => 1,
                                                            'evrpc_send_request_generic' => 1,
                                                            'evrpc_unregister_rpc' => 1,
                                                            'evtag_consume' => 1,
                                                            'evtag_decode_int' => 1,
                                                            'evtag_decode_int64' => 1,
                                                            'evtag_decode_tag' => 1,
                                                            'evtag_encode_int' => 1,
                                                            'evtag_encode_int64' => 1,
                                                            'evtag_encode_tag' => 1,
                                                            'evtag_init' => 1,
                                                            'evtag_marshal' => 1,
                                                            'evtag_marshal_buffer' => 1,
                                                            'evtag_marshal_int' => 1,
                                                            'evtag_marshal_int64' => 1,
                                                            'evtag_marshal_string' => 1,
                                                            'evtag_marshal_timeval' => 1,
                                                            'evtag_payload_length' => 1,
                                                            'evtag_peek' => 1,
                                                            'evtag_peek_length' => 1,
                                                            'evtag_unmarshal' => 1,
                                                            'evtag_unmarshal_fixed' => 1,
                                                            'evtag_unmarshal_header' => 1,
                                                            'evtag_unmarshal_int' => 1,
                                                            'evtag_unmarshal_int64' => 1,
                                                            'evtag_unmarshal_string' => 1,
                                                            'evtag_unmarshal_timeval' => 1
                                                          }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100016' => {
                                        'BaseType' => '99887',
                                        'Name' => 'struct bufferevent_ops const',
                                        'Size' => '72',
                                        'Type' => 'Const'
                                      },
                          '100021' => {
                                        'BaseType' => '100016',
                                        'Name' => 'struct bufferevent_ops const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100027' => {
                                        'Header' => 'bufferevent-internal.h',
                                        'Line' => '236',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'BEV_CTRL_SET_FD',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'BEV_CTRL_GET_FD',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'BEV_CTRL_GET_UNDERLYING',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'BEV_CTRL_CANCEL_ALL',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum bufferevent_ctrl_op',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '100069' => {
                                        'Header' => 'bufferevent-internal.h',
                                        'Line' => '244',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ptr',
                                                             'offset' => '0',
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'name' => 'fd',
                                                             'offset' => '0',
                                                             'type' => '109'
                                                           }
                                                  },
                                        'Name' => 'union bufferevent_ctrl_data',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '100123' => {
                                        'Name' => 'int(*)(struct bufferevent*, short)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '91'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100140' => {
                                        'Name' => 'void(*)(struct bufferevent*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100161' => {
                                        'Name' => 'int(*)(struct bufferevent*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100192' => {
                                        'Name' => 'int(*)(struct bufferevent*, short, enum bufferevent_flush_mode)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '91'
                                                            },
                                                     '2' => {
                                                              'type' => '96757'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100223' => {
                                        'BaseType' => '100069',
                                        'Name' => 'union bufferevent_ctrl_data*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '100229' => {
                                        'Name' => 'int(*)(struct bufferevent*, enum bufferevent_ctrl_op, union bufferevent_ctrl_data*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2662'
                                                            },
                                                     '1' => {
                                                              'type' => '100027'
                                                            },
                                                     '2' => {
                                                              'type' => '100223'
                                                            }
                                                   },
                                        'Return' => '109',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '100550' => {
                                        'BaseType' => '345',
                                        'Name' => 'char const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '102221' => {
                                        'BaseType' => '97756',
                                        'Name' => 'struct evhttp_uri const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '109' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '110242' => {
                                        'BaseType' => '97205',
                                        'Name' => 'struct evhttp_request const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1116' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[1]',
                                      'Size' => '1',
                                      'Type' => 'Array'
                                    },
                          '115742' => {
                                        'BaseType' => '95833',
                                        'Name' => 'evhttp_bound_socket_foreach_fn*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116' => {
                                     'BaseType' => '109',
                                     'Name' => 'int const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '121' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '125188' => {
                                        'BaseType' => '420',
                                        'Name' => 'uint16_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '131854' => {
                                        'BaseType' => '97627',
                                        'Name' => 'struct evkeyvalq const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1382' => {
                                      'BaseType' => '52',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '139' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '140',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1393' => {
                                      'Header' => 'socket.h',
                                      'Line' => '175',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sa_data',
                                                           'offset' => '2',
                                                           'type' => '1435'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1430' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '1435' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[14]',
                                      'Size' => '14',
                                      'Type' => 'Array'
                                    },
                          '1451' => {
                                      'Header' => 'socket.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1500'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '1500' => {
                                      'BaseType' => '212',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '1516' => {
                                      'BaseType' => '1393',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '161' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '148',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1611' => {
                                      'Header' => 'in.h',
                                      'Line' => '237',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin_addr',
                                                           'offset' => '4',
                                                           'type' => '2223'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin_zero',
                                                           'offset' => '8',
                                                           'type' => '2406'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1688' => {
                                      'Header' => 'in.h',
                                      'Line' => '252',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin6_family',
                                                           'offset' => '0',
                                                           'type' => '1382'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin6_port',
                                                           'offset' => '2',
                                                           'type' => '2253'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6_flowinfo',
                                                           'offset' => '4',
                                                           'type' => '436'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin6_addr',
                                                           'offset' => '8',
                                                           'type' => '2354'
                                                         },
                                                  '4' => {
                                                           'name' => 'sin6_scope_id',
                                                           'offset' => '24',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in6',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '172' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '150',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '183' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '190' => {
                                     'BaseType' => '132',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '201' => {
                                     'BaseType' => '212',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2069' => {
                                      'BaseType' => '1430',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '20832' => {
                                       'BaseType' => '273',
                                       'Name' => 'struct timeval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '212' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '219' => {
                                     'BaseType' => '212',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '2212' => {
                                      'BaseType' => '436',
                                      'Header' => 'in.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2223' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '2212'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '224' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '197',
                                     'Name' => '__socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2248' => {
                                      'BaseType' => '2223',
                                      'Name' => 'struct in_addr const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '2253' => {
                                      'BaseType' => '420',
                                      'Header' => 'in.h',
                                      'Line' => '119',
                                      'Name' => 'in_port_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '2264' => {
                                      'Header' => 'in.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '2306'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '2322'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '2338'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-213',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '2306' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2322' => {
                                      'BaseType' => '420',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2338' => {
                                      'BaseType' => '436',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '235' => {
                                     'BaseType' => '139',
                                     'Header' => 'types.h',
                                     'Line' => '86',
                                     'Name' => 'off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2354' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '2264'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2379' => {
                                      'BaseType' => '2354',
                                      'Name' => 'struct in6_addr const',
                                      'Size' => '16',
                                      'Type' => 'Const'
                                    },
                          '2406' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '2422' => {
                                      'Header' => 'netdb.h',
                                      'Line' => '565',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ai_flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ai_family',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'ai_socktype',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ai_protocol',
                                                           'offset' => '12',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'ai_addrlen',
                                                           'offset' => '16',
                                                           'type' => '481'
                                                         },
                                                  '5' => {
                                                           'name' => 'ai_addr',
                                                           'offset' => '24',
                                                           'type' => '1516'
                                                         },
                                                  '6' => {
                                                           'name' => 'ai_canonname',
                                                           'offset' => '32',
                                                           'type' => '201'
                                                         },
                                                  '7' => {
                                                           'name' => 'ai_next',
                                                           'offset' => '40',
                                                           'type' => '2545'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '246' => {
                                     'BaseType' => '190',
                                     'Header' => 'types.h',
                                     'Line' => '109',
                                     'Name' => 'ssize_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2540' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '2545' => {
                                      'BaseType' => '2422',
                                      'Name' => 'struct addrinfo*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '25472' => {
                                       'BaseType' => '2379',
                                       'Name' => 'struct in6_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2551' => {
                                      'BaseType' => '2540',
                                      'Name' => 'struct addrinfo const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '257' => {
                                     'BaseType' => '66',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '26334' => {
                                       'BaseType' => '2248',
                                       'Name' => 'struct in_addr const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2651' => {
                                      'BaseType' => '2657',
                                      'Name' => 'struct evbuffer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2657' => {
                                      'Header' => 'buffer.h',
                                      'Name' => 'struct evbuffer',
                                      'Type' => 'Struct'
                                    },
                          '2662' => {
                                      'BaseType' => '2668',
                                      'Name' => 'struct bufferevent*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2668' => {
                                      'Header' => 'bufferevent_struct.h',
                                      'Line' => '70',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '0',
                                                           'type' => '3647'
                                                         },
                                                  '1' => {
                                                           'name' => 'be_ops',
                                                           'offset' => '8',
                                                           'type' => '100021'
                                                         },
                                                  '10' => {
                                                            'name' => 'errorcb',
                                                            'offset' => '320',
                                                            'type' => '96677'
                                                          },
                                                  '11' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '328',
                                                            'type' => '183'
                                                          },
                                                  '12' => {
                                                            'name' => 'timeout_read',
                                                            'offset' => '336',
                                                            'type' => '273'
                                                          },
                                                  '13' => {
                                                            'name' => 'timeout_write',
                                                            'offset' => '352',
                                                            'type' => '273'
                                                          },
                                                  '14' => {
                                                            'name' => 'enabled',
                                                            'offset' => '368',
                                                            'type' => '91'
                                                          },
                                                  '2' => {
                                                           'name' => 'ev_read',
                                                           'offset' => '16',
                                                           'type' => '3077'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_write',
                                                           'offset' => '136',
                                                           'type' => '3077'
                                                         },
                                                  '4' => {
                                                           'name' => 'input',
                                                           'offset' => '256',
                                                           'type' => '2651'
                                                         },
                                                  '5' => {
                                                           'name' => 'output',
                                                           'offset' => '264',
                                                           'type' => '2651'
                                                         },
                                                  '6' => {
                                                           'name' => 'wm_read',
                                                           'offset' => '272',
                                                           'type' => '99850'
                                                         },
                                                  '7' => {
                                                           'name' => 'wm_write',
                                                           'offset' => '288',
                                                           'type' => '99850'
                                                         },
                                                  '8' => {
                                                           'name' => 'readcb',
                                                           'offset' => '304',
                                                           'type' => '96433'
                                                         },
                                                  '9' => {
                                                           'name' => 'writecb',
                                                           'offset' => '312',
                                                           'type' => '96433'
                                                         }
                                                },
                                      'Name' => 'struct bufferevent',
                                      'Size' => '376',
                                      'Type' => 'Struct'
                                    },
                          '2715' => {
                                      'BaseType' => '2726',
                                      'Header' => 'dns.h',
                                      'Line' => '246',
                                      'Name' => 'evdns_callback_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2726' => {
                                      'Name' => 'void(*)(int, char, int, int, void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '212'
                                                          },
                                                   '2' => {
                                                            'type' => '109'
                                                          },
                                                   '3' => {
                                                            'type' => '109'
                                                          },
                                                   '4' => {
                                                            'type' => '183'
                                                          },
                                                   '5' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '273' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '161'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '172'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '2768' => {
                                      'BaseType' => '2780',
                                      'Header' => 'dns.h',
                                      'Line' => '592',
                                      'Name' => 'evdns_debug_log_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2780' => {
                                      'Name' => 'void(*)(int, char const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '345'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2802' => {
                                      'BaseType' => '2814',
                                      'Header' => 'dns.h',
                                      'Line' => '648',
                                      'Name' => 'evdns_request_callback_fn_type',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2814' => {
                                      'Name' => 'void(*)(struct evdns_server_request*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2836'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2836' => {
                                      'BaseType' => '2842',
                                      'Name' => 'struct evdns_server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2842' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '56',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'nquestions',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'questions',
                                                           'offset' => '8',
                                                           'type' => '3010'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_request',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2891' => {
                                      'Header' => 'dns.h',
                                      'Line' => '712',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'EVDNS_SOPT_TCP_MAX_CLIENTS',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'EVDNS_SOPT_TCP_IDLE_TIMEOUT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum evdns_server_option',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '2922' => {
                                      'BaseType' => '2934',
                                      'Header' => 'dns.h',
                                      'Line' => '775',
                                      'Name' => 'evdns_getaddrinfo_cb',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2934' => {
                                      'Name' => 'void(*)(int, struct addrinfo*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '2545'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2961' => {
                                      'Header' => 'dns_struct.h',
                                      'Line' => '61',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'class',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_question',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '3010' => {
                                      'BaseType' => '3016',
                                      'Name' => 'struct evdns_server_question**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3016' => {
                                      'BaseType' => '2961',
                                      'Name' => 'struct evdns_server_question*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3022' => {
                                      'Name' => 'void(*)(int, short, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'type' => '91'
                                                          },
                                                   '2' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3049' => {
                                      'Name' => 'void(*)(struct event*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3071'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3071' => {
                                      'BaseType' => '3077',
                                      'Name' => 'struct event*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3077' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '123',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_evcallback',
                                                           'offset' => '0',
                                                           'type' => '3224'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout_pos',
                                                           'offset' => '40',
                                                           'type' => '3435'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_fd',
                                                           'offset' => '56',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ev_events',
                                                           'offset' => '60',
                                                           'type' => '91'
                                                         },
                                                  '4' => {
                                                           'name' => 'ev_res',
                                                           'offset' => '62',
                                                           'type' => '91'
                                                         },
                                                  '5' => {
                                                           'name' => 'ev_base',
                                                           'offset' => '64',
                                                           'type' => '3647'
                                                         },
                                                  '6' => {
                                                           'name' => 'ev_',
                                                           'offset' => '72',
                                                           'type' => '3616'
                                                         },
                                                  '7' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '104',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct event',
                                      'Size' => '120',
                                      'Type' => 'Struct'
                                    },
                          '310' => {
                                     'BaseType' => '273',
                                     'Name' => 'struct timeval const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '3186' => {
                                      'Header' => 'event.h',
                                      'Name' => 'struct event_base',
                                      'Type' => 'Struct'
                                    },
                          '3191' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '3309'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3315'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-108',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3224' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '107',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_active_next',
                                                           'offset' => '0',
                                                           'type' => '3191'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_flags',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_pri',
                                                           'offset' => '18',
                                                           'type' => '404'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_closure',
                                                           'offset' => '19',
                                                           'type' => '404'
                                                         },
                                                  '4' => {
                                                           'name' => 'evcb_cb_union',
                                                           'offset' => '24',
                                                           'type' => '3321'
                                                         },
                                                  '5' => {
                                                           'name' => 'evcb_arg',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct event_callback',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '3309' => {
                                      'BaseType' => '3224',
                                      'Name' => 'struct event_callback*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3315' => {
                                      'BaseType' => '3309',
                                      'Name' => 'struct event_callback**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3321' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evcb_callback',
                                                           'offset' => '0',
                                                           'type' => '3022'
                                                         },
                                                  '1' => {
                                                           'name' => 'evcb_selfcb',
                                                           'offset' => '0',
                                                           'type' => '3390'
                                                         },
                                                  '2' => {
                                                           'name' => 'evcb_evfinalize',
                                                           'offset' => '0',
                                                           'type' => '3049'
                                                         },
                                                  '3' => {
                                                           'name' => 'evcb_cbfinalize',
                                                           'offset' => '0',
                                                           'type' => '3390'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-113',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3390' => {
                                      'Name' => 'void(*)(struct event_callback*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3309'
                                                          },
                                                   '1' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3396' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-128',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3429' => {
                                      'BaseType' => '3071',
                                      'Name' => 'struct event**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3435' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '127',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_next_with_common_timeout',
                                                           'offset' => '0',
                                                           'type' => '3396'
                                                         },
                                                  '1' => {
                                                           'name' => 'min_heap_idx',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-127',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '345' => {
                                     'BaseType' => '219',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3466' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '141',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-141',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3499' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '140',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io_next',
                                                           'offset' => '0',
                                                           'type' => '3466'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_timeout',
                                                           'offset' => '16',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-140',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '351' => {
                                     'BaseType' => '345',
                                     'Name' => 'char const*const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '3532' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '147',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '3071'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '3429'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-147',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3565' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_signal_next',
                                                           'offset' => '0',
                                                           'type' => '3532'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_ncalls',
                                                           'offset' => '16',
                                                           'type' => '91'
                                                         },
                                                  '2' => {
                                                           'name' => 'ev_pncalls',
                                                           'offset' => '24',
                                                           'type' => '3610'
                                                         }
                                                },
                                      'Name' => 'anon-struct-event_struct.h-146',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3610' => {
                                      'BaseType' => '91',
                                      'Name' => 'short*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3616' => {
                                      'Header' => 'event_struct.h',
                                      'Line' => '138',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ev_io',
                                                           'offset' => '0',
                                                           'type' => '3499'
                                                         },
                                                  '1' => {
                                                           'name' => 'ev_signal',
                                                           'offset' => '0',
                                                           'type' => '3565'
                                                         }
                                                },
                                      'Name' => 'anon-union-event_struct.h-138',
                                      'Size' => '32',
                                      'Type' => 'Union'
                                    },
                          '3647' => {
                                      'BaseType' => '3186',
                                      'Name' => 'struct event_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3653' => {
                                      'BaseType' => '3659',
                                      'Name' => 'struct evconnlistener*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3659' => {
                                      'Name' => 'struct evconnlistener',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '3902' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '183'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3959' => {
                                      'BaseType' => '310',
                                      'Name' => 'struct timeval const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3982' => {
                                      'Line' => '5146',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'evdns_base',
                                                           'offset' => '0',
                                                           'type' => '4178'
                                                         },
                                                  '1' => {
                                                           'name' => 'hints',
                                                           'offset' => '8',
                                                           'type' => '2422'
                                                         },
                                                  '10' => {
                                                            'name' => 'pending_error',
                                                            'offset' => '248',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'user_canceled',
                                                            'offset' => '252',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_done',
                                                            'offset' => '252',
                                                            'type' => '59'
                                                          },
                                                  '2' => {
                                                           'name' => 'user_cb',
                                                           'offset' => '56',
                                                           'type' => '2922'
                                                         },
                                                  '3' => {
                                                           'name' => 'user_data',
                                                           'offset' => '64',
                                                           'type' => '183'
                                                         },
                                                  '4' => {
                                                           'name' => 'port',
                                                           'offset' => '72',
                                                           'type' => '420'
                                                         },
                                                  '5' => {
                                                           'name' => 'ipv4_request',
                                                           'offset' => '80',
                                                           'type' => '6837'
                                                         },
                                                  '6' => {
                                                           'name' => 'ipv6_request',
                                                           'offset' => '96',
                                                           'type' => '6837'
                                                         },
                                                  '7' => {
                                                           'name' => 'cname_result',
                                                           'offset' => '112',
                                                           'type' => '201'
                                                         },
                                                  '8' => {
                                                           'name' => 'pending_result',
                                                           'offset' => '120',
                                                           'type' => '2545'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout',
                                                           'offset' => '128',
                                                           'type' => '3077'
                                                         }
                                                },
                                      'Name' => 'struct evdns_getaddrinfo_request',
                                      'PrivateABI' => 1,
                                      'Size' => '256',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '404' => {
                                     'BaseType' => '80',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '4172' => {
                                      'BaseType' => '3982',
                                      'Name' => 'struct evdns_getaddrinfo_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4178' => {
                                      'BaseType' => '4184',
                                      'Name' => 'struct evdns_base*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4184' => {
                                      'Line' => '349',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'req_heads',
                                                           'offset' => '0',
                                                           'type' => '6442'
                                                         },
                                                  '1' => {
                                                           'name' => 'req_waiting_head',
                                                           'offset' => '8',
                                                           'type' => '5045'
                                                         },
                                                  '10' => {
                                                            'name' => 'global_max_reissues',
                                                            'offset' => '72',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'global_max_retransmits',
                                                            'offset' => '76',
                                                            'type' => '109'
                                                          },
                                                  '12' => {
                                                            'name' => 'global_max_nameserver_timeout',
                                                            'offset' => '80',
                                                            'type' => '109'
                                                          },
                                                  '13' => {
                                                            'name' => 'global_randomize_case',
                                                            'offset' => '84',
                                                            'type' => '109'
                                                          },
                                                  '14' => {
                                                            'name' => 'global_max_udp_size',
                                                            'offset' => '88',
                                                            'type' => '420'
                                                          },
                                                  '15' => {
                                                            'name' => 'global_nameserver_probe_initial_timeout',
                                                            'offset' => '96',
                                                            'type' => '273'
                                                          },
                                                  '16' => {
                                                            'name' => 'global_tcp_flags',
                                                            'offset' => '112',
                                                            'type' => '420'
                                                          },
                                                  '17' => {
                                                            'name' => 'global_tcp_idle_timeout',
                                                            'offset' => '120',
                                                            'type' => '273'
                                                          },
                                                  '18' => {
                                                            'name' => 'global_outgoing_address',
                                                            'offset' => '136',
                                                            'type' => '1451'
                                                          },
                                                  '19' => {
                                                            'name' => 'global_outgoing_addrlen',
                                                            'offset' => '264',
                                                            'type' => '481'
                                                          },
                                                  '2' => {
                                                           'name' => 'server_head',
                                                           'offset' => '16',
                                                           'type' => '5383'
                                                         },
                                                  '20' => {
                                                            'name' => 'global_getaddrinfo_allow_skew',
                                                            'offset' => '272',
                                                            'type' => '273'
                                                          },
                                                  '21' => {
                                                            'name' => 'so_rcvbuf',
                                                            'offset' => '288',
                                                            'type' => '109'
                                                          },
                                                  '22' => {
                                                            'name' => 'so_sndbuf',
                                                            'offset' => '292',
                                                            'type' => '109'
                                                          },
                                                  '23' => {
                                                            'name' => 'getaddrinfo_ipv4_timeouts',
                                                            'offset' => '296',
                                                            'type' => '109'
                                                          },
                                                  '24' => {
                                                            'name' => 'getaddrinfo_ipv6_timeouts',
                                                            'offset' => '300',
                                                            'type' => '109'
                                                          },
                                                  '25' => {
                                                            'name' => 'getaddrinfo_ipv4_answered',
                                                            'offset' => '304',
                                                            'type' => '109'
                                                          },
                                                  '26' => {
                                                            'name' => 'getaddrinfo_ipv6_answered',
                                                            'offset' => '308',
                                                            'type' => '109'
                                                          },
                                                  '27' => {
                                                            'name' => 'global_search_state',
                                                            'offset' => '312',
                                                            'type' => '5127'
                                                          },
                                                  '28' => {
                                                            'name' => 'hostsdb',
                                                            'offset' => '320',
                                                            'type' => '6324'
                                                          },
                                                  '29' => {
                                                            'name' => 'lock',
                                                            'offset' => '336',
                                                            'type' => '183'
                                                          },
                                                  '3' => {
                                                           'name' => 'n_req_heads',
                                                           'offset' => '24',
                                                           'type' => '109'
                                                         },
                                                  '30' => {
                                                            'name' => 'disable_when_inactive',
                                                            'offset' => '344',
                                                            'type' => '109'
                                                          },
                                                  '31' => {
                                                            'name' => 'ns_max_probe_timeout',
                                                            'offset' => '348',
                                                            'type' => '109'
                                                          },
                                                  '32' => {
                                                            'name' => 'ns_timeout_backoff_factor',
                                                            'offset' => '352',
                                                            'type' => '109'
                                                          },
                                                  '4' => {
                                                           'name' => 'event_base',
                                                           'offset' => '32',
                                                           'type' => '3647'
                                                         },
                                                  '5' => {
                                                           'name' => 'global_good_nameservers',
                                                           'offset' => '40',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'global_requests_inflight',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'global_requests_waiting',
                                                           'offset' => '48',
                                                           'type' => '109'
                                                         },
                                                  '8' => {
                                                           'name' => 'global_max_requests_inflight',
                                                           'offset' => '52',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'global_timeout',
                                                           'offset' => '56',
                                                           'type' => '273'
                                                         }
                                                },
                                      'Name' => 'struct evdns_base',
                                      'PrivateABI' => 1,
                                      'Size' => '360',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '420' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '436' => {
                                     'BaseType' => '121',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '43680' => {
                                       'BaseType' => '2223',
                                       'Name' => 'struct in_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '447' => {
                                     'BaseType' => '458',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '458' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '4702' => {
                                      'Line' => '177',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'current_req',
                                                           'offset' => '0',
                                                           'type' => '5045'
                                                         },
                                                  '1' => {
                                                           'name' => 'base',
                                                           'offset' => '8',
                                                           'type' => '4178'
                                                         },
                                                  '2' => {
                                                           'name' => 'pending_cb',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'search_index',
                                                           'offset' => '20',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'search_state',
                                                           'offset' => '24',
                                                           'type' => '5127'
                                                         },
                                                  '5' => {
                                                           'name' => 'search_origname',
                                                           'offset' => '32',
                                                           'type' => '201'
                                                         },
                                                  '6' => {
                                                           'name' => 'search_flags',
                                                           'offset' => '40',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'tcp_flags',
                                                           'offset' => '44',
                                                           'type' => '420'
                                                         }
                                                },
                                      'Name' => 'struct evdns_request',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '481' => {
                                     'BaseType' => '224',
                                     'Header' => 'unistd.h',
                                     'Line' => '277',
                                     'Name' => 'socklen_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4811' => {
                                      'Line' => '192',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'request',
                                                           'offset' => '0',
                                                           'type' => '5138'
                                                         },
                                                  '1' => {
                                                           'name' => 'request_size',
                                                           'offset' => '8',
                                                           'type' => '420'
                                                         },
                                                  '10' => {
                                                            'name' => 'prev',
                                                            'offset' => '56',
                                                            'type' => '5045'
                                                          },
                                                  '11' => {
                                                            'name' => 'timeout_event',
                                                            'offset' => '64',
                                                            'type' => '3077'
                                                          },
                                                  '12' => {
                                                            'name' => 'trans_id',
                                                            'offset' => '184',
                                                            'type' => '420'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'request_appended',
                                                            'offset' => '184',
                                                            'type' => '59'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'transmit_me',
                                                            'offset' => '184',
                                                            'type' => '59'
                                                          },
                                                  '15' => {
                                                            'name' => 'put_cname_in_ptr',
                                                            'offset' => '192',
                                                            'type' => '505'
                                                          },
                                                  '16' => {
                                                            'name' => 'base',
                                                            'offset' => '200',
                                                            'type' => '4178'
                                                          },
                                                  '17' => {
                                                            'name' => 'handle',
                                                            'offset' => '208',
                                                            'type' => '5394'
                                                          },
                                                  '2' => {
                                                           'name' => 'request_type',
                                                           'offset' => '10',
                                                           'type' => '404'
                                                         },
                                                  '3' => {
                                                           'name' => 'request_len',
                                                           'offset' => '12',
                                                           'type' => '59'
                                                         },
                                                  '4' => {
                                                           'name' => 'reissue_count',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'tx_count',
                                                           'offset' => '20',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'user_pointer',
                                                           'offset' => '24',
                                                           'type' => '183'
                                                         },
                                                  '7' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '32',
                                                           'type' => '2715'
                                                         },
                                                  '8' => {
                                                           'name' => 'ns',
                                                           'offset' => '40',
                                                           'type' => '5383'
                                                         },
                                                  '9' => {
                                                           'name' => 'next',
                                                           'offset' => '48',
                                                           'type' => '5045'
                                                         }
                                                },
                                      'Name' => 'struct request',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5045' => {
                                      'BaseType' => '4811',
                                      'Name' => 'struct request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '505' => {
                                     'BaseType' => '201',
                                     'Name' => 'char**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5056' => {
                                      'Line' => '3836',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'refcount',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ndots',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'num_domains',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'head',
                                                           'offset' => '16',
                                                           'type' => '6831'
                                                         }
                                                },
                                      'Name' => 'struct search_state',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5127' => {
                                      'BaseType' => '5056',
                                      'Name' => 'struct search_state*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5138' => {
                                      'BaseType' => '404',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5149' => {
                                      'Line' => '253',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'connection',
                                                           'offset' => '8',
                                                           'type' => '5926'
                                                         },
                                                  '10' => {
                                                            'name' => 'probe_request',
                                                            'offset' => '416',
                                                            'type' => '5394'
                                                          },
                                                  '11' => {
                                                            'name' => 'state',
                                                            'offset' => '424',
                                                            'type' => '212'
                                                          },
                                                  '12' => {
                                                            'name' => 'choked',
                                                            'offset' => '425',
                                                            'type' => '212'
                                                          },
                                                  '13' => {
                                                            'name' => 'write_waiting',
                                                            'offset' => '426',
                                                            'type' => '212'
                                                          },
                                                  '14' => {
                                                            'name' => 'base',
                                                            'offset' => '432',
                                                            'type' => '4178'
                                                          },
                                                  '15' => {
                                                            'name' => 'requests_inflight',
                                                            'offset' => '440',
                                                            'type' => '109'
                                                          },
                                                  '2' => {
                                                           'name' => 'address',
                                                           'offset' => '16',
                                                           'type' => '1451'
                                                         },
                                                  '3' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '144',
                                                           'type' => '481'
                                                         },
                                                  '4' => {
                                                           'name' => 'failed_times',
                                                           'offset' => '148',
                                                           'type' => '109'
                                                         },
                                                  '5' => {
                                                           'name' => 'timedout',
                                                           'offset' => '152',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'event',
                                                           'offset' => '160',
                                                           'type' => '3077'
                                                         },
                                                  '7' => {
                                                           'name' => 'next',
                                                           'offset' => '280',
                                                           'type' => '5383'
                                                         },
                                                  '8' => {
                                                           'name' => 'prev',
                                                           'offset' => '288',
                                                           'type' => '5383'
                                                         },
                                                  '9' => {
                                                           'name' => 'timeout_event',
                                                           'offset' => '296',
                                                           'type' => '3077'
                                                         }
                                                },
                                      'Name' => 'struct nameserver',
                                      'PrivateABI' => 1,
                                      'Size' => '448',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '53797' => {
                                       'Name' => 'void(*)(char*, size_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '201'
                                                           },
                                                    '1' => {
                                                             'type' => '257'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '5383' => {
                                      'BaseType' => '5149',
                                      'Name' => 'struct nameserver*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '53852' => {
                                       'Name' => 'uint16_t(*)()',
                                       'Return' => '420',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '5394' => {
                                      'BaseType' => '4702',
                                      'Name' => 'struct evdns_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5456' => {
                                      'BaseType' => '436',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5532' => {
                                      'Line' => '233',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'TS_DISCONNECTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'TS_CONNECTING',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'TS_CONNECTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum tcp_state',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Enum'
                                    },
                          '5568' => {
                                      'Line' => '239',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bev',
                                                           'offset' => '0',
                                                           'type' => '2662'
                                                         },
                                                  '1' => {
                                                           'name' => 'state',
                                                           'offset' => '8',
                                                           'type' => '5532'
                                                         },
                                                  '2' => {
                                                           'name' => 'awaiting_packet_size',
                                                           'offset' => '12',
                                                           'type' => '420'
                                                         }
                                                },
                                      'Name' => 'struct tcp_connection',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5617' => {
                                      'Line' => '248',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'le_next',
                                                           'offset' => '0',
                                                           'type' => '5699'
                                                         },
                                                  '1' => {
                                                           'name' => 'le_prev',
                                                           'offset' => '8',
                                                           'type' => '5705'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evdns.c-248',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5650' => {
                                      'Line' => '247',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '5617'
                                                         },
                                                  '1' => {
                                                           'name' => 'connection',
                                                           'offset' => '16',
                                                           'type' => '5568'
                                                         },
                                                  '2' => {
                                                           'name' => 'port',
                                                           'offset' => '32',
                                                           'type' => '5920'
                                                         }
                                                },
                                      'Name' => 'struct client_tcp_connection',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5699' => {
                                      'BaseType' => '5650',
                                      'Name' => 'struct client_tcp_connection*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5705' => {
                                      'BaseType' => '5699',
                                      'Name' => 'struct client_tcp_connection**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5711' => {
                                      'Line' => '280',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'socket',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'refcnt',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '10' => {
                                                            'name' => 'client_connections',
                                                            'offset' => '176',
                                                            'type' => '5932'
                                                          },
                                                  '11' => {
                                                            'name' => 'client_connections_count',
                                                            'offset' => '184',
                                                            'type' => '59'
                                                          },
                                                  '12' => {
                                                            'name' => 'max_client_connections',
                                                            'offset' => '188',
                                                            'type' => '59'
                                                          },
                                                  '13' => {
                                                            'name' => 'tcp_idle_timeout',
                                                            'offset' => '192',
                                                            'type' => '273'
                                                          },
                                                  '14' => {
                                                            'name' => 'lock',
                                                            'offset' => '208',
                                                            'type' => '183'
                                                          },
                                                  '2' => {
                                                           'name' => 'choked',
                                                           'offset' => '8',
                                                           'type' => '212'
                                                         },
                                                  '3' => {
                                                           'name' => 'closing',
                                                           'offset' => '9',
                                                           'type' => '212'
                                                         },
                                                  '4' => {
                                                           'name' => 'user_callback',
                                                           'offset' => '16',
                                                           'type' => '2802'
                                                         },
                                                  '5' => {
                                                           'name' => 'user_data',
                                                           'offset' => '24',
                                                           'type' => '183'
                                                         },
                                                  '6' => {
                                                           'name' => 'event',
                                                           'offset' => '32',
                                                           'type' => '3077'
                                                         },
                                                  '7' => {
                                                           'name' => 'pending_replies',
                                                           'offset' => '152',
                                                           'type' => '6194'
                                                         },
                                                  '8' => {
                                                           'name' => 'event_base',
                                                           'offset' => '160',
                                                           'type' => '3647'
                                                         },
                                                  '9' => {
                                                           'name' => 'listener',
                                                           'offset' => '168',
                                                           'type' => '3653'
                                                         }
                                                },
                                      'Name' => 'struct evdns_server_port',
                                      'PrivateABI' => 1,
                                      'Size' => '216',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '5920' => {
                                      'BaseType' => '5711',
                                      'Name' => 'struct evdns_server_port*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5926' => {
                                      'BaseType' => '5568',
                                      'Name' => 'struct tcp_connection*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5932' => {
                                      'Line' => '294',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'lh_first',
                                                           'offset' => '0',
                                                           'type' => '5699'
                                                         }
                                                },
                                      'Name' => 'struct client_list',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '5959' => {
                                      'Line' => '318',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_pending',
                                                           'offset' => '0',
                                                           'type' => '6194'
                                                         },
                                                  '1' => {
                                                           'name' => 'prev_pending',
                                                           'offset' => '8',
                                                           'type' => '6194'
                                                         },
                                                  '10' => {
                                                            'name' => 'n_additional',
                                                            'offset' => '184',
                                                            'type' => '109'
                                                          },
                                                  '11' => {
                                                            'name' => 'answer',
                                                            'offset' => '192',
                                                            'type' => '6318'
                                                          },
                                                  '12' => {
                                                            'name' => 'authority',
                                                            'offset' => '200',
                                                            'type' => '6318'
                                                          },
                                                  '13' => {
                                                            'name' => 'additional',
                                                            'offset' => '208',
                                                            'type' => '6318'
                                                          },
                                                  '14' => {
                                                            'name' => 'response',
                                                            'offset' => '216',
                                                            'type' => '201'
                                                          },
                                                  '15' => {
                                                            'name' => 'response_len',
                                                            'offset' => '224',
                                                            'type' => '257'
                                                          },
                                                  '16' => {
                                                            'name' => 'base',
                                                            'offset' => '232',
                                                            'type' => '2842'
                                                          },
                                                  '2' => {
                                                           'name' => 'trans_id',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'port',
                                                           'offset' => '24',
                                                           'type' => '5920'
                                                         },
                                                  '4' => {
                                                           'name' => 'client',
                                                           'offset' => '32',
                                                           'type' => '5699'
                                                         },
                                                  '5' => {
                                                           'name' => 'addr',
                                                           'offset' => '40',
                                                           'type' => '1451'
                                                         },
                                                  '6' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '168',
                                                           'type' => '481'
                                                         },
                                                  '7' => {
                                                           'name' => 'max_udp_reply_size',
                                                           'offset' => '172',
                                                           'type' => '420'
                                                         },
                                                  '8' => {
                                                           'name' => 'n_answer',
                                                           'offset' => '176',
                                                           'type' => '109'
                                                         },
                                                  '9' => {
                                                           'name' => 'n_authority',
                                                           'offset' => '180',
                                                           'type' => '109'
                                                         }
                                                },
                                      'Name' => 'struct server_request',
                                      'PrivateABI' => 1,
                                      'Size' => '248',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6194' => {
                                      'BaseType' => '5959',
                                      'Name' => 'struct server_request*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6200' => {
                                      'Line' => '305',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '6318'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '201'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '16',
                                                           'type' => '420'
                                                         },
                                                  '3' => {
                                                           'name' => 'class',
                                                           'offset' => '18',
                                                           'type' => '420'
                                                         },
                                                  '4' => {
                                                           'name' => 'ttl',
                                                           'offset' => '20',
                                                           'type' => '436'
                                                         },
                                                  '5' => {
                                                           'name' => 'is_name',
                                                           'offset' => '24',
                                                           'type' => '212'
                                                         },
                                                  '6' => {
                                                           'name' => 'datalen',
                                                           'offset' => '26',
                                                           'type' => '420'
                                                         },
                                                  '7' => {
                                                           'name' => 'data',
                                                           'offset' => '32',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct server_reply_item',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6318' => {
                                      'BaseType' => '6200',
                                      'Name' => 'struct server_reply_item*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6324' => {
                                      'Line' => '412',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqh_first',
                                                           'offset' => '0',
                                                           'type' => '6430'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqh_last',
                                                           'offset' => '8',
                                                           'type' => '6436'
                                                         }
                                                },
                                      'Name' => 'struct hosts_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6364' => {
                                      'Line' => '428',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '6448'
                                                         },
                                                  '1' => {
                                                           'name' => 'addr',
                                                           'offset' => '16',
                                                           'type' => '6484'
                                                         },
                                                  '2' => {
                                                           'name' => 'addrlen',
                                                           'offset' => '44',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'hostname',
                                                           'offset' => '48',
                                                           'type' => '1116'
                                                         }
                                                },
                                      'Name' => 'struct hosts_entry',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6430' => {
                                      'BaseType' => '6364',
                                      'Name' => 'struct hosts_entry*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6436' => {
                                      'BaseType' => '6430',
                                      'Name' => 'struct hosts_entry**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6442' => {
                                      'BaseType' => '5045',
                                      'Name' => 'struct request**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6448' => {
                                      'Line' => '429',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tqe_next',
                                                           'offset' => '0',
                                                           'type' => '6430'
                                                         },
                                                  '1' => {
                                                           'name' => 'tqe_prev',
                                                           'offset' => '8',
                                                           'type' => '6436'
                                                         }
                                                },
                                      'Name' => 'anon-struct-evdns.c-429',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '6484' => {
                                      'Line' => '430',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sa',
                                                           'offset' => '0',
                                                           'type' => '1393'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin',
                                                           'offset' => '0',
                                                           'type' => '1611'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin6',
                                                           'offset' => '0',
                                                           'type' => '1688'
                                                         }
                                                },
                                      'Name' => 'anon-union-evdns.c-430',
                                      'PrivateABI' => 1,
                                      'Size' => '28',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Union'
                                    },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '66900' => {
                                       'BaseType' => '66',
                                       'Header' => 'types.h',
                                       'Line' => '44',
                                       'Name' => '__uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '6791' => {
                                      'Line' => '3830',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'len',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '6831'
                                                         }
                                                },
                                      'Name' => 'struct search_domain',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '67939' => {
                                       'BaseType' => '66900',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '27',
                                       'Name' => 'uint64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '6831' => {
                                      'BaseType' => '6791',
                                      'Name' => 'struct search_domain*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6837' => {
                                      'Line' => '5140',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'r',
                                                           'offset' => '0',
                                                           'type' => '5394'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '436'
                                                         }
                                                },
                                      'Name' => 'struct getaddrinfo_subrequest',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Source' => 'evdns.c',
                                      'Type' => 'Struct'
                                    },
                          '70013' => {
                                       'BaseType' => '67939',
                                       'Name' => 'uint64_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75177' => {
                                       'BaseType' => '132',
                                       'Header' => 'types.h',
                                       'Line' => '43',
                                       'Name' => '__int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '75286' => {
                                       'BaseType' => '75177',
                                       'Header' => 'stdint-intn.h',
                                       'Line' => '27',
                                       'Name' => 'int64_t',
                                       'PrivateABI' => 1,
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '77320' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '59',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '77402'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '77408'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-keyvalq_struct.h-59',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '77353' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '77320'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'value',
                                                            'offset' => '24',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyval',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '77402' => {
                                       'BaseType' => '77353',
                                       'Name' => 'struct evkeyval*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77408' => {
                                       'BaseType' => '77402',
                                       'Name' => 'struct evkeyval**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '77414' => {
                                       'Header' => 'keyvalq_struct.h',
                                       'Line' => '65',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '77402'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '77408'
                                                          }
                                                 },
                                       'Name' => 'struct evkeyvalq',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '77913' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '472',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_INPUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_OUTPUT',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_TYPE',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '77944' => {
                                       'Header' => 'rpc.h',
                                       'Line' => '490',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVRPC_TERMINATE',
                                                            'value' => '-1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVRPC_CONTINUE',
                                                            'value' => '0'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVRPC_PAUSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum EVRPC_HOOK_RESULT',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '77981' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '54',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'error',
                                                            'offset' => '0',
                                                            'type' => '109'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_req',
                                                            'offset' => '8',
                                                            'type' => '78396'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_status',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '78018' => {
                                       'Header' => 'http_struct.h',
                                       'Line' => '57',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '81692'
                                                          },
                                                   '1' => {
                                                            'name' => 'evcon',
                                                            'offset' => '16',
                                                            'type' => '79725'
                                                          },
                                                   '10' => {
                                                             'name' => 'headers_size',
                                                             'offset' => '80',
                                                             'type' => '257'
                                                           },
                                                   '11' => {
                                                             'name' => 'body_size',
                                                             'offset' => '88',
                                                             'type' => '257'
                                                           },
                                                   '12' => {
                                                             'name' => 'uri',
                                                             'offset' => '96',
                                                             'type' => '201'
                                                           },
                                                   '13' => {
                                                             'name' => 'uri_elems',
                                                             'offset' => '104',
                                                             'type' => '81736'
                                                           },
                                                   '14' => {
                                                             'name' => 'major',
                                                             'offset' => '112',
                                                             'type' => '212'
                                                           },
                                                   '15' => {
                                                             'name' => 'minor',
                                                             'offset' => '113',
                                                             'type' => '212'
                                                           },
                                                   '16' => {
                                                             'name' => 'response_code',
                                                             'offset' => '116',
                                                             'type' => '109'
                                                           },
                                                   '17' => {
                                                             'name' => 'response_code_line',
                                                             'offset' => '120',
                                                             'type' => '201'
                                                           },
                                                   '18' => {
                                                             'name' => 'input_buffer',
                                                             'offset' => '128',
                                                             'type' => '2651'
                                                           },
                                                   '19' => {
                                                             'name' => 'ntoread',
                                                             'offset' => '136',
                                                             'type' => '75286'
                                                           },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '24',
                                                            'type' => '109'
                                                          },
                                                   '20' => {
                                                             'bitfield' => '1',
                                                             'name' => 'chunked',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '21' => {
                                                             'bitfield' => '1',
                                                             'name' => 'userdone',
                                                             'offset' => '144',
                                                             'type' => '59'
                                                           },
                                                   '22' => {
                                                             'name' => 'output_buffer',
                                                             'offset' => '152',
                                                             'type' => '2651'
                                                           },
                                                   '23' => {
                                                             'name' => 'cb',
                                                             'offset' => '160',
                                                             'type' => '80267'
                                                           },
                                                   '24' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '168',
                                                             'type' => '183'
                                                           },
                                                   '25' => {
                                                             'name' => 'chunk_cb',
                                                             'offset' => '176',
                                                             'type' => '80267'
                                                           },
                                                   '26' => {
                                                             'name' => 'header_cb',
                                                             'offset' => '184',
                                                             'type' => '80675'
                                                           },
                                                   '27' => {
                                                             'name' => 'error_cb',
                                                             'offset' => '192',
                                                             'type' => '81758'
                                                           },
                                                   '28' => {
                                                             'name' => 'on_complete_cb',
                                                             'offset' => '200',
                                                             'type' => '80267'
                                                           },
                                                   '29' => {
                                                             'name' => 'on_complete_cb_arg',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '3' => {
                                                            'name' => 'input_headers',
                                                            'offset' => '32',
                                                            'type' => '81725'
                                                          },
                                                   '4' => {
                                                            'name' => 'output_headers',
                                                            'offset' => '40',
                                                            'type' => '81725'
                                                          },
                                                   '5' => {
                                                            'name' => 'remote_host',
                                                            'offset' => '48',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'remote_port',
                                                            'offset' => '56',
                                                            'type' => '420'
                                                          },
                                                   '7' => {
                                                            'name' => 'host_cache',
                                                            'offset' => '64',
                                                            'type' => '201'
                                                          },
                                                   '8' => {
                                                            'name' => 'kind',
                                                            'offset' => '72',
                                                            'type' => '79156'
                                                          },
                                                   '9' => {
                                                            'name' => 'type',
                                                            'offset' => '76',
                                                            'type' => '79033'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_request',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '78396' => {
                                       'BaseType' => '78018',
                                       'Name' => 'struct evhttp_request*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78402' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '70',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '78615'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '78621'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-rpc_struct.h-70',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '78435' => {
                                       'Header' => 'rpc_struct.h',
                                       'Line' => '69',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '78402'
                                                          },
                                                   '1' => {
                                                            'name' => 'uri',
                                                            'offset' => '16',
                                                            'type' => '345'
                                                          },
                                                   '10' => {
                                                             'name' => 'reply_marshal',
                                                             'offset' => '88',
                                                             'type' => '78724'
                                                           },
                                                   '11' => {
                                                             'name' => 'cb',
                                                             'offset' => '96',
                                                             'type' => '78837'
                                                           },
                                                   '12' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '104',
                                                             'type' => '183'
                                                           },
                                                   '13' => {
                                                             'name' => 'base',
                                                             'offset' => '112',
                                                             'type' => '78892'
                                                           },
                                                   '2' => {
                                                            'name' => 'request_new',
                                                            'offset' => '24',
                                                            'type' => '78642'
                                                          },
                                                   '3' => {
                                                            'name' => 'request_new_arg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          },
                                                   '4' => {
                                                            'name' => 'request_free',
                                                            'offset' => '40',
                                                            'type' => '3902'
                                                          },
                                                   '5' => {
                                                            'name' => 'request_unmarshal',
                                                            'offset' => '48',
                                                            'type' => '78696'
                                                          },
                                                   '6' => {
                                                            'name' => 'reply_new',
                                                            'offset' => '56',
                                                            'type' => '78642'
                                                          },
                                                   '7' => {
                                                            'name' => 'reply_new_arg',
                                                            'offset' => '64',
                                                            'type' => '183'
                                                          },
                                                   '8' => {
                                                            'name' => 'reply_free',
                                                            'offset' => '72',
                                                            'type' => '3902'
                                                          },
                                                   '9' => {
                                                            'name' => 'reply_complete',
                                                            'offset' => '80',
                                                            'type' => '78702'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc',
                                       'Size' => '120',
                                       'Type' => 'Struct'
                                     },
                          '78615' => {
                                       'BaseType' => '78435',
                                       'Name' => 'struct evrpc*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78621' => {
                                       'BaseType' => '78615',
                                       'Name' => 'struct evrpc**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78642' => {
                                       'Name' => 'void*(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '183',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78696' => {
                                       'Name' => 'int(*)(void*, struct evbuffer*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '2651'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78702' => {
                                       'Name' => 'int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78724' => {
                                       'Name' => 'void(*)(struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2651'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78746' => {
                                       'BaseType' => '78752',
                                       'Name' => 'struct evrpc_req_generic*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78752' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hook_meta',
                                                            'offset' => '0',
                                                            'type' => '81609'
                                                          },
                                                   '1' => {
                                                            'name' => 'request',
                                                            'offset' => '8',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'reply',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '3' => {
                                                            'name' => 'rpc',
                                                            'offset' => '24',
                                                            'type' => '78615'
                                                          },
                                                   '4' => {
                                                            'name' => 'http_req',
                                                            'offset' => '32',
                                                            'type' => '78396'
                                                          },
                                                   '5' => {
                                                            'name' => 'rpc_data',
                                                            'offset' => '40',
                                                            'type' => '2651'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_req_generic',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '78837' => {
                                       'Name' => 'void(*)(struct evrpc_req_generic*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78746'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78843' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '72',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'common',
                                                            'offset' => '0',
                                                            'type' => '80986'
                                                          },
                                                   '1' => {
                                                            'name' => 'http_server',
                                                            'offset' => '48',
                                                            'type' => '80118'
                                                          },
                                                   '2' => {
                                                            'name' => 'registered_rpcs',
                                                            'offset' => '56',
                                                            'type' => '81035'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_base',
                                       'PrivateABI' => 1,
                                       'Size' => '72',
                                       'Type' => 'Struct'
                                     },
                          '78892' => {
                                       'BaseType' => '78843',
                                       'Name' => 'struct evrpc_base*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78898' => {
                                       'BaseType' => '78904',
                                       'Name' => 'struct evhttp_bound_socket*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78904' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '125',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80310'
                                                          },
                                                   '1' => {
                                                            'name' => 'listener',
                                                            'offset' => '16',
                                                            'type' => '3653'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_bound_socket',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '78941' => {
                                       'BaseType' => '78953',
                                       'Header' => 'http.h',
                                       'Line' => '270',
                                       'Name' => 'evhttp_ext_method_cb',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '78953' => {
                                       'Name' => 'int(*)(struct evhttp_ext_method*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78974'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78974' => {
                                       'BaseType' => '78980',
                                       'Name' => 'struct evhttp_ext_method*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78980' => {
                                       'Header' => 'http.h',
                                       'Line' => '630',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'method',
                                                            'offset' => '0',
                                                            'type' => '345'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '436'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '12',
                                                            'type' => '420'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_ext_method',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79033' => {
                                       'Header' => 'http.h',
                                       'Line' => '602',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQ_GET',
                                                            'value' => '1'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_REQ_POST',
                                                            'value' => '2'
                                                          },
                                                   '10' => {
                                                             'name' => 'EVHTTP_REQ_PROPPATCH',
                                                             'value' => '1024'
                                                           },
                                                   '11' => {
                                                             'name' => 'EVHTTP_REQ_MKCOL',
                                                             'value' => '2048'
                                                           },
                                                   '12' => {
                                                             'name' => 'EVHTTP_REQ_LOCK',
                                                             'value' => '4096'
                                                           },
                                                   '13' => {
                                                             'name' => 'EVHTTP_REQ_UNLOCK',
                                                             'value' => '8192'
                                                           },
                                                   '14' => {
                                                             'name' => 'EVHTTP_REQ_COPY',
                                                             'value' => '16384'
                                                           },
                                                   '15' => {
                                                             'name' => 'EVHTTP_REQ_MOVE',
                                                             'value' => '32768'
                                                           },
                                                   '2' => {
                                                            'name' => 'EVHTTP_REQ_HEAD',
                                                            'value' => '4'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVHTTP_REQ_PUT',
                                                            'value' => '8'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVHTTP_REQ_DELETE',
                                                            'value' => '16'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVHTTP_REQ_OPTIONS',
                                                            'value' => '32'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVHTTP_REQ_TRACE',
                                                            'value' => '64'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVHTTP_REQ_CONNECT',
                                                            'value' => '128'
                                                          },
                                                   '8' => {
                                                            'name' => 'EVHTTP_REQ_PATCH',
                                                            'value' => '256'
                                                          },
                                                   '9' => {
                                                            'name' => 'EVHTTP_REQ_PROPFIND',
                                                            'value' => '512'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_cmd_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79156' => {
                                       'Header' => 'http.h',
                                       'Line' => '639',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVHTTP_REQUEST',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVHTTP_RESPONSE',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_kind',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79187' => {
                                       'Header' => 'http.h',
                                       'Line' => '713',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVREQ_HTTP_TIMEOUT',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVREQ_HTTP_EOF',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVREQ_HTTP_INVALID_HEADER',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVREQ_HTTP_BUFFER_ERROR',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVREQ_HTTP_REQUEST_CANCEL',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVREQ_HTTP_DATA_TOO_LONG',
                                                            'value' => '5'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_request_error',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79264' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '34',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'EVCON_DISCONNECTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'EVCON_CONNECTING',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'EVCON_IDLE',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'EVCON_READING_FIRSTLINE',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'EVCON_READING_HEADERS',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'EVCON_READING_BODY',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'EVCON_READING_TRAILER',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'EVCON_WRITING',
                                                            'value' => '7'
                                                          }
                                                 },
                                       'Name' => 'enum evhttp_connection_state',
                                       'PrivateABI' => 1,
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '79330' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '52',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '79725'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '79731'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-52',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79363' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '79330'
                                                          },
                                                   '1' => {
                                                            'name' => 'bufev',
                                                            'offset' => '16',
                                                            'type' => '2662'
                                                          },
                                                   '10' => {
                                                             'name' => 'timeout_connect',
                                                             'offset' => '200',
                                                             'type' => '273'
                                                           },
                                                   '11' => {
                                                             'name' => 'timeout_read',
                                                             'offset' => '216',
                                                             'type' => '273'
                                                           },
                                                   '12' => {
                                                             'name' => 'timeout_write',
                                                             'offset' => '232',
                                                             'type' => '273'
                                                           },
                                                   '13' => {
                                                             'name' => 'retry_cnt',
                                                             'offset' => '248',
                                                             'type' => '109'
                                                           },
                                                   '14' => {
                                                             'name' => 'retry_max',
                                                             'offset' => '252',
                                                             'type' => '109'
                                                           },
                                                   '15' => {
                                                             'name' => 'initial_retry_timeout',
                                                             'offset' => '256',
                                                             'type' => '273'
                                                           },
                                                   '16' => {
                                                             'name' => 'state',
                                                             'offset' => '272',
                                                             'type' => '79264'
                                                           },
                                                   '17' => {
                                                             'name' => 'http_server',
                                                             'offset' => '280',
                                                             'type' => '80118'
                                                           },
                                                   '18' => {
                                                             'name' => 'requests',
                                                             'offset' => '288',
                                                             'type' => '79737'
                                                           },
                                                   '19' => {
                                                             'name' => 'cb',
                                                             'offset' => '304',
                                                             'type' => '80140'
                                                           },
                                                   '2' => {
                                                            'name' => 'retry_ev',
                                                            'offset' => '24',
                                                            'type' => '3077'
                                                          },
                                                   '20' => {
                                                             'name' => 'cb_arg',
                                                             'offset' => '312',
                                                             'type' => '183'
                                                           },
                                                   '21' => {
                                                             'name' => 'closecb',
                                                             'offset' => '320',
                                                             'type' => '80140'
                                                           },
                                                   '22' => {
                                                             'name' => 'closecb_arg',
                                                             'offset' => '328',
                                                             'type' => '183'
                                                           },
                                                   '23' => {
                                                             'name' => 'read_more_deferred_cb',
                                                             'offset' => '336',
                                                             'type' => '3224'
                                                           },
                                                   '24' => {
                                                             'name' => 'base',
                                                             'offset' => '376',
                                                             'type' => '3647'
                                                           },
                                                   '25' => {
                                                             'name' => 'dns_base',
                                                             'offset' => '384',
                                                             'type' => '4178'
                                                           },
                                                   '26' => {
                                                             'name' => 'ai_family',
                                                             'offset' => '392',
                                                             'type' => '109'
                                                           },
                                                   '27' => {
                                                             'name' => 'ext_method_cmp',
                                                             'offset' => '400',
                                                             'type' => '78941'
                                                           },
                                                   '3' => {
                                                            'name' => 'bind_address',
                                                            'offset' => '144',
                                                            'type' => '201'
                                                          },
                                                   '4' => {
                                                            'name' => 'bind_port',
                                                            'offset' => '152',
                                                            'type' => '420'
                                                          },
                                                   '5' => {
                                                            'name' => 'address',
                                                            'offset' => '160',
                                                            'type' => '201'
                                                          },
                                                   '6' => {
                                                            'name' => 'port',
                                                            'offset' => '168',
                                                            'type' => '420'
                                                          },
                                                   '7' => {
                                                            'name' => 'max_headers_size',
                                                            'offset' => '176',
                                                            'type' => '257'
                                                          },
                                                   '8' => {
                                                            'name' => 'max_body_size',
                                                            'offset' => '184',
                                                            'type' => '67939'
                                                          },
                                                   '9' => {
                                                            'name' => 'flags',
                                                            'offset' => '192',
                                                            'type' => '109'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_connection',
                                       'PrivateABI' => 1,
                                       'Size' => '408',
                                       'Type' => 'Struct'
                                     },
                          '79725' => {
                                       'BaseType' => '79363',
                                       'Name' => 'struct evhttp_connection*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79731' => {
                                       'BaseType' => '79725',
                                       'Name' => 'struct evhttp_connection**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79737' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '94',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78396'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '79774'
                                                          }
                                                 },
                                       'Name' => 'struct evcon_requestq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '79774' => {
                                       'BaseType' => '78396',
                                       'Name' => 'struct evhttp_request**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '79791' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '138',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_vhost',
                                                            'offset' => '0',
                                                            'type' => '80442'
                                                          },
                                                   '1' => {
                                                            'name' => 'sockets',
                                                            'offset' => '16',
                                                            'type' => '80481'
                                                          },
                                                   '10' => {
                                                             'name' => 'timeout_write',
                                                             'offset' => '128',
                                                             'type' => '273'
                                                           },
                                                   '11' => {
                                                             'name' => 'default_max_headers_size',
                                                             'offset' => '144',
                                                             'type' => '257'
                                                           },
                                                   '12' => {
                                                             'name' => 'default_max_body_size',
                                                             'offset' => '152',
                                                             'type' => '67939'
                                                           },
                                                   '13' => {
                                                             'name' => 'flags',
                                                             'offset' => '160',
                                                             'type' => '109'
                                                           },
                                                   '14' => {
                                                             'name' => 'default_content_type',
                                                             'offset' => '168',
                                                             'type' => '345'
                                                           },
                                                   '15' => {
                                                             'name' => 'allowed_methods',
                                                             'offset' => '176',
                                                             'type' => '436'
                                                           },
                                                   '16' => {
                                                             'name' => 'gencb',
                                                             'offset' => '184',
                                                             'type' => '80267'
                                                           },
                                                   '17' => {
                                                             'name' => 'gencbarg',
                                                             'offset' => '192',
                                                             'type' => '183'
                                                           },
                                                   '18' => {
                                                             'name' => 'bevcb',
                                                             'offset' => '200',
                                                             'type' => '80649'
                                                           },
                                                   '19' => {
                                                             'name' => 'bevcbarg',
                                                             'offset' => '208',
                                                             'type' => '183'
                                                           },
                                                   '2' => {
                                                            'name' => 'callbacks',
                                                            'offset' => '32',
                                                            'type' => '80518'
                                                          },
                                                   '20' => {
                                                             'name' => 'newreqcb',
                                                             'offset' => '216',
                                                             'type' => '80675'
                                                           },
                                                   '21' => {
                                                             'name' => 'newreqcbarg',
                                                             'offset' => '224',
                                                             'type' => '183'
                                                           },
                                                   '22' => {
                                                             'name' => 'errorcb',
                                                             'offset' => '232',
                                                             'type' => '80716'
                                                           },
                                                   '23' => {
                                                             'name' => 'errorcbarg',
                                                             'offset' => '240',
                                                             'type' => '183'
                                                           },
                                                   '24' => {
                                                             'name' => 'base',
                                                             'offset' => '248',
                                                             'type' => '3647'
                                                           },
                                                   '25' => {
                                                             'name' => 'ext_method_cmp',
                                                             'offset' => '256',
                                                             'type' => '78941'
                                                           },
                                                   '3' => {
                                                            'name' => 'connections',
                                                            'offset' => '48',
                                                            'type' => '80273'
                                                          },
                                                   '4' => {
                                                            'name' => 'connection_max',
                                                            'offset' => '64',
                                                            'type' => '109'
                                                          },
                                                   '5' => {
                                                            'name' => 'connection_cnt',
                                                            'offset' => '68',
                                                            'type' => '109'
                                                          },
                                                   '6' => {
                                                            'name' => 'virtualhosts',
                                                            'offset' => '72',
                                                            'type' => '80555'
                                                          },
                                                   '7' => {
                                                            'name' => 'aliases',
                                                            'offset' => '88',
                                                            'type' => '80592'
                                                          },
                                                   '8' => {
                                                            'name' => 'vhost_pattern',
                                                            'offset' => '104',
                                                            'type' => '201'
                                                          },
                                                   '9' => {
                                                            'name' => 'timeout_read',
                                                            'offset' => '112',
                                                            'type' => '273'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp',
                                       'PrivateABI' => 1,
                                       'Size' => '264',
                                       'Type' => 'Struct'
                                     },
                          '80' => {
                                    'BaseType' => '45',
                                    'Header' => 'types.h',
                                    'Line' => '37',
                                    'Name' => '__uint8_t',
                                    'PrivateABI' => 1,
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '80118' => {
                                       'BaseType' => '79791',
                                       'Name' => 'struct evhttp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80140' => {
                                       'Name' => 'void(*)(struct evhttp_connection*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '79725'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80146' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '113',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80239'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80245'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-113',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80179' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '112',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80146'
                                                          },
                                                   '1' => {
                                                            'name' => 'what',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '80267'
                                                          },
                                                   '3' => {
                                                            'name' => 'cbarg',
                                                            'offset' => '32',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_cb',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '80239' => {
                                       'BaseType' => '80179',
                                       'Name' => 'struct evhttp_cb*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80245' => {
                                       'BaseType' => '80239',
                                       'Name' => 'struct evhttp_cb**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80267' => {
                                       'Name' => 'void(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78396'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80273' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '122',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '79725'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '79731'
                                                          }
                                                 },
                                       'Name' => 'struct evconq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80310' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '126',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '78898'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80343'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-126',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80343' => {
                                       'BaseType' => '78898',
                                       'Name' => 'struct evhttp_bound_socket**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80360' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '133',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80430'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80436'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-133',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80393' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '132',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80360'
                                                          },
                                                   '1' => {
                                                            'name' => 'alias',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          }
                                                 },
                                       'Name' => 'struct evhttp_server_alias',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '80430' => {
                                       'BaseType' => '80393',
                                       'Name' => 'struct evhttp_server_alias*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80436' => {
                                       'BaseType' => '80430',
                                       'Name' => 'struct evhttp_server_alias**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80442' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '140',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80118'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80475'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-http-internal.h-140',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80475' => {
                                       'BaseType' => '80118',
                                       'Name' => 'struct evhttp**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80481' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '143',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78898'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80343'
                                                          }
                                                 },
                                       'Name' => 'struct boundq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80518' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '145',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80239'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80245'
                                                          }
                                                 },
                                       'Name' => 'struct httpcbq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80555' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80118'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80475'
                                                          }
                                                 },
                                       'Name' => 'struct vhostsq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80592' => {
                                       'Header' => 'http-internal.h',
                                       'Line' => '154',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80430'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80436'
                                                          }
                                                 },
                                       'Name' => 'struct aliasq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80649' => {
                                       'Name' => 'struct bufferevent*(*)(struct event_base*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3647'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '2662',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80675' => {
                                       'Name' => 'int(*)(struct evhttp_request*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78396'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80716' => {
                                       'Name' => 'int(*)(struct evhttp_request*, struct evbuffer*, int, char const*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78396'
                                                           },
                                                    '1' => {
                                                             'type' => '2651'
                                                           },
                                                    '2' => {
                                                             'type' => '109'
                                                           },
                                                    '3' => {
                                                             'type' => '345'
                                                           },
                                                    '4' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80722' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80804'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80810'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-39',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80755' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '80722'
                                                          },
                                                   '1' => {
                                                            'name' => 'process',
                                                            'offset' => '16',
                                                            'type' => '80846'
                                                          },
                                                   '2' => {
                                                            'name' => 'process_arg',
                                                            'offset' => '24',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '80804' => {
                                       'BaseType' => '80755',
                                       'Name' => 'struct evrpc_hook*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80810' => {
                                       'BaseType' => '80804',
                                       'Name' => 'struct evrpc_hook**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80846' => {
                                       'Name' => 'int(*)(void*, struct evhttp_request*, struct evbuffer*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '78396'
                                                           },
                                                    '2' => {
                                                             'type' => '2651'
                                                           },
                                                    '3' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '109',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '80852' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80804'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80810'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80889' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '58',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '80974'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '80980'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_pause_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '80926' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '98',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '81374'
                                                          },
                                                   '1' => {
                                                            'name' => 'ctx',
                                                            'offset' => '16',
                                                            'type' => '183'
                                                          },
                                                   '2' => {
                                                            'name' => 'cb',
                                                            'offset' => '24',
                                                            'type' => '81423'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_ctx',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '80974' => {
                                       'BaseType' => '80926',
                                       'Name' => 'struct evrpc_hook_ctx*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80980' => {
                                       'BaseType' => '80974',
                                       'Name' => 'struct evrpc_hook_ctx**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '80986' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '60',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'in_hooks',
                                                            'offset' => '0',
                                                            'type' => '80852'
                                                          },
                                                   '1' => {
                                                            'name' => 'out_hooks',
                                                            'offset' => '16',
                                                            'type' => '80852'
                                                          },
                                                   '2' => {
                                                            'name' => 'pause_requests',
                                                            'offset' => '32',
                                                            'type' => '80889'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hooks_',
                                       'PrivateABI' => 1,
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '81035' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '79',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '78615'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '78621'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81072' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '95',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '81289'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '81295'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_requestq',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81109' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'hook_meta',
                                                            'offset' => '0',
                                                            'type' => '81609'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '81615'
                                                          },
                                                   '10' => {
                                                             'name' => 'reply',
                                                             'offset' => '200',
                                                             'type' => '183'
                                                           },
                                                   '11' => {
                                                             'name' => 'request_marshal',
                                                             'offset' => '208',
                                                             'type' => '78724'
                                                           },
                                                   '12' => {
                                                             'name' => 'reply_clear',
                                                             'offset' => '216',
                                                             'type' => '3902'
                                                           },
                                                   '13' => {
                                                             'name' => 'reply_unmarshal',
                                                             'offset' => '224',
                                                             'type' => '78696'
                                                           },
                                                   '2' => {
                                                            'name' => 'pool',
                                                            'offset' => '24',
                                                            'type' => '81648'
                                                          },
                                                   '3' => {
                                                            'name' => 'evcon',
                                                            'offset' => '32',
                                                            'type' => '79725'
                                                          },
                                                   '4' => {
                                                            'name' => 'req',
                                                            'offset' => '40',
                                                            'type' => '78396'
                                                          },
                                                   '5' => {
                                                            'name' => 'ev_timeout',
                                                            'offset' => '48',
                                                            'type' => '3077'
                                                          },
                                                   '6' => {
                                                            'name' => 'name',
                                                            'offset' => '168',
                                                            'type' => '201'
                                                          },
                                                   '7' => {
                                                            'name' => 'cb',
                                                            'offset' => '176',
                                                            'type' => '81686'
                                                          },
                                                   '8' => {
                                                            'name' => 'cb_arg',
                                                            'offset' => '184',
                                                            'type' => '183'
                                                          },
                                                   '9' => {
                                                            'name' => 'request',
                                                            'offset' => '192',
                                                            'type' => '183'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_request_wrapper',
                                       'PrivateABI' => 1,
                                       'Size' => '232',
                                       'Type' => 'Struct'
                                     },
                          '81289' => {
                                       'BaseType' => '81109',
                                       'Name' => 'struct evrpc_request_wrapper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81295' => {
                                       'BaseType' => '81289',
                                       'Name' => 'struct evrpc_request_wrapper**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81301' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'common',
                                                            'offset' => '0',
                                                            'type' => '80986'
                                                          },
                                                   '1' => {
                                                            'name' => 'base',
                                                            'offset' => '48',
                                                            'type' => '3647'
                                                          },
                                                   '2' => {
                                                            'name' => 'connections',
                                                            'offset' => '56',
                                                            'type' => '80273'
                                                          },
                                                   '3' => {
                                                            'name' => 'timeout',
                                                            'offset' => '72',
                                                            'type' => '109'
                                                          },
                                                   '4' => {
                                                            'name' => 'requests',
                                                            'offset' => '80',
                                                            'type' => '81072'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_pool',
                                       'PrivateABI' => 1,
                                       'Size' => '96',
                                       'Type' => 'Struct'
                                     },
                          '81374' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '99',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '80974'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '80980'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-99',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81423' => {
                                       'Name' => 'void(*)(void*, enum EVRPC_HOOK_RESULT)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '183'
                                                           },
                                                    '1' => {
                                                             'type' => '77944'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '81429' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '106',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '81523'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '81529'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-106',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81462' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '105',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '81429'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '16',
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '24',
                                                            'type' => '183'
                                                          },
                                                   '3' => {
                                                            'name' => 'data_size',
                                                            'offset' => '32',
                                                            'type' => '257'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_meta',
                                       'PrivateABI' => 1,
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '81523' => {
                                       'BaseType' => '81462',
                                       'Name' => 'struct evrpc_meta*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81529' => {
                                       'BaseType' => '81523',
                                       'Name' => 'struct evrpc_meta**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81535' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '113',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqh_first',
                                                            'offset' => '0',
                                                            'type' => '81523'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqh_last',
                                                            'offset' => '8',
                                                            'type' => '81529'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_meta_list',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81572' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '115',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'meta_data',
                                                            'offset' => '0',
                                                            'type' => '81535'
                                                          },
                                                   '1' => {
                                                            'name' => 'evcon',
                                                            'offset' => '16',
                                                            'type' => '79725'
                                                          }
                                                 },
                                       'Name' => 'struct evrpc_hook_meta',
                                       'PrivateABI' => 1,
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '81609' => {
                                       'BaseType' => '81572',
                                       'Name' => 'struct evrpc_hook_meta*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81615' => {
                                       'Header' => 'evrpc-internal.h',
                                       'Line' => '171',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tqe_next',
                                                            'offset' => '0',
                                                            'type' => '81289'
                                                          },
                                                   '1' => {
                                                            'name' => 'tqe_prev',
                                                            'offset' => '8',
                                                            'type' => '81295'
                                                          }
                                                 },
                                       'Name' => 'anon-struct-evrpc-internal.h-171',
                                       'PrivateABI' => 1,
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '81648' => {
                                       'BaseType' => '81301',
                                       'Name' => 'struct evrpc_pool*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81680' => {
                                       'BaseType' => '77981',
                                       'Name' => 'struct evrpc_status*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '81686' => {
                                       'Name' => 'void(*)(struct evrpc_status*, void*, void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '81680'
                                                           },
                                                    '1' => {
                                                             'type' => '183'
                                                           },
                                                    '2' => {
                                                             'type' => '183'
                                                           },
                                                    '3' => {
                                                             'type' => '183'
                                                           }
                                                  },
                                       'Return' => '1',
